package com.example.schoollanguage;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.content.Intent;
import android.os.Bundle;

import com.example.schoollanguage.Adapters_and_itemTitle_class.ItemTitle;
import com.example.schoollanguage.Adapters_and_itemTitle_class.MorfologyAdapter;

import java.util.ArrayList;

public class MorfologyActivity extends AppCompatActivity implements MorfologyAdapter.OnItemClickListener {
    private RecyclerView recyclerView;
    private MorfologyAdapter morfologyAdapter;
    private ArrayList<ItemTitle> list;


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_morfology);
        recyclerView = findViewById(R.id.recyclerView_morfology);
        LinearLayoutManager manager = new LinearLayoutManager(this);

        list = new ArrayList<>();
        list.add(new ItemTitle(" Грамматика боюнча жалпы маалымат0"));
        list.add(new ItemTitle("Кыргыз тилинин мифологиясы. Сөз түркүмдөрү1"));
        list.add(new ItemTitle("Сөз тутуму. Үңгу .Морфема2"));
        list.add(new ItemTitle("Сөз жасоо3"));
        list.add(new ItemTitle("Зат атооч4"));
        list.add(new ItemTitle("Сын атооч5"));
        list.add(new ItemTitle("Сан атооч6"));
        list.add(new ItemTitle("Ат атооч7"));
        list.add(new ItemTitle("Этиш8"));
        list.add(new ItemTitle("Тактооч9"));
        list.add(new ItemTitle("Сырдык жана тууранды сөздөр10"));
        list.add(new ItemTitle("Кызматчы сөз түркүмдөрү11"));

        morfologyAdapter = new MorfologyAdapter(list);
        recyclerView.setLayoutManager(manager);
        recyclerView.setAdapter(morfologyAdapter);
        morfologyAdapter.setOnItemClickListener(MorfologyActivity.this);
    }

    void openActivityActivityThemes(String theme, String data) {
        Intent intent = new Intent(MorfologyActivity.this, ActivityThemes.class);
        intent.putExtra("key", data);
        intent.putExtra("key1", theme);
        startActivity(intent);
    }

    void superOpenLeksikogrophyActivity(String theme, String data, int image, String data2, int image2, String data3, int image3, String data4, int image4, String data5, int image5, String data6, int image6, String data7, int image7) {
        Intent intent = new Intent(MorfologyActivity.this, LeksikogrophyActivity.class);

        intent.putExtra("theme", theme);


        intent.putExtra("key", data);
        intent.putExtra("image", image);

        intent.putExtra("key1", data2);
        intent.putExtra("image1", image2);

        intent.putExtra("key2", data3);
        intent.putExtra("image2", image3);

        intent.putExtra("key3", data4);
        intent.putExtra("image3", image4);

        intent.putExtra("key4", data5);
        intent.putExtra("image4", image5);

        intent.putExtra("key5", data6);
        intent.putExtra("image5", image6);

        intent.putExtra("key6", data7);
        intent.putExtra("image6", image7);

        startActivity(intent);
    }

    void openSynAtooch(String theme, String data, int image, String data2, int image2, String data3) {
        Intent intent = new Intent(MorfologyActivity.this, LeksikogrophyActivity.class);

        intent.putExtra("theme", theme);

        intent.putExtra("key", data);
        intent.putExtra("image", image);

        intent.putExtra("key1", data2);
        intent.putExtra("image1", image2);

        intent.putExtra("key2", data3);
        startActivity(intent);
    }

    void openAtAtooch(String theme,String data, int image, String data2, int image2, String data3) {
        Intent intent = new Intent(MorfologyActivity.this, LeksikogrophyActivity.class);

        intent.putExtra("theme", theme);

        intent.putExtra("key", data);
        intent.putExtra("image", image);

        intent.putExtra("key1", data2);
        intent.putExtra("image1", image2);
        intent.putExtra("key2", data3);

        startActivity(intent);
    }

    @Override
    public void onItemClick(int position) {
        switch (position) {
            case 0:
                Intent intent = new Intent(MorfologyActivity.this, LeksikogrophyActivity.class);
                intent.putExtra("theme", "Тема: Кыргыз тилинин грамматикасы");
                intent.putExtra("key",
                        "\nМаселелер:\n" +
                                "1. Грамматика жөнүндө жалпы маалымат.\n" +
                                "2. Грамматиканын түрлөрү, бөлүмдөрү.\n" +
                                "3. Грамматикалык маани, грамматикалык каражат,\n" +
                                "грамматикалык форма, грамматикалык категория.\n" +
                                "\n1. Лингвистикада фонетика, лексикология сыяктуу негизги бөлүмдөрдүн бири болуп грамматика эсептелет. «Грамматика» терминин грекчеден которгондо «окуу жана жазуу өнөрү» дегенди туюндурат. Грамматика тил илиминде төмөнкүдөй маанилерде колдонулат:\n" +
                                "✔️ Сөздөрдүн өзгөрүш формаларын, түзүлүшүн, сөз айкашын жана сүйлөмдөрдүн типтерин үйрөтүүчү тил илиминин бир тармагы;\n" +
                                "✔️ Кандайдыр бир тилдеги сөздөрдүн, сөз айкаштарынын жана сүйлөмдөрдүн түзүлүшү;\n" +
                                "✔️ Сөздөрдүн өзгөрүшүнүн өз ара айкашынын жана сүйлөмдөрдүн түзүлүшүнүн белгилүү бир тил үчүн берилген эрежелеринин жыйындысы.\n" +
                                "Демек, ар бир тилдин грамматикасы тил менен бирге пайда болуп, анын өнүгүшү менен кошо өзгөрүүгө учурап, өз сапатын жакшыртып, нормаларын тактаган нечен доорлордун жемиши болуп саналат.\n" +
                                "\n2. Максаты, милдети, изилдөөлөрдү камтуу объектиси жана жазылыш стили боюнча грамматиканын бир нече түрлөрү бар:\n" +
                                "Нормативдик грамматика тигил же бул тилдин түзүлүшүн, андагы илимий жактан толук далилденген талашсыз эрежелерди өз ичине камтыган грамматика болуп эсептелет. Буга мектептерге, орто окуу жайларга, жогорку окуу жайларга, жогорку окуу жайларга арналган грамматикалар кирет. Мындай грамматикалар өкмөт тарабынан бекитилген атайын программалардын негизинде жазылат.\n" +
                                "Нормативдик грамматикалардын алда канча өркүндөтүлүп, тилдин түзүлүшүн терең анализдеп, бардык маселелерин камтыган, атайын тематикалык, ысымдык, терминдик ж.б. көрсөткүчтөр менен жабдылган басылмасы академиялык грамматика деп аталат.\n" +
                                "Илимий грамматикада тилдин түзүлүшүндөгү тигил же бул кубулуштар ар тараптуу илимий көз караштардын негизинде тереңдетилип, ар кандай талаш-тартыш маселелери менен кошо берилет. Илимий иликтөөлөрдүн мүнөзүнө жараша ал тарыхый грамматика жана сыпаттама грамматика деп экиге бөлүнөт. Тарыхый грамматика (диахрондук грамматика деп да аталат.) тилдин грамматикалык түзүлүшүн тарыхый өсүп-өнүгүш процессинде териштирет. Сыпаттама грамматика (дескриптивдик грамматика деп да аталат) тилдин түзүлүшүндөгү ар түрдүү кубулуштардын бардыгын азыркы учурдун гана көз карашынан туруп баштан-аяк иликтеп чыгат.\n" +
                                "Салыштырма грамматика тектеш тилдердин грамматикалык түзүлүшүндөгү жалпылыктар менен айырмачылыктарды аныктоо максатын көздөп, өз ара салыштырууларды жүргүзөт. Мунун байыркы жазма эстеликтердин материалдардын пайдалануу менен иликтөөлөрдү жүргүзгөн салыштырма-тарыхый грамматика деген өзгөчө түрү да бар.\n" +
                                "Салыштырма грамматиканын бир түрү болуп тектеш эмес тилдердин материалдарын салыштырып изилдеген грамматика эсептелет. Мындай грамматика тектеш эмес тилдердин грамматикалык түзүлүшүндөгү жалпылык жана айырмачылыктарды иликтеп, жалпы тил илиминдеги айрым теориялык маселелердин чечилишин көздөйт.\n" +
                                "Грамматиканын бөлүмдөрү. Грамматика бири-биринен изилдөө максаты жана изилдөө алкагы боюнча айырмаланган эки бөлүмдөн турат.\n" +
                                "Морфология – тилдин грамматикалык курулушунун алгачкысы. Ал сөздүн грамматикалык касиеттерин ачып, изилдеп үйрөтөт. Сөздүн курамын, сөз жасоонун жолдорун, сөз түркүмдөрүн окутат.\n" +
                                "Синтаксис - тилдин грамматикалык курулушунун андан аркысы. Анда сөз айкаштары, алардын типтери, айкашкан сөздөрдүн өз ара карым-катыш байланыштары, сүйлөм, сүйлөмдүн түзүлүшү, түрлөрү, мүчөлөрү окутулат.\n" +
                                "\n3. Сөздөр лексикалык маани (сөздүн керт башына гана тиешелүү) менен катар грамматикалык мааниге да ээ болушат.\n Мисалы:");

                intent.putExtra("image", R.drawable.morfology_photo_1);

                intent.putExtra("key1", "Демек грамматикалык маани дегенибиз-айрым сөздөрдүн керт башына гана тиешелүү болбостон, алардын бүтүндөй бир тобуна тиешелүү болгон жалпыланган маани. Грамматикалык маанилер экиге бөлүнөт:\n" +
                        "✔️ Жалпы категориялык грамматикалык маанилер;\n" +
                        "✔️ Жеке грамматикалык маанилер.\n" +
                        "Жалпы категориялык грамматикалык маанилерге\n" +
                        "төмөнкүлөр кирет: заттык маани, белгилик маани, сын- сыпаттык маани, сан-өлчөмдүк маани, кыймыл-аракеттик маани ж.б.\n" +
                        "Жеке грамматикалык маанилерге жөндөмө, сан, жак, таандык, чак, ыңгай, мамиле, даража ж.б. маанилер кирет.\n" +
                        "Сөз түрдүү формада өзгөрүлүп кетсе да андагы жалпы категориялык маанилер грамматикалык маани өзгөрбөй кала берет. Ал эми жеке грамматикалык маанилер болсо өзгөрүлө берет. Мисалы: ук, уктук, уккула деген сөз формаларынын баарында тең кыймыл-аракеттик маани (жалпы категориялык маани) сакталып турат да, жеке грамматикалык маанилер өзгөрүп кеткен: ук (буйрук ыңгай, 2-жак, жекелик сан, келер чак маанилери), уктук (башталгыч ыңгай, 1-жак, көптүк сан, өткөн чак маанилери), уккула ( буйрук ыңгай, 2-жак, көптүк сан, келер чак маанилери).\n" +
                        "Грамматикалык маанилер тиешелүү грамматикалык каражаттар аркылуу туюндурулат. Алар:\n" +
                        "✔️ Уланды мүчөлөр:барам (-ым), кызыңа (-ың,-а), уулунун (-ы,-нын) ж.б.\n" +
                        "✔️ Кызматчы сөздөр: сиз жөнүндө, келечек тууралуу, ошол го, ал үчүн, үйдү көздөй ж.б.\n" +
                        "✔️ Сөздүн лексика -грамматикалык маанилер боюнча топторду түзүшү: кагаз, суу, асман, буудай, кайчы-заттык маанилер; тур, бас, кыймылда, сүйлө, жүрү-кыймыл-аракеттик маанилер; жети, тогуз, кырк, жетимиш, токсон-сан-өлчөмдүк маанилер; жашыл, кызгылтым, күрөң, боз, ак- сын-сыпаттык маанилер ж.б.\n" +
                        "✔️ Интонация: Мен, Мен? Эмне? Бол! Кош! Өш! ж.б.\n" +
                        "✔️ Басым: Сатып бересиң. (буюруу маанисинде айтылды); Сатып бересиң! (Өкүм буюруу маанисинде айтылды) ж.б.\n" +
                        "Грамматикалык каражаттар сөздүн грамматикалык формаларын уюштурат. Демек, ар кандай грамматикалык маани сөзсүз түрдө белгилүү грамматикалык формалар менен ишке ашат.\n" +
                        "Сөздүн бир же бир нече жеке грамматикалык маанилер боюнча бири-биринен айырмаланган түрлөрү анын грамматикалык формалары деп аталат. Мисалы: китеп, китептин, китепке, китепти, китепте, китептен, китеби, китебиң, китебим, китебиме, китебибиз, китептер деген сөздөрдүн бардыгы китеп деген сөздүн эле ар түрдүү формалары. Бардыгында эле тең сөздүн лексикалык мааниси сакталып турат, бирок ар биринде ар башка грамматикалык маанилер бар.\n" +
                        "Ошентип грамматикалык формалар сөзгө жаңы грамматикалык маани алып келет, бирок жаңы лексикалык маани жарата албайт.\n" +
                        "Кээ бир сөздөр өзгөрүлбөй турган бир гана грамматикалык формада болот. Мисалы: менен, жана, боюнча, жөнүндө, го, эх, эй, ж.б.\n" +
                        "Тиешелүү грамматикалык каражаттар аркылуу туюндурулуп, бири-биринен айырмаланган жекече грамматикалык маанилердин жыйындысы грамматикалык категория деп аталат. Кыргыз тилинин грамматикасында сан, жак, чак, жөндөмө, таандык, ыңгай, мамиле ж.б. категориялар бар.\n");
                startActivity(intent);
                break;
            case 1:
                openActivityActivityThemes(
                        "Тема: Кыргыз тилинин морфологиясы, анын изилдөө объектилери",
                        "Маселелер:\n" +
                                "1. Кыргыз тилинин морфологиясы, анын изилдөө объектилери жөнүндө жалпы түшүнүк.\n" +
                                "2. Сөз түркүмдөрү жөнүндө жалпы түшүнүк.\n" +
                                "3. Сөз түркүмдөргө бөлүштүрүүнүн принциптери.\n" +
                                "\n1.Тил илиминде грамматика морфология жана синтаксис аттуу эки бөлүмдөн турат. «Морфология» термини гректин «mоrphе» (форма) жана «lоgоs» (окуу, илим) сөздөрүнөн келип чыгат да, «грамматикалык форма жөнүндөгү илим» деген түшүнүктү билдирет. Бирок морфология жеке эле сөздөрдүн формасын изилдөө менен гана чектелбестен, сөздүн формасы аркылуу туюндурулган грамматикалык маанилерди изилдеп үйрөтөт.\n" +
                                "Мисалы: тоо, тоонун, тоого, тоодо, тоодон жана ушул өңдүү бардык бирдиктер морфологияда бир сөздүн ар башка формасы деп каралат да, алардын маанилериндеги өзгөчөлүктөр тастыкталат: тоо - атооч жөндөмөдөгү заттын атын билгизет; тоого - барыш жөндөмөдөгү багытты көргөзөт; тоодо - жатыш жөндөмөдөгү орунду туюндурат.\n" +
                                "Сөздөр морфологияда лексика-семантикалык жана грамматикалык бөтөнчөлүктөрүнө карай жалпылаштырылып, чоң-чоң топторго, сөз түркүмдөрүнө бөлүштүрүлөт, алардын мүнөздүү категориялары менен белгилери аныкталат.\n" +
                                "Морфологиялык талдоонун төмөнкү чеги морфема менен аныкталса, жогорку чеги сөз менен аныкталат. Ал эми морфема деп сөз тутумундагы маани берүүчү эң кичине бирдик аталат. Морфологиянын жогорку чеги сөз жана сөздүн грамматикалык формасы менен бүтөт. Демек, морфология сөздүн чегинен тыш бирдиктерди изилдебейт, тилдин грамматикалык түзүлүшү да морфологиядан башталат. Морфологиянын негизги изилдөө объектилерине сөз тутуму жана сөз түркүмдөрү, алардын категориялары кирет." +
                                "\nКыргыз тилинин морфологиясы алгач мектеп окуучулары үчүн К.Тыныстанов тарабынан жазылып, 1934-жылы жарыкка чыккан. Анда кыргыз тилинин тыбыштык түзүлүшү менен сүйлөм курулушуна да орун берилген, сөздүн тутуму бир топ терең талданып көрсөтүлгөн. Сөз түркүмдөрүн атоочтор жана этиштер деп эки чоң топко бөлүштүрүп, алардын ар бирин андан ары тутумдук түзүлүшү боюнча топторго ажыратып окуткан. Ушунун өзүнөн эле алгач кыргыз тилинин морфологиясы башка тилдердин таасирисиз иштелип чыккандыгын байкасак болот. Себеби К.Тыныстановго чейин үлгү аларлык, багыт берерлик окуу китептер, башка эмгектер жазыла элек болучу.\n" +
                                "Кыргыз тилинин морфологиясы боюнча окуу китеп (1964- жана 1980-жылкы академиялык грамматикаларды эске албаганда) С.Давлетов, С.Кудайбергеновдор тарабынан даярдалып, 1980-жылы басылып чыккан. 1997-жылы «Сорос- Кыргызстан» фондунан И.Абдувалиев, Т.Садыковдун окуу китеби жарык көргөн. И.Абдувалиевдин «Кыргыз тили» аттуу 2003-жылы чыккан эмгегинде бир катар тактоо, толуктоолор киргизилип, сөз түркүмдөрү кайра терең иштелип чыккан.\n" +
                                "\n2. Сөздөр лексикалык маани менен катар грамматикалык мааниге да ээ болушат. Кандайдыр ойду туюндуруу үчүн сөздөр бири-бири менен байланышка түшүп, сүйлөмгө айланат. Сөздөрдүн сүйлөм түзүүдөгү мындай касиеттери грамматикалык маанилердин жардамы аркылуу жүзөгө ашырылат. Грамматикалык маанилер сөздүн лексикалык маанисин өзгөртпөйт, аны ар түрдүү кырдаалдарга ылайыкташтырат. Мисалы: окуучу, мектеп, оку деген сөздөрдүн ар бири өзүнчө лексикалык мааниге ээ болуп турат. Окуучу - мектеп жашындагы окуп, билим алуучу бала же кыз; мектеп - ошол балдар, кыздар окуп билим ала турган жай; оку - билим алуу ж.б. Эми ушул сөздөр бири-бири менен байланышка түшүп, сүйлөм болуп, ойду туюндурду дейли:\n" +
                                "Окуучу/лар мектеп/те оку/ш/а/т.\n" +
                                "Көрүнүп тургандай, бул сүйлөмдө окуучу, мектеп, оку деген үч сөздүн лексикалык мааниси сакталып, бири-бири менен карым-катышка түшүп, грамматикалык маанилерге ээ болду." +
                                "\nТактап айтканда, аталган сүйлөмдөгү окуучу - зат атооч, мектеп - зат атооч, оку – этиш.\n" +
                                "Грамматикадагы борбордук түшүнүктүн бири - сөз түркүмдөрү. Сөздөрдүн баары эле мааниси, формасы менен жасалышы жана синтаксистик функциясы боюнча бир өңчөй боло бербейт. Маселен, бир катар сөздөр заттарды билгизип, жөндөмө, таандык, сан, жак боюнча өзгөрүлсө (зат атоочтор), экинчилери кыймыл аракетти билгизип чак, жак, ыңгай ж.б.(этиштер) боюнча өзгөрөт. Заттардын ар кандай белгилерин билгизип, даражалар боюнча өзгөргөн сөздөр (сын атооч) да, сан жөнүндөгү түшүнүктү туюндурган сөздөр (сан атооч) да бар. Зат, сан, сын жөнүндөгү түшүнүктү атап көрсөтпөгөнү менен маанилерди өтө эле жалпылаштырып туюндурган сөздөр (ат атооч) да кезигет. Ушул өңдүү өзгөчөлүктөрүнө карай сөздөр морфологияда негизги топторго – сөз түркүмдөрүнө бөлүнөт.\n" +
                                "Тилдеги сөздөрдү лексика-грамматикалык белгилерине карай топтоштуруу сөз түркүмдөргө бөлүштүрүүнүн атайын принциптерине ылайык ишке ашырылат. Кыргыз тилинде сөздөр сөз түркүмдөрүнө маанилик, морфологиялык жана синтаксистик принциптердин негизинде топтоштурулат. Кыргыз тилиндеги сөз түркүмдөрү төмөнкүдөй эки топко бөлүнөт:]\n" +
                                "\t\t\t\t\tМаани берүүчү сөз түркүмдөрү: \n" +
                                "\t\t\t\t\t\t\t\t\t\tзат атооч; \n" +
                                "\t\t\t\t\t\t\t\t\t\tсын атооч;\n" +
                                "\t\t\t\t\t\t\t\t\t\tсан атооч;\n" +
                                "\t\t\t\t\t\t\t\t\t\tат атооч;\n" +
                                "\t\t\t\t\t\t\t\t\t\tэтиш;\n" +
                                "\t\t\t\t\t\t\t\t\t\tтактооч.\n" +
                                "\n\n\t\t\t\t\tМаани бербөөчү сөз түркүмдөрү: \n" +
                                "\t\t\t\t\t\t\t\t\t\tтууранды сөз;\n" +
                                "\t\t\t\t\t\t\t\t\t\tсырдык сөз;\n" +
                                "\t\t\t\t\t\t\t\t\t\tбайламта;\n" +
                                "\t\t\t\t\t\t\t\t\t\tжандооч; \n" +
                                "\t\t\t\t\t\t\t\t\t\tбөлүкчө." +
                                "\n\nАл эми морфология боюнча жарык көргөн И.Абдувалиевдин «Кыргыз тили» аттуу соңку окуу китебинде сөз түркүмдөрү үч топко бөлүнүп каралат, б.а. тууранды жана сырдык сөздөрдүн лексикалык мааниге ээ болгону менен," +
                                "синтаксистик аткарган кызматына карай талдап, өзгөчө сөз түркүмүн киргизет:\n\n" +
                                "\t\t\t\t\tМаани берүүчү сөз түркүмдөрү: \n" +
                                "\t\t\t\t\t\t\t\t\t\tзат атооч; \n" +
                                "\t\t\t\t\t\t\t\t\t\tсын атооч;\n" +
                                "\t\t\t\t\t\t\t\t\t\tсан атооч;\n" +
                                "\t\t\t\t\t\t\t\t\t\tат атооч;\n" +
                                "\t\t\t\t\t\t\t\t\t\tэтиш;\n" +
                                "\t\t\t\t\t\t\t\t\t\tтактооч.\n\n" +
                                "\t\t\t\t\tӨзгөчө сөз түркүмдөрү:\n" +
                                "\t\t\t\t\t\t\tсырдык сөздөр; \n" +
                                "\t\t\t\t\t\t\tтууранды сөздөр.\n\n" +
                                "\t\t\t\t\tКызматчы сөздөр:\n" +
                                "\t\t\t\t\t\tбайламталар; \n" +
                                "\t\t\t\t\t\tбөлүкчөлөр; \n" +
                                "\t\t\t\t\t\tжандоочтор; \n" +
                                "\t\t\t\t\t\tмодалдык сөздөр.\n\n" +
                                "Булардын ичинен маани берүүчү же негизги сөз түркүмдөрү өз алдынча лексикалык мааниге ээ болуп, сүйлөм мүчөсүнүн кызматын аткарат, кээде сүйлөм да боло алат.\n" +
                                "Сөздөр жеке, өз алдынча колдонулуш, толук түшүнүктү бериш даражасына, сүйлөм мүчөсүнүн милдетин өз алдынча аткара алыш өзгөчүлүктөрүнө карай негизги сөздөр жана кызматчы сөздөр деп экиге бөлүнөт.\n" +
                                "Негизги сөздөр зат, сын, сан, кыймыл – аракет жана башкалар жөнүндө толук (даана) түшүнүк берет; жеке, өз алдынча сүйлөм же сүйлөм мүчөсү боло алат. Буларды башка сөздөр менен байланыштырбай, жеке өз алдынча колдонууга, суроо берүүгө да болот. Негизги (же маани берүүчү) сөздөргө зат, сын, сан, ат атоочтор, тактоочтор, тууранды сөздөр кирет. Ошондуктан бул сөз түркүмдөрү негизги сөз түркүмдөрү деп аталат.\n" +
                                "Кызматчы сөздөр толук түшүнүктү билгизе албайт, жеке, өз алдынча сүйлөм мүчөсү да болуп түшпөйт. Буларга суроо да берилбейт. Мисалы: менен, жана, го, да ж.б. Кызматчы сөздөргө байламта, жандооч жана бөлүкчөлөр кирет. Булар сөздөрдү, сүйлөмдөрдү өз ара байланыштырып же аларга кошумча маани киргизип турат. Ошондуктан бул сөз түркүмдөрү кызматчы сөз түркүмдөрү деп аталат.\n" +
                                "Өзгөчө сөз түркүмү. Сырдык сөздөр менен тууранды сөздөр жогорудагы эки топтогу сөз түркүмүнөн айырмаланып, кишинин ички сезимин билдирет, же ар кандай дабыштарды, көрүнүштөрдү туурап көрсөтөт. Бул топко кирген сөздөр лексикалык мааниге ээ болсо да, грамматикалык жактан өз алдынча турганда синтаксистик кызмат аткара алышпайт. Ошондуктан бул сөз түркүмдөрү өзгөчө сөз түркүмдөрү деп аталат.\n" +
                                "\n3.Грамматикадагы борбордук түшүнүктөрдүн бири-сөз түркүмдөрү экендигин билдик. Эми сөздөрдү тилдеги табиятынын ар түрдүүлүгүнө ылайык чоң-чоң топторго, б.а. сөз түркүмдөрүнө бөлүштүрүү кандай принциптерге негизделет деген суроо туулат. Андай бөлүштүрүү үчүн сөз түркүмдөрүн классификациялоонун принциптери жетекчиликке алынат. Ал принциптер төмөнкүлөр:\n" +
                                "✔️ Семантикалык принцип;\n" +
                                "✔️ Морфологиялык принцип;\n" +
                                "✔️ Синтаксистик принцип.\n" +
                                "\nСемантикалык же маанилик принцип. Сөздөрдү\n" +
                                "түркүмдөргө бөлүштүрүүнүн өтө байыркы жана эң негизги принциби болгон бул принцип кыргыз " +
                                "тилиндеги сөздөрдү сөз түркүмдөргө бөлүштүрүүдө да башкы ролду ойнойт. Сөздөрдү жалпы " +
                                "категориялык грамматикалык маанилери боюнча топтоштуруу бул принциптин негизги мазмунун түзөт. " +
                                "Мисалы, жалпы категориялык заттык маани ар кандай нерселердин, жаныбарлардын, кишилердин, жер-суу " +
                                "обьектилеринин, асман телолорунун, буюмдардын, абстрактуу түшүнүктөрдүн аттарын жалпылаштырып, " +
                                "аларды өзүнчө бир түркүмгө бириктирет. Ошондуктан, адам, суу, күн, кой, бакыт, саат ж.б. сөздөрдүн " +
                                "чоң тобу лексикалык маанилери боюнча өз ара бири-биринен айырмаланса да зат атооч деген сөз " +
                                "түркүмүнө кирет.Ал эми жалпы категориялык кыймыл-аракет, сын-сыпат, сан-өлчөм ж.б.у.с.маанилердин " +
                                "астракцияланышы, жалпылаштырылышы башка сөз түркүмдүрүнүн пайда болушуна алып келген.\n" +
                                "\nМорфологиялык принцип. Бул принцип сөздөрдү сөз түркүмдөргө бөлүштүрүүдө сөз өзгөртүүчү системасын жетекчиликке алат. Анткени сөздөрдө маанилик белгилери менен кошо сырткы турпатындагы ар кандай өзгөрүү өзгөчөлүктөрү болот, б.а. жөндөмө, жак, таандык, чак, мамиле, ыңгай, даража, сан ж.б. грамматикалык категориялар боюнча өзгөрүү же өзгөрбөө өзгөчөлүктөрүнө жараша топторго бөлүнөт. Кайсы бир сөздөрдүн тигил же бул сөз түркүмүнө жатарын семантикалык принцип аныктай албаса, морфологиялык принцип жардамга келет.\n" +
                                "\nСинтаксистик принцип. Бул принцип сөздөрдүн синтаксистик кызмат аткаруу мүмкүнчүлүктөрүнө ылайык сөз түркүмдөрүнө тактык, аныктык киргизет. Мисалы, зат атооч сөздөрдүн сөз айкашындагы, сүйлөмдөгү аткарган кызматтары этиш, сын же сан атоочтордун сөз айкашындагы, сүйлөмдөгү аткарган кызматтары менен дал келбейт. Ошондуктан бул принципте сөз түркүмдөргө бөлүштүрүү сөздөрдүн синтаксистик кызматына, башка сөздөр менен айкашуу мүмкүнчүлүгүнө, ал сөздөрдүн өз ара байланышуу жолдоруна (ээрчишүү, башкаруу, ыкташуу, таандык) жана алган ордуна негизделет.");
                break;
            case 2:
                openActivityActivityThemes("Тема: Сөздүн тутуму",
                        "Маселелер:\n" +
                                "1. Сөз тутуму жөнүндө жалпы маалымат. 2. Морфема жана анын түрлөрү.\n" +
                                "3. Уңгу жана негиз.\n" +
                                "4. Курандылар жана уландылар.\n" +
                                "\n1. Сөз - тилдин эң негизги материалдык бирдиги. Сөздө анын ички табиятын мүнөздөгөн маани-мазмуну жана сырткы турпатын мүнөздөгөн тыбыштык түзүлүшү болуп, бири- биринен ажырагыс эки тарабы бар. Сөздөрдүн сырткы турпатын анын тыбыштык түзүлүшү, муун түзүлүшү жана морфемалык түзүлүшү аныктайт. Сөздүн тыбыштык түзүлүшүн - фонетикада, сөздүн муундук түзүлүшүн - лексикологияда үйрөндүк. Ал эми сөздүн морфемалык түзүлүшү - морфологияда окутулат.\n" +
                                "Кыргыз тилиндеги сөздөр ар бири өз алдынча мааниге жана кызматка ээ болгон мүчөлөрдөн турат. Сөздүн тутумундагы мына ушул мүчөлөр анын морфологиялык жактан түзүлүшүн шарттайт.\n" +
                                "\n2. Жалпы лингвистикада сөз мүчөлөрүн морфемалар деп аташат. Морфема сөздүн андан ары тутумдарга (мүчөлөргө) бөлүнбөй турган эң кичинекей морфологиялык бирдиги болуп эсептелет. Мисалы: «Кыздуу үйдө кыл жатпайт» деген макалдагы ар бир сөз төмөнкүдөй морфемалардан (мүчөлөрдөн) турат: кыз-дуу (2 морфема), үй-дө (2 морфема), кыл (1 морфема), жат-па-й-т (4 морфема).\n" +
                                "Кээ бир сөздөр морфемаларга ажырабайт, б.а. тутумунда бир эле морфема болот: ой, сан, тоо, жылкы, кайт, ут, ме, ээ, суу, алты, тарых ж.б.\n" +
                                "Кээ бир сөздөр болсо, тарыхый өсүп-өнүгүшү, б.а., келип чыгышы изилденип, белгилүү болгондо гана морфемаланат. Мисалы: сүйлө деген сөз эки морфемадан турат. Биринчиси-сөз, экинчиси-ла (салыштыр:өзбекче сузла).\n" +
                                "Ал эми көпчүлүк сөздөр кыргыз тилинде оңой эле морфемаларга ажырайт. Мисалы: ук-та, жаа-н-да, китеп-кана- чы-лар, бас-тыр-ма ж.б.\n" +
                                "Кыргыз тилинде маани-мазмундук белгилери боюнча өз ара жалпылыкты түзүп турган морфеманын үч түрү бар. Алар: уңгу, куранды, уланды.\n" +
                                "Уңгу-сөздүн эң негизги морфемасы, лексикалык маани берип, андан ары ажырабай турган бөлүгү. Ал лексикалык маани менен кошо грамматикалык маанини да туюндурат. Уңгу туюндурган грамматикалык маанилер көбүнчө жалпы категориялык маани болуп, сөздүн лексикалык маанисине жакын келет. Ошондуктан уңгуну семантикалык морфема деп да аташат.\n" +
                                "Кыргыз тилиндеги уңгу өз алдынча сөз болуп да кызмат кыла алат. Мисалы: адеп, адеп-түү,адеп-сиз; эмгек, эмгек-чил, эмгек-тер-ге ж.б.\n" +
                                "Кыргыз тилиндеги уңгулар маанисине карай эркин уңгу жана байланышма уңгу деп эки топко бөлүнөт.\n" +
                                "\nЭркин уңгу- кошумча морфеманын жардамысыз эле, өз алдынча сөз катары колдонула берет. Мындай уңгулар куранды же уландылар уланган түрдө да, уланбаган түрдө да кезиге берет: алтын, акыл-дуу-лар, кагаз-га, мурас-кор, кант, күлкү-лүү ж.б.\n" +
                                "\nБайланышма уңгу- кепте кошумча морфеманын жалганып турушу аркылуу гана колдонулуучу уңгу: мык-чы, мыкы-й, тегере-к, тоголо-к ж.б. Байланышма уңгулар кыргыз тилинде абдан аз.\n" +
                                "Сөздүн уланды мүчөсүн алып салгандан калган бөлүгү сөздүн негизи деп аталат. Сөздүн негизи туруктуу болбойт, анын негиз экендиги конкреттүү сүйлөмдө же текстте гана белгилүү болот. Кыргыз тилиндеги сөздүн негизи уланды мүчөлөрдү гана эмес, куранды мүчөлөрдү да кабыл алууга жөндөмдүү келет. Мисалы: Акылдуунун сөзү кыска, айта салса нуска. Мында акылдуунун деген сөздүн негизи акылдуу (-нын- уланды мүчө). Рыскул карынын өзгөчө сапаты катары анын акылмандыгын айтар элем. (Сөздүн негизи-акылмандык, уңгусу-эки мисалда тең акыл болот).\n" +
                                "Кыргыз тилиндеги сөздүн негизи түзүлүшү боюнча тубаса негиз жана туунду негиз деп экиге бөлүнөт.\n" +
                                "Лексикалык мааниси жана түзүлүшү боюнча андан ары тутумдарга ажыратылбаган негиз тубаса негиз деп аталат. Мисалы: кыз, комуз, айт, тур, беш, кызыл, жылдыз, узун, кыска ж.б.\n" +
                                "Тутумунда куранды мүчөсү бар, башкача айтканда, куранды мүчө аркылуу жасалган негиз туунду негиз деп аталат. Мисалы: комузчу (-чы куранды), айтыш (-ыш куранды), билимдүү (-луу куранды) ж.б.\n" +
                                "Тубаса негиз сөздүн уңгусуна дал келет. Ал эми туунду негиз сөздүн уңгусуна дал келбейт. Мисалы: Билимдүүнүн билими кишиге жугат. Мындагы 1-2-сөздүн негизи туунду негиздер - билимдүү жана билим, ал эми уңгулары бил деген сөз. 3-4-сөздөрдүн негизи тубаса негиздер – киши жана жук, алар уңгу менен дал келет.\n" +
                                "Морфологиялык жол менен жасалышы сөздөрдүн негизинен башталат, себеби ар кандай куранды мүчөлөр негизге жалганат. Андан соң уланды мүчөлөр уланат.\n" +
                                "\n4. Курандылар сөздүн тыбыштык турпатын гана эмес, лексикалык маанисин да өзгөртөт. Жаңы лексикалык маани, жаңы сөз жаратат, б.а. курандылар сөз жасай турган касиетке ээ. Кыргыз тилинде курандылар абдан көп. Алар зат атоочтун курандылары, сын атоочтун курандылары, этиштин курандылары жана тактоочтун курандылары болуп бөлүнөт.\n" +
                                "✔️ Зат атоочтун курандылары:-кана,-лаш,-лык,чы,- чылык,-кер,-кеч, -кор, -поз, -стан,-тай,-ча,-чык,-стан ж.б.\n" +
                                "✔️ Сын атоочтун курандылары: -луу, -сыз, -дай,-лык, - лащ,-чыл,-чан,-кер, -кор, -поз, -көй, -дар, -дак ж.б.\n" +
                                "✔️ Этиштин курандылары: -а, -ай, -ла, -ар, -ла, -лан, -лаш, -сыра, -ык, -ал, -ар, -сы,-сын, -гансы, -гыла, -лык ж.б.\n" +
                                "✔️ Тактоочтун курандылары: -ча, -лап,-чылап, -лай, - чалык, -сын, -лата, -ата, -та ж.б.\n" +
                                "Сөз жасоо кызматынын мүнөзүнө жараша куранды мүчөлөр өнүмдүү курандылар, аз өнүмдүү курандылар жана өнүмсүз курандылар болуп ажырайт.\n" +
                                "Өнүмдүү курандылар ар кандай сөздөрдөн сөз жасоого жөндөмдүү болуп, абдан көп сөздөрдү жасай берет. Зат атоочтун –чы курандысы: сүрөтчү, кызматчы, жумушчу, койчу, жолчу, катчы, уйкучу ж.б. Этиштин –ла курандысы: ойло, ыйла, бийле, бойло, жайла, суула ж.б. \n\n" +
                                "\nАз өнүмдүү курандылар саналуу гана сөздөрдү жасайт. Мисалы:-мер: ишмер, сөзмөр; -дар: кабардар, карыздар, кусадар, жарадар ж.б. –анак: сүзөнөк, кабанак, тебенек ж.б.\n" +
                                "\nӨнүмсүз курандылар тилдин азыркы жашап турган этабында сөз жасабайт, жасаса да бирин-экин гана сөздү жасайт. Буларды сөздүн тутумунан ажыратуу бир топ кыйын, көбүнчө тарыхый жактан аныкталып мүчөлөнөт. Мисалы: -кел, -дач, - тык, -шык жеген курандылар: эткел, кырдач, жантык, кыйшык деген сөздөрдү гана жасайт.\n" +
                                "\nУландылар сөздүн лексикалык маанисин өзгөртпөйт. Алар сөзгө жалганып, анын грамматикалык маанисин өзгөртүп, сөздүн ар түрдүү формаларын жасайт.\n" +
                                "М: ата+ым=атам, ата+ыбыз=атабыз,ата+нын=атанын ж.б.\n" +
                                "Кыргыз тилиндеги уландыларга жөндөмө мүчөлөрү, таандыктын мүчөлөрү, көптүк сан мүчөсү, жак мүчөлөрү, чак мүчөлөрү, мамиле мүчөлөрү, ыңгай мүчөлөрү, терс маани мүчөсү, суроо маани мүчөсү кирет. Булардын ар бири жалганган сөзгө тиешелүү грамматикалык маанилерди гана өзгөртүп, лексикалык мааниге таасир тийгизбейт.\n" +
                                "Кыргыз тилинде сөздүн тутумундагы мүчөлөр белгилүү орун тартип менен келет. Анткени түрк тилдерине мүнөздүү болгон агглютинация кубулушу боюнча уңгудан же негизден кийин маанилик тартип менен сөз мүчөлөрү биринин артынан бири жалганып келе берет. Демек, дайыма биринчи орунда уңгу, андан соң куранды, уландылар жалганып кетет.");
                break;
            case 3:
                openActivityActivityThemes("Тема: Сөз жасоо",
                        "Маселелер:\n" +
                                "1. Тил илиминдеги сөз жасоо маселеси. 2. Сөз жасоонун жолдору.\n" +
                                "3. Жөнөкөй жана татаал сөздөр.\n\n" +
                                "1. Сөз жасоо. Пикир алмашуу карым-катышындагы эң негизги тилдик бирдик - сөз. Сөздөрдүн бара-бара эскирип, унутулуп калары, алардын маанилеринин өзгөрүп кетиши, маанилердин көбөйүп кетиши жана жаңы сөздөрдүн да пайда болушу тууралуу лексикологияда айтылган. Тилдин лексикалык корунун жаңы сөздөр менен улам толукталып байый бериш процесси тиешелүү морфологиялык көрүнүш аркылуу, башкача айтканда, сөз жасоо аркылуу ишке ашат.\n" +
                                "Сөз жасоо тил илиминин өз алдынча бөлүмү катары да каралат. Өзбек лингвисттери, мисал үчүн, сөз жасоону лексикология, грамматика сыяктуу эле бөлүм деп кабыл алып грамматика жазышкан.\n" +
                                "Кыргыз тилинде Ж. Шүкүров, Б. Орузбаева, С. Кудайбергеновдор атайын илим-изилдөө иштерин жүргүзүшүп, монографиялар жарыялашкан. Айрыкча академик Б. Ө. Орузбаева кыргыз тилиндеги сөз жасоо проблемаларын өтө терең изилдеп, анын теориялык маселелерин, кыргыз тилиндеги сөздөрдүн жасалыш жолдорун ачып көрсөткөн.\n" +
                                "Сөз жасоо чынында эле лексикология менен морфологиянын экөөнө тең жакын. Анын лексикологияга жакындыгы тилдеги лексикалык байлыкты иликтейт. Сөздөрдүн кантип жасалып, кайдан келип каларын, лексиканын толукталуу мыйзамдарын ачып көрсөтөт. Ал эми морфологияга жакындыгы создөрдүн жасалышында алардын тутумдук түзүлүшүндөгү өзгөрүүлөрдү көрсөткөндүгүндө жатат. Сөздүн морфологиялык жол менен жасалышында да, синтаксистик жол менен жасалышында да анын тутумдук түзүлүшү иликтенбей калбайт. Ошентип, сөз жасоо тил илиминин өз алдынча бөлүмү болсо деле, морфологиянын сөздүн тутуму деген бөлүмү менен ажырагыс биримдикте каралат. Анткени, ар кандай сөздүн жасалышында грамматикалык каражат катары эсептелген курандылар да, бири-бири менен биригип бир сөз болгон уңгулар да сөздүн тутумундагы мүчөлөр (морфемалар) болуп саналат.\n" +
                                "Жандуу көрүнүш болуп эсептелген тилдин сөздүк корунда өзгөрүүлөр болуп, өнүгүү процесси жүрүп турат. Себеби, турмуш бир ордунда, бир калыпта болбойт. Адамзат ар качан алдыга, жакшы жашоого, дүйнөнү дагы да терең таанып- билүүгө умтула берет. Демек жаратылыш сырларын улам жаңыдан тереңдете өздөштүрүүлөр, табияттын таанып-билине элек жактары адам акылына туруштук бере албай тааныла, билине берет. Ал эми бул процесстер ар бир жаңы ачылыштардын, жаңыдан таанылып-билинген жаратылыш сырларынын тилибиздеги жаңыча аталыштары менен коштолуп жүрүп олтурат. Башкача айтканда, лексика толукталат. Албетте, лексика мамиле-катнашта болгон тилдерден даяр сөздөрдү кабыл алуу менен да толукталат. Бирок, мындай процесске карганда тилдин өзүнүн ички ресурстары менен толукталуусу бир топ арбын жана мол болот. Тилдин өзүнүн ички табиятына ылайык жаңы сөздөр жаралат. Куранды мүчөлөр ишке кирет, эки же андан көп сөздөр бир маани жаратуу үчүн биригишет. Ошеңтип, морфологиялык процесс жүрөт.\n" +
                                "Демек, тил илиминде сөз жасоо эки мааниде колдонулат: \n" +
                                "✔️ тилдеги атайы каражаттар аркылуу жаңы сөздөрдүн\n" +
                                "жасалышынын белгилүү мыйзам тартиби, эрежелери, жолдору; " +
                                "\n" +
                                "✔️ жаңы сөздөрдүн пайда болушу тууралуу илим.\n" +
                                "\n2. Кыргыз тилинде жасалаган сөздөр бир топ арбын. Алардын ар кандай жолдор менен жасалгандыгына, сөздөрдүн жасалыш ыгындагы айырмачылыктарга карата кыргыз тилинде сөз жасоонун эки жолу болот: сөз жасоонун морфологиялык жолу жана соз жасоонун синтаксистик жолу. Тил илиминде айтылып жүргөн сөз жасоонун лексика-семантикалык жолу лексикалык маанилер алкагында каралып, лексикологиянын объектисине жатат.\n\n" +
                                "\n\t\t\t\tСөз жасоонун морфологиялык жолу\n\n" +
                                "Негизге куранды мүчөлөрдун жалганышы аркылуу сөздөрдүн жасалыш ыгы сөз жасоонун морфологиялык жолу деп аталат. Мисалы: саанчы, илимпоз, энелик, түймө, тоют, тончон, ырда-, сана-, байы-, көбөй-, көнүк-, тамчыла-, тарсылда- , чыркыра- ж.б. сөздөр тиешелүү куранды мүчөлөрдүн жардамы менен б.а. морфологиялык ык менен жасалды.\n" +
                                "Сөз жасоонун морфологиялык жолу менен жасалган туунду сөздөр кыргыз тилинде абдан көп. Морфологиялык жол менен сөз жасай турган курандылар да мол. Аларга биз ар бир сөз түркүмдөрүн өтүүдө кеңири токтолобуз.\n" +
                                "\n\t\t\t\tСөз жасоонун синтаксистик жолу\n\n" +
                                "Эки же андан көп сөздөрдүн биригиши аркылуу жаңы сөздөрдүн жасалыш ыгы сөз жасоонун синтаксистик жолу деп аталат. Мисалы: агайын, кайната, бүгүн, айбалта, кумшекер, ашказан, үй-жай, ата-бала, кыз-кыркын, курал-жарак, баш бак, кол кой, көз сал, Сагыналы, Мукамбеткалый, Сатыбалды, Ак- Кыя, Онбиржылга, Чатыр-Көл ж.б. сөздөр эки (үч) сөздүн биригип бир маани бериши аркылуу жасалган, башкача айтканда, сөз жасоонун синтаксистик жолу менен жасалган. Кыргыз тилинде мындай ык менен жасалган сөздөр өтө көп. Синтаксистик жол менен жасалган сөздөр - татаал сөздөр. Ошондуктан, төмөндө татаал сөздөрдүн түрдүү касиеттерине өзүнчө токтолобуз.\n" +
                                "\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tТатаал сөздөр\n\n" +
                                "Татаал сөздөр жөнөкөй сөздөрдөн тутумдук түзүлүшү менен айырмаланат. Бирок, булар деле тутумунда эки же андан көп сөз болгонуна карабай лексикалык бир гана маанини билдирет. Демек, татаал сөздөр сүйлөмдө сүйлөмдүн бир эле мүчөсүнүн милдетин аткарат.\n" +
                                "Түзүлүшү боюнча кыргыз тилиндеги татаал сөздөрдүн үч түрү бар . Алар: кош сөздөр, кошмок сөздөр жана кыскартылган сөздөр.\n\n" +
                                "\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tКош сөздөр\n\n" +
                                "Маанилик жактан жупташып келип бир гана лексикалык мааниге ээ болгон татаал сөздөр кош сөздөр деп аталат. Мисалы: күч-кубат, бала-чака, алдым-жуттум, алай-дүлөй, чымын-чиркей ж.б.\n" +
                                "Кош сөздөр түгөйлөрунүн (компоненттеринин) берген маанилерине жараша өз ара топторго бөлүнөт.\n" +
                                "\n1. Түгөйлөрүнүн бардыгы өз алдынча лексикалык мааниге ээ болуп турган кош сөздөр: ата-эне, жер-суу, короо-короо, таңгак-таңгак, өйдө-төмөн, кайгы-капа, жан-жаныбар, соода- сатык, кой-эчки ж.б. Кош сөздөрдүн бул тобун С. Давлетов андан ары дагы үчкө бөлгөн:\n" +
                                "\n✔️ Карама-каршы кош сөздөр. Булардын түгөйлөрү өз ара карама-каршы маанини билгизет: оң-терс, чоң-кичине, кары- жаш, улуу-кичүү, жакшы-жаман, асты-үстү, алды-арты, күн-түн, дос-душман ж.б.\n" +
                                "\n✔️ Маанилеш кош сөздөр. Булардын түгөйлөрү өз ара бирдей же бири-бирине эң эле жакын маанини билгизет: сак- саламат, аман-эсен, күч-кубат, жарды-жалчы, кедей-кембагал, алдуу-күчтүү, ачык-айкын ж.б.\n" +
                                "\n✔️ Түркүмдөш кош сөздөр. Булардын түгөйлөрүнүн мааниси антонимдик же синонимдик катышта болбойт, бир текке кирүүчү нерселерди билгизет: алма-өрук (экөө тең жемиш), идиш-аяк (экөө тең буюм), курт-кумурска, аяк-табак, чымын-чиркей, музоо-торпок, кой-козу, кулун-тай ж.б.\n" +
                                "\n2. Түгөйлөрүнүн бири өз алдынча лексикалык мааниге ээ боло албаган кош сөздөр: аке-жаке, айыл-апа, жорук-жосун, жаман-жуман, жыт-жыбыр, жоон-жолпу, будуң-чаң, оңой-олтоң, кең-кесири, кийит-кечек ж.б.\n" +
                                "\n3. Түгөйлөрүнүн бардыгы өз алдынча лексикалык мааниге ээ боло албаган кош сөздөр: оргу-баргы,уйгу-туйгу, үрүл-бүрүл, илең-салаң, кым-куут, бака-шака, быт-чыт ж.б.\n" +
                                "Кош сөздөрдү жалпы категориялык грамматикалык маанилерине карай да өзүнчө топторго бөлүштүрөбүз.\n" +
                                "✔️ Жалпылап топтоштуруу маанилерин билдирген кош сөздөр: бала-бакыра, эли-журт, агайын-тууган, жер-суу, чымын- чиркей, азык-түлүк, ыпыр-сыпыр ж.б.\n" +
                                "✔️ Болжолдоп чамалоо маанилерин билдирген кош сөздөр: беш-алты, бирин-серин, отуз-кырк, аз-маз, жарым-жарты ж.б.\n" +
                                "✔️ Чектөө, жиктөө маанилерин билдирген кош сөздөр: алды-арты, алыс-жакын, ак-кара, тарам-тарам, узун-узун, бетме- бет, жекеме-жеке, теңме-тең ж.б.\n" +
                                "✔️ Ойдун, процесстин кайталанышын, созулушун билдирген кош сөздөр: бара-бара, кайта-кайта, жыла-жыла, сылай-сылай, бырс-бырс, улам-улам, ыйлап-сыктап ж.б.\n" +
                                "✔️ Күчөтүү, сапатты арттыруу маанилерин билдирген кош сөздөр: чоң-чоң, узун-узун, көп-көп, түрмөк-түрмөк, машине- машине ж.б.\n" +
                                "Кош сөздөр татаал сөздөрдүн башка түрлөрүнөн жазылышы боюнча араларына дефис (-) коюлушу менен да айырмаланат. Булар жупташып бириккен татаал сөздөр. Дефис-бириктирүү маанисине ээ. Дефис аркылуу кош сөздөрдүн эки же андан көп тутумдары биригип турат. Ошондуктан кош сөздөрдүн бардыгы дефис коюлуп жазылат.\n" +
                                "Кошмок сөздөр\n" +
                                "Тутумдашкан эки же андан көп сөздүн (негиздин) ортосундагы синтаксистик байланыш мааниси солгундап же жоголуп, алар биригип лексикалык бир гана мааниге ээ болуп калат. Мына ушундай татаал сөздөр кошмок сөздөр деп аталат. Мисалы: айбалта, аткулак, балчелек, колжазма, ишбилги, аккөңүл, ачкүсөн, көккытан, көзайнек, демалыш, атбагар, орунбасар, Тилебалды, Салкын-Төр, Базар-Коргон ж.б.\n" +
                                "Кыргыз тилинде кошмок сөздөр өтө эле көп. Алардын уюшулуш, куралыш, түзүлүш өзгөчөлүктөрү да өтө ар түрдүү. Анткени, кошмок сөздөр дээрлик бардык сөз түркүмдөрүн камтып, бир тобу эки башка сөз түркүмүнө жата турган сөздөрдүн (негиздердин) биригишинен келип чыккан.\n" +
                                "Кошмок сөздөрдө экиден ашык лексикалык маанидеги сөздөр биригип, башка лексикалык маани жаратат да, башкача грамматикалык маанилердин куралышына негиз болуп кызмат кылат.\n" +
                                "Кыргыз тилинде кошмок сөздөрдүн жазылышы да бир беткей эмес. Бир тобу бириктирилип жазылса, башкалары бөлөк-бөлөк жазьлат. Чынында эле кулак сал, дит бак, кол кой, ала кел, таап ал деген өңдүү этиштерди, кара сур, кызыл ала, кара курөң, мала кызыл деген сыяктуу сын атоочторду, он беш, отуз сегиз, эки жуз элүү алты, эки жарым өңдүү сан атоочторду, кимдир бирөө, кайсы бир, эч качан, эч кандай сыяктуу ат атоочторду, ар дайым, ар убак, алда кайда, алда качан өңдүү тактоочторду, ойлоп табуучу, башкы командачы, пайдалуу кен, кенже лейтенант, маданий турмуш, Кыргыз улуттук университети, Бириккен улуттар уюму деген сыяктуу зат атоочторду бириктирип жазууга болбойт.\n" +
                                "Кыргыз тилинин жазуу эрежелеринин жаңы редакциясында кошмок сөздөрдүн көпчүлүгүн бириктирип жазуу сунуш кылынган. Мисалы: аткулак, аттиш, алакөөдөн, бакажалбырак, биртууган, бешилик, жетата, ишөргүү, көзайнек, колжазма, кызкуумай, күнкарама ж.б.\n\n" +
                                "\t\t\t\t\t\t\t\t\t\tКыскартылган сөздөр\n\n" +
                                "Сөздөрдүн кыскартылып биригишинен жасалган татаал сөздөр кыскартылган сөздөр деп аталат. Мисалы: шаарком, профсоюз, КР, БУУ, КМУ, КМУУ, БГУ ж.б. Мындай сөздөр кыргыз тилинде анча көп эмес.\n" +
                                "Сөздөр эки жол менен кыскартылып, бириктирилип, татаал сөздөр уюшулат.\n" +
                                "✔️ Сөздөрдүн тутумунан кыскартып бириктирүү аркылуу уюшулган кыскартылган сөздөр. Мисалы: облсот (областтык сот), райборбор (райондук борбор), филфак (филология факультети), педфак (педагогика факультети) ж.б.\n" +
                                "✔️ Баш тамгаларды бириктирүү аркылуу уюшулган кыскартылган сөздөр. Мисалы: БУУ (Бириккен улуттар уюму), КР (Кыргыз Республикасы), ИИМ (Ички иштер министрлиги) ж.б.");
                break;
            case 4:
                superOpenLeksikogrophyActivity("Тема: Зат атооч",
                        "\nМаселелер:\n" +
                                "1. Зат атооч сөз түркүмү жөнүндө жалпы түшүнүк.\n" +
                                "2. Зат атоочтун грамматикалык категориялары.\n" +
                                "3. Зат атоочтун түзүлүшү жана жасалышы.\n" +
                                "\n1. Зат атооч заттардын, кубулуштардын, окуялардын, түшүнүктөрдүн аттарын билгизет. Зат атоочтун морфологиялык белгилери төмөнкүлөр: жөндөмө менен жөндөлөт, жекелик жана көптүк санда айтылат, таандык мүчөлөр менен өзгөрөт, жак мүчөлөрүн кабыл алат.\n" +
                                "Зат атоочтор синтаксистик жактан төмөнкү милдеттерди аткарат:\n" +
                                "✔️ Ээлик: Адам бакытты бекер жатып таппайт, эмгек менен табат. Жигитке жетимиш өнөр аздык кылат.\n" +
                                "✔️ Баяндоочтук: Бирдин иши - чөл, миңдин иши-көл.\n" +
                                "✔️ Толуктоочтук: Ачууну акыл жеңет.\n" +
                                "✔️ Аныктоочтук: Адамдын акылы бардык нерсени\n" +
                                "жаратат.\n" +
                                "✔️ Бышыктоочтук: Айылда эң сонун жаңылыктар болуп\n" +
                                "жатат.\n" +
                                "Зат жөнүндө билгизип, жөндөмө, сан, таандык, бир\n" +
                                "кыйласы жак менен өзгөргөн, сүйлөмдүн ар кайсы мүчөсү боло алган, ким? эмне? деген суроолорго жооп берген сөз түркүмү зат атооч деп аталат.\n" +
                                "Зат атоочтор морфологиялык түзүлүшүнө карай тубаса жана туунду, заттарды атоо касиети боюнча энчилүү жана жалпы, адамзаттык жана адамзаттык эмес, табияты боюнча конкреттүү жана абстрактуу, түзүлүшүнө карай жөнөкөй жана татаал болуп бөлүнөт.\n" +
                                "Андан ары морфемаларга ажыратууга мүмкүн болбогон зат атооч сөздөр тубаса зат атоочтор деп аталат. Мисалы: ата, бала, кол, баш, тегирмен, Акыл, Сайкал, Нарын ж.б.\n" +
                                "Туунду уңгу же бириккен уңгулардан турган зат атоочтор туунду зат атооч деп аталат. Булар курандылар аркылуу же уңгу бирикмелери менен жасалган сөздөр болуп эсептелет. Мисалы: окуучу, жылкычы, китепкана, кийим, таята, кайнага, Ат-Башы ж.б.\n" +
                                "\nЖалпы аттар бир тектеги заттарды, жан-жаныбарларды ж.б. жалпы жонунан бириктире атайт. Мисалы: гүл, дарак, токой, адам, түн, күлкү, тартип, карышкыр ж.б.\n" +
                                "\nЭнчилүү аттар кандайдыр бир тектеги заттардын, жан- жаныбарлардын ж.б. ичинен бирөөн бөлүп көрсөтөт, б.а. ал ат ошол затка энчиленип коюлат. Мисалы: Жамийла, Ажар, Данияр, Акбара, Кумайык, Бишкек, Түркия, «Манас» эпосу «Даңк» ордени, Марс ж.б.\n" +
                                "Энчилүү аттар жекелик санда гана айтылат, жалпы аттар болсо жекелик жана көптүк санда айтыла берет. Кыргыз тилиндеги энчилүү аттар жалпы аттардан айырмаланып, дайыма баш тамга менен жазылат.\n" +
                                "\nАдамзаттык зат атоочтор дайыма адамды билдирет, же адамга тиешелүү болот да, ким? деген суроого жооп берет. Мисалы: бала, байке, эже, карындаш, жеңе, студент, инженер, комузчу, Алтын, Майрам, Карабагышова ж.б.\n" +
                                "Адамзаттык эмес зат атоочтор адамдан башка бардык зат атоочтор болуп, эмне? деген суроого жооп берет. Мисалы: аюу, коён, бүркүт, кызгалдак, булут, суу, бакыт, ой, санаа, Тайтору, Ташчайнар, Буудайык ж.б.\n" +
                                "\nКонкреттүү зат атоочтор көз менен көрүп, кол менен кармап, элестерин, образдарын көз алдыга келтирүүгө мүмкүн болгон заттарды билгизет. Мисалы: алма, жүзүм, таш, кум, чагылган, жалбырак, жип ж.б.\n" +
                                "\nАбстракттуу зат атоочтор көз менен ачык-айкын көрүүгө, кол менен кармап билүүгө мүмкүн болбогон, бирок ой жүгүртүү аркылуу аныктала турган заттык түшүнүктөрдү атайт. Мисалы: акыл, билим, ой, турмуш, мамиле, таасир, адамгерчилик, жакшылык, жамандык, жаңылык ж.б.\n" +
                                "Зат атоочтор морфологиялык жана синтаксистик жолдор менен жасалат.\n" +
                                "Ошентип, заттардын, буюмдардын, жан-жаныбарлардын, абстракттуу түшүнүктөрдүн, ар кандай көрүнүштөрдүн, кубулуштардын аттарын билдирип ким? жана эмне? деген суроолорго жооп берген сөздөр зат атоочтор деп аталат." +
                                "\n\n2. Зат атооч - атооч сөз түркүмдөрүнүн ичинен эң негизгиси. Кыргыз лексикасынын басымдуу бөлүгүн зат атоочтор түзөт. Зат атоочтор өзүнө гана тиешелүү сөз өзгөртүү системасына ээ, б.а. анын зат атоочко гана тиешелүү болгон жөндөмө, таандык категориялары бар. Мындан тышкары сан жана жак категориялары менен да өзгөрөт. Бул категориялардын ар бирине токтолсок.\n" +
                                "\n\nЖөндөмө категориясы атооч сөздөрдү бири-бири менен же башка сөздөр менен байланыштырып, айтайын деген ойду түшүндүрүү үчүн сүйлөмдүн туура уюшулушун шарттап турат. Демек, зат атоочко гана эмес, заттык мааниде колдонулган учурда сын атоочко, сан атоочко, ат атоочко, кыймыл атоочко, атоочтуктарга да тиешелүү категория болуп эсептелет.\n" +
                                "Кыргыз тилинде жөндөмө категориясын түзүп турган алты жөндөмө бар. Алар:", R.drawable.morfology_photo_2, "Бир сөздүн ар түрдүү жөндөмөлөр менен өзгөрүшү жөндөлүш деп аталат. Анын жөнөкөй жана татаал жөндөлүш деген эки түрү бар.\n" +
                                "Таандык мүчөлөр уланбай турган сөздөрдүн жөндөмөлөр менен өзгөрүшү жөнөкөй жөндөлүш деп аталат. Жөндөлгөн сөздүн уңгусу өзгөрүүгө учурабайт. Уңгудагы үндүү, үнсүздөргө жараша мүчөдөгү үндүү, үнсүз тыбыштар өзгөрүүгө учурайт.", R.drawable.morfology_photo_3, "(Кыргыз тилиндеги аягы нк, ск, фт, кт, нг, нд, мн тыбыштары менен бүткөн сөздөрдүн жөндөлүшү алардын аягына бир үндүү тыбыштын кошулушу менен жазылышы болбосо, жөнөкөй жөндөлүштөн айырмасы жок.)\n" +
                                "Аягы таандык мүчөлөр менен аяктаган зат атоочтордун жөндөлүшү татаал жөндөлүш деп аталат.", R.drawable.morfologu_photo_4, "Кыргыз тилиндеги жөндөмөлөр берген маанилерине карай грамматикалык жөндөмөлөр жана мейкиндик жөндөмөлөр деген эки топко бөлүнөт.\n" +
                                "\nМейкиндик жөндөмөлөрдө турган сөздөр сүйлөмдөрдү кыймыл-аракеттин багытын, турган ордун же башталган жерин билдирет. Мисалы:\n" +
                                "✔️ барыш жөндөмөсү кыймыл-аракеттин багытын, барып тиер жерин билдирет;\n" +
                                "✔️ жатыш жөндөмөсү кыймыл-аракеттин аткарылыш ордун, мезгилин билдирет;\n" +
                                "✔️ чыгыш жөндөмөсү кыймыл-аракеттин башталыш, пайда болуш ордун, мезгилин билдирет.\n" +
                                "\nГрамматикалык жөндөмөлөрдүн болсо, мейкиндикке анча тиешеси жок. Булар ар кандай грамматикалык маанилерди билдирет Мисалы:\n" +
                                "✔️ атооч жөндөмөсү заттарды жөн гана атайт;\n" +
                                "✔️ илик жөндөмөсү заттардын таандык болуп айтылышын шарттайт;\n" +
                                "✔️ табыш жөндөмөсү заттарды объект кылып көрсөтөт.\n" +
                                "\n\t\t\t\t\t\t\t\t\t\t\t\tСан категориясы\n" +
                                "\nЗаттардын көптүгүн же жекелигин туюндуруу зарылдыгынан келип чыккан категория зат атоочтун сан категориясы деп аталат.\n" +
                                "Зат атооч атооч сөздөр жекелик жана көптүк санда айтылат. Жекелик сан заттын жалгыз экендигин билгизет да, атайын мүчөлөр аркылуу жасалбайт. Ал бир, жалгыз деген сөздөрдүн зат атоочко айкашы аркылуу туюндурулат: бир китеп, жалгыз уй ж.б.\n" +
                                "Кыргыз тилинде жекелик жана көптүк санды бири-биринен айырмалап турган грамматикалык каражат көптүктүн –лар мүчөсү болуп саналат. Бул мүчө уңгудагы үндүү, үнсүз тыбыштарга карата өзгөрүп 12 вариантта колдонулат: -лар, -лер, -лор,-лөр, -дар,-дер,- дор,-дөр, -тар,-тер,-тор, -төр. Мисалы: үй-үйлөр, бала-балдар, китеп-китептер, шаар-шаарлар, тоо-тоолор ж.б.\n" +
                                "Көптүк маани төмөнкү жолдор менен да берилет:\n" +
                                "✔️ Жалпылоо маанисиндеги сөздөр: эл, мал, калк ж.б.\n" +
                                "✔️ Сан атоочтордун жардамы менен: жүз китеп, отуз киши,\n" +
                                "миң баш, жыйырма оюнчук ж.б.\n" +
                                "✔️ Кош сөздөр аркылуу: короо-короо кой, үйүр-үйүр\n" +
                                "жылкы, чай-пай алуу ж.б.\n" +
                                "✔️ Көп, далай, толгон, бир топ, бир нече деген сөздөр\n" +
                                "аркылуу: Көп киши келди. Далай жыл өттү. Бир топ иш бүттү. Бир нече убакыт керек.\n" +
                                "\nЖак категориясы. Уланган сөзүнө баяндоочтук милдетти аткартып, ээнин кайсы жакта, кайсы санда турушуна ылайык баяндоочту ошол жакта, ошол санда өзгөрткөн мүчөлөр жак мүчө деп аталат. Сөздүн жак мүчөлөр менен өзгөрүшү жакталыш деп аталат.\n" +
                                "Пикир алышууда сөздү айтып жаткан киши (1-жак) менен сөздү тыңшап жаткан киши (2-жак) аракетте болот. Пикир алышууга катышпагандар (3-жак) да болот. 1-2-жак дайыма адамзаттык заттар болот. Анткени пикир алышканда сүйлөп жаткандар адамдар гана болушат. Ал эми 3-жак адамзаттык да, адамзаттык эмес да заттар боло берет. Ошондуктан кыргыз тилинде адамзатты билдирип, адамзатка тиешелүү болгон зат атоочтор же затташкан сөздөр жак боюнча өзгөрөт. \nМисалы:\n" +
                                "Мен студентмин \t\t\t\t\t\t\t\tБиз студентпиз\n" +
                                "Сен студентсиң \t\t\t\t\t\t\t\tСилер студентсиңер\n" +
                                "Сиз студентсиз \t\t\t\t\t\t\t\tСиздер студентсиздер\n" +
                                "Ал студент\t\t\t\t\t\t\t\tАлар студент (студенттер)\n" +
                                "\n\t\t\t\t\t\t\t\t\t\t\tТаандык категориясы.\n" +
                                "\nКыргыз тилинде зат атоочтор жекелик санда да, көптүк санда да кимдир бирөөгө же кандайдыр бир затка таандык болуп айтылыш мүмкүнчүлүгүнө ээ. Мисалы, кызың деген сөздөгү-ың мүчөсү ошол сөздү сүйлөп жаткан жакка (1-жакка) таандык экенин билдирсе, кызың деген сөздөгү -ың мүчөсү ошол сөздү угуп жаткан жакка (2-жакка) таандык экенин билдирет. Ал эми кызы деген -ы мүчөсү үчүнчү жакка - сөзгө аралашпаган жакка таандык кылып гурат. Мектептики деген сөздөгү -тики(-ныкы) мүчөсү кайсы бир затты, нерсени (мектепке таандык кьлып көрсөтүп турат.\n" +
                                "Ошентип, заттардын кимдир бирөөгө же кандайдыр бир затка таандык болуп айтылыш маанилеринин жыйындысы таандык категориясы деп аталат.\n" +
                                "Кыргыз тилинде зат атоочтун таандык маанилери эки жол менен гуюндурулат:\n" +
                                "✔️ Морфологиялык жол (таандык мүчөлөр аркылуу).\n" +
                                "✔️ Синтаксистик жол (таандык мүчөсү жок туруп эле). Морфологиялык жолдо сөзгө таандык мүчөлөрдүн\n" +
                                "жалганышы аркылуу таандык маанилер уюшулат. Кыргыз тилиндеги таандык мүчөлөр уюштурган маанилерине карай эки топко бөлүнөт: жакчыл таандык мүчөлөр, жалпы таандык мүчөлөр.\n" +
                                "\nЖакчыл таандык мүчөлөр зат атооч сөздөргө жалганып, аларды тиешелүү бир жакка таандык кылып көрсөтөт. Ар бир жактын өзүнүн жекелик жана көптүк сандагы таандык мүчөлөрү бар.\n" +
                                "\nБиринчи жак - сүйлөп жаткан тараптын өзү. Аны мен (көптүк санда биз) деген жактама ат атооч аркылуу туюндурабыз. Мына ошол биринчи жакка таандык айтуу үчүн менин ...-ым (мисалы: менин балам), биздин ...-ыбыз\n" +
                                "мисалы: биздин балабыз) деп айтабыз. Биринчи жактын таандык мүчөлөрү – ым ( м), -ыбыз (-быз) болуп эсептелет.\n" +
                                "Экинчи жак - сүйлөп жаткан кишинин сөзү багытталып, аны угуп, сөзгө аралашып турган тарап. Жөнөкөй түрүндө сен (көптүк санда - силер) жана сьлык түрүндө сиз (көптүк санда - сиздер) деген жактама ат атоочтор аркылуу берилет. Мына ошол экинчи жакка таандык айтуу үчүн сенин ...-ың (мисалы: сенин балаң, силердин ...-ыңар (мисалы: силердин балаңар), сьлык түрүндө сиздин ...-ңыз (мисалы: сиздин балаңыз), сиздердин ...-ыңыздар (мисалы: сиздердин балаңыздар) деп айтабыз. Экинчи жактын таандык мүчөлөрү болуп -ың (-ң), - ыңыз (ңыз), -ыңар (-ңар), -ыңыздар (-ңыздар) эсептелет.\n" +
                                "Үчүнчү жак - сөз же ой багытталып, бирок сөзгө катышпаган тарап. Үчүнчү жак ал (көптүк санда - алар) деген жактама ат атооч аркылуу берилет. Мына ошол үчүнчү жакка таандык айтуу үчүн анын ...-ы(-сы) (мисалы: анын кызы, баласы), алардын ...-ы(-сы) (мисалы: алардын кызы, баласы) деп айтабыз. Үчүнчү жактын таандык мүчөсү (жекелик сандагыдай) -ы (-сы) болуп эсептелет.\n", R.drawable.morfology_photo_5, "Аягы үнсүз тыбыштар менен аяктаган зат атоочтордун жакчыл таандык мүчөлөр менен өзгөрүшү төмөндөгүдөй болот.", R.drawable.morfology_photo_6, "Аягы үндүү тыбыштар менен аяктаган зат атоочтордун жакчыл таандык мүчөлөр менен өзгөрүшү төмөндөгүдөй болот.", R.drawable.morfology_photo_7, "Жалпы таандык мүчө бирөө эле: -ныкы. Ал зат атоочторго жалганьп кандайдыр башка затты же кимдир-бирөөнү ошол затка таандык кылып көрсөтөт. Жалпы таандык мүчө жак менен санды көрсөтпөйт. Ошондуктан анын мааниси абстракттуу болот. Сүйлөмдөр тизмегинде (контекстте) конкреттүүлүккө ээ болот. Жалпы таандык мүчө уңгудагы тыбыштарга карай бир нече түрдө өзгөрүп келе берет: мектептики, шаардыкы, уйдуку, Жолондуку, Аалыныкы, Өмүрбектики ж.б.\n" +
                                "Жалпы таандык мүчө жакчыл таандык мүчөдөн кийин да жалгана берет.", R.drawable.morfology_photo_8);
                break;
            case 5:
                openSynAtooch("Тема: Сын атооч",
                        "\nМаселелер:\n" +
                                "1. Сын атооч сөз түркүмү жөнүндө жалпы түшүнүк.\n" +
                                "2. Сапаттык жана катыштык сын атоочтор.\n" +
                                "3. Сын атоочтун даражалары.\n" +
                                "4. Сын атоочтун түзүлүшү жана жасалышы." +
                                "\n\n1. Зат, буюм-тайым, нерсе, кубулуш, көрүнүш жана башкалардын сын-сыпатын, өңү -түсүн, даамын, тулкусун, кебетесин, көлөмүн, ченемин же башка белгилерин көрсөтүп, кандай? кайсы? деген суроолорго жооп берген сөздөрдү сын атоочтор дейбиз. Мисалы: Бийик-бийик тоолорго чыктым. (Бийик-бийик - сын атооч, кандай? деген суроо берилет, тоолорго деген зат атоочтун көлөмүн, ченемин билгизди.)\n" +
                                "Жакшы кыз –жакадагы кундуз,\n" +
                                "Жакшы уул – көктөгү жылдыз.\n" +
                                "Жылуу сөз жыланды ийининен чыгарат. Жылуу сөз жылытат, суук сөз муздатат.\n" +
                                "Жакшы, жылуу, суук - сын атооч, кыз, жигит, сөз деген зат атоочтордон мурда келип, заттын сын-сыпатын билгизип, кандай? деген суроого жооп берди. У шундан улам сөз айкашындагы зат атоочко карата сын атоочтун алган ордун төмөнкүдөй таблица менен көрсөтүүгө болот:", R.drawable.morfology_synat_1, "Сын атооч дайыма зат атоочтон мурда келет, жеке, өзүнчө турса да, кандайдыр бир затка тиешелүү болгон белгини туюндурат. Белгини билгизүү - сын атоочтун касиети. Сөзүбүз кургак болбос үчүн төмөнкү макал - ылакаптар менен далилдейли: \n\n" +
                                "\t\t\t\t\t\t\t\t\tАдал эмгек элге жеткирет. \n" +
                                "\t\t\t\t\t\t\t\t\tАжаан ит таяктан коркот. \n" +
                                "\t\t\t\t\t\t\t\t\tАк сөз жолго чыгарат,\n" +
                                "\t\t\t\t\t\t\t\t\tКара сөз баткакка жыгат.\n\n" +
                                "Ажаан, ак, адал, кара - сын атоочтор, эмгек, ит, сөз деген зат атоочтордун ар кандай белгилерин туюндурду.\n" +
                                "Сын атоочту башка сөз түркүмдөгү сөздөрдөн айырмалап турган төмөнкүдөй мүнөздүү белгилери бар:\n" +
                                "✔️Сын атооч сөздөр заттагы, буюмдагы, нерседеги, ар түрдүү түшүнүктөгү сапаттын, касиеттин, белгинин аз же көп, күчтүү же күчсүз, чоң же кичине экенин билдирген даража категориясы боюнча өзгөрөт: кызыл, кызылыраак, кыпкызыл, кызгылтым, кызгылт, өтө кызыл, эң кызыл, аябай кызыл; ак, аппак, агыш, агылжын, аябай ак, өтө ак, чымкый ак ж.б. Сын атоочтун өзүнө гана тиешелүү куранды мүчөлөрү бар. \n" +
                                "\nМисалы:\n" +
                                "\t\t\t\t\t\t-луу: билимдүү, сырдуу, айлуу;\n" +
                                "\t\t\t\t\t\t-сыз: адилетсиз, көлсүз, малсыз;\n" +
                                "\t\t\t\t\t\t-дай: тоодой, күндөй, оттой, суудай;\n" +
                                "\t\t\t\t\t\t-гыч: билгич, сезгич, тапкыч ж.б." +
                                "\n\n✔️ Сын атооч морфологиялык табияты жагынан зат атооч\n" +
                                "менен атоочтуктардан айырмаланып, нагыз сын маанисинде турганда жөндөмө, таандык категориялары менен өзгөрбөйт, көптүк - лар мүчөсүн да кабыл албайт. Бул өзгөчөлүктү төмөнкүдөй таблица менен көрсөтсөк болот:", R.drawable.morfology_synat_2, "Көрүнүп тургандай, жөндөмө парадигмасында кызыл алма айкашынын «кызыл» түгөйү өзгөрүүсүз, «алма» түгөйү гана жөндөмө мүчөлөрү менен өзгөрүүгө кириптер болду.\n" +
                                "Сын атоочтун жөндөлүшү затташкан учурда гана ишке ашат.\n" +
                                "\nМисалы:\n" +
                                "\t\t\t\t\t\tА. кызыл, акылдуу, сулуу, улуу, кичүү.\n" +
                                "\t\t\t\t\t\tИ. кызылдын, акылдуунун, сулуунун, улуунун, кичүүнүн.\n" +
                                "\t\t\t\t\t\tБ. кызылга, акылдууга, сулууга, улууга, кичүүгө.\n" +
                                "\t\t\t\t\t\tТ. кызылды, акылдууну, сулууну, улууну, кичүүнү. \n" +
                                "\t\t\t\t\t\tЖ. кызылда, акылдууда, сулууда, улууда, кичүүдө. \n" +
                                "\t\t\t\t\t\tЧ. кызылдан,акылдуудан, сулуудан, улуудан," +
                                "кичүүдөн." +
                                "\n\n✔️ Сын атоочтор -лар мүчөсү менен өзгөрбөйт. Затташкан\n" +
                                "сын атоочтор гана кабыл алат. Мисалы: Кызылдар актар менен болгон согушта жеңишке жетишти. Кызыл, ак - сын атоочтор, -лар мүчөсүн кабыл алып, кимдер? деген суроого жооп берип, затташкан сын атоочко өттү.\n" +
                                "Сын атоочтор зат атоочтор менен айкаша келип, сүйлөмдө аныктоочтук милдетти аткарат. Аныктооч менен форма жагынан өзгөрүүсүз туруп, ыкташуу жолу аркылуу байланышат.\n" +
                                "\n2. Сапаттык жана катыштык сын.\n" +
                                "Сын атоочтор даража категориясы менен өзгөрүү же өзгөрбөө касиети жагынан бир өнчөй эмес. Бул жагынан алар эки чон топко бөлүнөт:\n" +
                                "1. Сапаттык сын атооч.\n" +
                                "2. Катыштык сын атооч.\n" +
                                "\nСапаттык сын атооч. Заттардын табияты менен ажырагыс\n" +
                                "түрдө байланышкан, алардын керт башына тиешелүү болгон белгилерди билгизет. Мындай белгилер бир топко кирүүчү заттарда ар түрдүү даражада боло берет. Ошондуктан булар даража категориясы боюнча өзгөрөт. Мисалы: Асмандагы ак булуттар эмнегедир көзгө сүйкүм көрүнөт.\n" +
                                "Ак - түстүн кадыресе жайынча нормадагыдай экендигин билгизет. Эгерде анын ордуна аппак деп колдонсок, анда булуттун ак экендиги күчөтүлгөн түрдө туюндурулат. Мына ушундай өзгөчөлүктөр даража категориясына мүнөздүү айрым көрүнүштөрдө орун алат.\n\n" +
                                "\nСапаттык сын атоочтордун көпчүлүгү эч кандай мүчөлөрдүн жардамысыз эле заттардын ар түрдүү белгилерин билгизет. Мисалы: Биздин бөлмө чон, жарык жана таза.\n" +
                                "Ал эми кээ бир сапаттык сын атоочтор сөз жасоочу мүчөлөрдүн жардамы менен да жасалат. Мисалы: кадырлуу, акылдуу, эстүү сыяктуу сын атоочтор. Булар, биринчиден, заттардын керт башына тиешелүү болгон белгилерди билгизет, экинчиден, даража категориясы боюнча өзгөрөт: өтө кадырлуу - кадырлуураак, абдан эстүү – эстүүрөөк. Бул өңдүү сөздөр негизги сөз жасоочу мүчөлөр аркылуу жасалып, сапаттык сын атоочко өтүшү ыктымал.\n" +
                                "Сапаттык сын атоочтор төмөндөгүдөй маанилерди билгизет:\n" +
                                "✔️ Өң-түс жагынан өзгөчөлүктөрдү: ак, кара, кызыл, кочкул, сары чийкил, мала кызыл, кара көк ж.б. Мисалы:\n" +
                                "Кара көк тарткан асман күн жаарынан кабар берди.\n" +
                                "✔️ Көлөм, өлчөм, салмак сыяктуу белгилерди: чоң, кичине, оор, жеңил, бийик, узун, кыска, кен, тар, кууш, жука, калың, терең, тайыз, бүкүр, жантык, ийри, кыйшык, кыңыр, чалыр, жалпак, тоголок ж.б. Мисалы:\n" +
                                "Дөөлөт тоголок болот, мээнет жалпак болот. Тоголок кызыл даны бар,\n" +
                                "Токчулук буудай жана бар.\n" +
                                "Бийик тоого чыксаң көзүң ачылат,\n" +
                                "Жакшы менен сүйлөшсөң көңүлүң ачылат. Бийик тоону жанынан көр, башына чыкпа.\n" +
                                "✔️ Даам-татым, жыт сыяктуу белгилерди: таттуу, ачуу, кычкыл, кыйгыл, кермек, сасык, жыттуу ж.б. Мисалы:\n" +
                                "Мээнетиң катуу болсо, татканың таттуу болор.\n" +
                                "✔️ Кулк-мүнөз, адеп-ахлакка тиешелүү белгилерди: коркок, өткүр, жоош, момун, чатак, тентек, шок ж.б. Мисалы:\n" +
                                "Билимдүүнүн сөзү өткүр, Мергенчинин көзү өткүр.\n" +
                                "Жакшынын бир аты бар -жоош, бир аты -момун.\n" +
                                "Жамандын бир аты бар-залим, бир аты-зулум.\n" +
                                "✔️ Ысык-суукка байланыштуу белгилерди: ысык, суук,\n" +
                                "мээлүүн, муздак, жылуу, ыкчам ж.б. Мисалы: Түн ортосу, аба салкын, ай жарык.\n\n" +
                                "Сапаттык сын атоочтордун көпчүлүгү өз ара антонимдик катышты түзө алат: ысык - суук, арык - семиз, жоон - ичке, узун - кыска, ачык —-жабык ж.б. \n" +
                                "\nМисалы:\n" +
                                "\t\t\t\t\t\tГүлдөн аары таттуу бал жыйнаса,\n" +
                                "\t\t\t\t\t\tЖылан ачуу уу жыйнайт.\n" +
                                "\t\t\t\t\t\tЭски дос эстен кетпейт,\n" +
                                "\t\t\t\t\t\tЖаңы дос баркка жетпейт.\n\n" +
                                "Мында таттуу - ачуу, эски - жаңы - контексттик антонимдер.\n" +
                                "Мына ушул өңдүү белгилер сапаттык сын атоочту\n" +
                                "айырмалоого мүмкүндүк берет. Анткени катыштык сын атоочтор мындай белгилерге ээ боло албайт.\n" +
                                "\nКатыштык сын. Булар бир затты башка бир заттын өзүнө, ордуна, мезгилине, мамилесине, мүнөзүнө, алака-катышына ылайык аныктайт. Катыштык сын уңгуга ар кандай сөз жасоочу мүчөлөрдүн жалганышы аркылуу ар башка түркүмдөгү сөздөрдөн жасалат. Демек, катыштык сындын мааниси уңгу менен ага жалганган мүчөнүн маанисинен келип чыгат. Мисалы:\n" +
                                "Малдуу адам - малдын мол болуш өзгөчөлүгүнө карай аныкталды.\n" +
                                "Жазгы жумуш - мезгилдик жактан аныкталды.\n" +
                                "Тоолуу аймак - географиялык жактан аныкталды.\n" +
                                "Катыштык сын атоочтор билгизген белгилер ар түрдүү затта\n" +
                                "ар түрдүү даражада болбойт. Ошондуктан мындай сын атоочтор даража категориясы менен өзгөрбөйт.\n" +
                                "Катыштык сын атоочтун маанилери да ар башка. Ошондуктан алардын төмөнкүдөй бир катар өзгөчөлүктөрүн белгилөөгө болот:\n" +
                                "✔️ Мезгилдик түшүнүктү белги катары көрсөтүүчү катыштык сын атоочтор. Алар мезгилди билгизүүчү сын атоочтон, тактоочтон жасалат: кышкы, түнкү, жайкы, жазгы (зат атоочтон жасалды); жазындагы, күзүндөгү, эртеңки, бүгүнкү (тактоочтон жасалды). Мисалы:\n" +
                                "Эртең мененки муздак сууга жуунуу пайдалуу.\n" +
                                "Бүгүнкү көргөн эртең жок.\n" +
                                "✔️Негиз аркылуу туюндурулган заттын бар же жок\n" +
                                "экендигин белги катары туюндуруучу катыштык сын атоочтор. \n" +
                                "\nМисалы:\n" +
                                "\t\t\t\t\t\t Балалуу үй -базар, баласыз үй –мазар.\n" +
                                "\t\t\t\t\t\t Балалуу үй - бактылуу үй.\n\n" +
                                "3.Сын атоочтун даражалары.\n" +
                                "Кыргыз тилинде сын атоочтун төмөнкүдөй даражалары бар:\n\n" +
                                "\t\t\t\t\t\t1. Жай даража.\n" +
                                "\t\t\t\t\t\t2. Салыштырма даража.\n" +
                                "\t\t\t\t\t\t3. Күчөтмө даража.\n" +
                                "\t\t\t\t\t\t4. Басаңдатма даража.\n\n" +
                                "Даража категориясынын мааниси айлана-чөйрөдөгү карама- каршы келип, толуп жаткан белгилердин заттарда ар түрдүү денгээлде боло тургандыгын байкап, аларды тилде туюндуруп, алсак, алманын биринин өнү кызыл, экинчисиники ага карганда кызылыраак, үчүнчүсүнүкү чымкый кызыл, кыпкызыл экендигин ажыратып көрсөтүүдө турат.\n" +
                                "\nЖай даража заттардын кадимки норма катары таанылган белгилерин билгизет да, атайын мүчөлөрдүн же сөздөрдүн жардамысыз уңгу же негиз түрүндөгү сапаттык сын атоочтор аркылуу туюндурулат.\n" +
                                "\nМисалы:\n" +
                                "\t\t\t\t\t\tТаянарың болбосо, таамай сөздөн пайда жок.\n" +
                                "\t\t\t\t\t\tТар жерден аш жегиче, кең жерден муш же.\n" +
                                "\t\t\t\t\t\tТартылбаган тил таттуу турмушту бузат. ж.б.\n" +
                                "\nКалган даражалар жай даражадан атайын мүчөлөрдүн же\n" +
                                "сөздөрдүн жардамы аркылуу жасалат.\n" +
                                "Мисалы: ак - жай даража; агыш - басаңдатма даража;\n" +
                                "агыраак - салыштырма даража; өтө ак, аппак, абдан ак – күчөтмө даража.\n" +
                                "Жай даражаны билмейин, калган даражаларды аңдап билүү мүмкүн эмес.\n" +
                                "\nБасаңдатма даража. Заттагы белги нормалдуу белгиге жете бербегендигин билдирет да, төмөнкү мүчөлөрдүн жардамы менен жасалат:\n" +
                                "\n\t\t\t\t\t\t-ыш: ак - агыш, көк – көгүш;\n" +
                                "\t\t\t\t\t\t-гыл: кир –киргил, сары - саргыл; -ылжын: көк – көгүлжүн;\n" +
                                "\t\t\t\t\t\t-ылтыр: көк – көгүлтүр;\n" +
                                "\t\t\t\t\t\t-гыч: сары – саргыч;\n" +
                                "\t\t\t\t\t\t-гыл: сары - саргылт, сур - сургулт;\n" +
                                "\t\t\t\t\t\t-гылтым: кызыл – кызгылтым ж.б.\n\n" +
                                "Салыштырма даража. Заттагы белги нормалдуу белгиге\n" +
                                "караганда айырмалуу экендигин билгизет да, эки зат өз ара белгилери боюнча салыштырылат. Ал заттардын бири атооч жөндөмөсүнүн, экинчиси чыгыш жөндөмөсүнүн формасында берилет. Сын атооч -ыраак мүчөсү уланган түрдө же ансыз эле колдонулат.\n" +
                                "Күчөтмө даража. Заттагы белги нормалдуу белгиден өтө эле айырмалуу экендигин көрсөтөт да, төмөнкүдөй жолдор менен жасалат:\n" +
                                "\n\n1. Эн, абдан, өтө, аябай деген бөлүкчөлөрдүн кошулуп айтылышы менен жасалат.\n" +
                                "\nМисалы:\n" +
                                "\t\t\t\t\t\tМугалимдик кесип - өтө татаал кесип. Өтө жаш өлүм өкүнтөт.\n" +
                                "\t\t\t\t\t\tЭң ачуу да тил, эң таттуу да тип.\n" +
                                "\t\t\t\t\t\tӨтө кызыл тез оңот.\n\n" +
                                "Өтө кызыл, өтө жаш, эң ачуу, эң таттуу - сын атооч, күчөтмө даража, аныктооч. Сүйлөмдө өтө кызыл деген сөз түпкү мааниси сын атооч болгону менен затташкан сын атооч болуп ээлик милдет аткарды.\n" +
                                "\n\n2.Сын атооч сөзгө анын башкы муунунан кыскартылып, п тыбышын кошуп жалгоо аркылуу. Бул типтеги бөлүкчөлөр сөз алды мүчө сыяктуу сын атооч менен бирге жазылат: кызыл – кыпкызыл; сары – сапсары; кара – капкара; узун - упузун ж.б\n" +
                                "\nМисалы:\n" +
                                "\t\t\t\t\t\tКырман сапсары данга толду.\n" +
                                "\t\t\t\t\t\tКүз келип, сапсары жалбырактар жерге түштү. Бир кучак аппак сакалы,\n" +
                                "\t\t\t\t\t\tАк кар кийген чапаны.\n" +
                                "\t\t\t\t\t\tОн эки айда бир келген,\n" +
                                "\t\t\t\t\t\tБилесиңби атаны?\n\n" +
                                "4. Сын атоочтун морфологиялык жол менен жасалышы.\n" +
                                "Сын атооч бир катар куранды мүчөлөрдүн жардамы менен морфологиялык жол аркылуу да жасалат.\n" +
                                "\n-луу мүчөсү: Зат атоочтон сын атооч жасайт, негиз аркылуу туюндурулган нерсенин бар экендигин белги катары көрсөтөт:\n" +
                                "\n\t\t\t\t\t\tТартиптүү бала - эстүү бала.\n" +
                                "\t\t\t\t\t\tАкылдуу адам көптү билиш үчүн окуйт,\n" +
                                "\t\t\t\t\t\tМайда адам көпкө билиниш үчүн окуйт.\n" +
                                "\t\t\t\t\t\tАныздуу жерде aт өлбөйт.\n" +
                                "\t\t\t\t\t\tКөздүү мончок жерде жатпайт.\n\n" +
                                "-сыз мүчөсү: Бул негиз аркылуу туюндурулган нерсенин жок экендигин белги катары көрсөтөт:\n" +
                                "\n\t\t\t\t\t\tТалапсыз өмүр - эч нерсеге татыксыз өмүр. Иретсиз иште ийгилик жок.\n" +
                                "\t\t\t\t\t\tОймоксуз аял болбойт.\n" +
                                "\t\t\t\t\t\tЭмгексиз киреше - бетке чиркөө.\n" +
                                "\t\t\t\t\t\tТоосуз жер болбойт, доосуз эл болбойт.\n\n" +
                                "-дай мүчөсү: Бул мүчө аркылуу жасалган сын атоочтор\n" +
                                "негиз аркылуу туюндурулган затка кандайдыр бир окшоштуктун бар экендигин белги катары көрсөтөт. -дай мүчөсүнүн уланышы менен жасалган сын атоочтордун бир кыйласы өтмө мааниге ээ болуп кеткен. Ошондуктан алар элестүү келип, көбүнчө сүйлөшүү стили менен көркөм стилде колдонулат: тоодой, алтындай, кагаздай ж.б.\n" +
                                "\nМисалы:\n" +
                                "Кесепеттүү манаптан кенедей пайда таппадык.\n" +
                                "(Бул сүйлөмдө кенедей - кенеге окшош эмес, кичинекей маанисинде салыштырылды.)\n" +
                                "Сын атоочтор зат атоочтор менен айкаша айтылып, сүйлөмдө аныктоочтук милдетти аткарат. Аныкталгыч менен форма жактан өзгөрүүсүз туруп, ыкташуу аркылуу байланышат. Мисалы: Жакшы зайып - үйдүн куту.\n" +
                                "(Жакшы, зайып сөздөрү бири-бири менен ыкташуу аркылуу байланышты.)\n" +
                                "Сын атооч нагыз сын атоочтук мааниде турганда аныктоочтук милдетти аткарат.\n\n" +
                                "Мисалы:\n" +
                                "\t\t\t\t\t\tЖакшы сөз жан эргитет, жаман сөз жан кейитет.\n" +
                                "\t\t\t\t\t\tЖакшы сөз - жарым дөөлөт.\n" +
                                "\t\t\t\t\t\tЖакшы сөз таш эритет, жаман сөз баш оорутат.\n" +
                                "\t\t\t\t\t\tЖазгы жамгырга ишенбе, кышкы күнгө ишенбе.\n" +
                                "\t\t\t\t\t\tЖакшы мугалим түзөйт, жаман мугалим көзөйт.\n\n" +
                                "Сын атооч кээде жыйынтыктоочу ойду билдирип,\n" +
                                "сүйлөмдүн аягында келсе, баяндоочтук милдетти аткарат:\n\n" +
                                "\t\t\t\t\t\tАкылдуунун сөзү кыска, айта салса нуска.\n" +
                                "\t\t\t\t\t\tКыздын кырк чачы улуу.\n" +
                                "\t\t\t\t\t\tАр кимге өз жаны кымбат.\n" +
                                "\t\t\t\t\t\tСөздүн кыскасы жакшы,\n" +
                                "\t\t\t\t\t\tАркандын узуну жакшы.\n" +
                                "\t\t\t\t\t\tАрык кой тырышчаак, ач киши урушчаак.\n\n" +
                                "Сын атоочтун баяндоочтук милдети сүйлөм тизмегинде\n" +
                                "алган ордуна байланыштуу. Анын баяндоочтук милдетти аткарышы ээлик милдетине салыштырганда басымдуу, себеби баяндоочтун милдетин сапаттык, катыштык сындардын бардык түрлөрү аткарышы мүмкүн. Мында баяндоочтор аныктоочторго берилүүчү суроолорго жооп берет. Семантикасында сапаттык окшоштук, бардык - жоктук маанилерди берет.\n" +
                                "Сын атоочтор заттык маанини билдирип, сүйлөм ичинде ээлик милдетти да аткарат:\n\n" +
                                "\t\t\t\t\t\tАрык семирет, ач тоюнат.\n" +
                                "\t\t\t\t\t\tЖаш күчү менен, кары кеңеши менен барктуу. Билими күчтүү минди жыгат,\n" +
                                "\t\t\t\t\t\tБилеги күчтүү бирди жыгат.\n" +
                                "\t\t\t\t\t\tAт жакшысы жолдо сыналат,\n" +
                                "\t\t\t\t\t\tДос жакшысы айыгышкан жоодо сыналат.\n\n" +
                                "Сын атоочтун синтаксистик жол менен жасалышы\n\n" +
                                "Сын атоочтун жана тактоочтун синтаксистик жол менен жасалышында окшоштуктар байкалат. Экиден кем эмес түзүүчү менен жасалган сын атоочтор синтаксистик жол менен жасалган болот. Мындай сын атоочтор татаал сын атоочтор деп аталат. Татаал сын атоочтор кош сөздөр же кошмок сөздөр тибинде болот. Мына ошого жараша алар кош сын атоочтор жана кошмок сын атоочтор деп жалпысынан эки топко бөлүнөт.\n" +
                                "\nКош сын атоочтор\n\n" +
                                "Табияты жагынан сын атоочтун өзгөчөлүгүнө ээ болгон кош сөздөр кош сын атоочтор деп аталат. Жазууда булардын компонентинин арасына сызыкча коюлат: алдуу-кучтүү, бийик-жапыз, кызыл -тазыл. Кош сын атоочтордун ар бир компоненти жеке, өз алдынча мааниге ээ болушу да, болбой калышы да мүмкүн. Ар бир компоненти жеке, өз алдынча мааниге ээ болгон кош сын атоочтор: ак-кара, улуу-кичүү, жылуу-жумшак ж.б.\n" +
                                "Бир компоненти жеке, өз алдынча мааниге ээ болгон, бирок экинчи бири ал касиетке ээ болбогон кош сын атоочтор: эски- уску, майда – чүйдө ж.б. Мисалы: Кызыл-тызыл кызгалдактар жашыл тулаңга көрк берет. (Кызыл-тазыл - татаал сын атооч, кандай? деген суроо берилди, кош сын атооч, аныктооч. Жашыл – жөнөкөй сын атооч, аныктоочтук милдетти аткарды.)\n" +
                                "Эки компоненти тең өз алдынча турганда маани бере албаган кош сын атоочтор: одур-будур ж.б.\n" +
                                "\nКошмок сын атоочтор.\n\n" +
                                "Грамматикалык касиети жагынан сын атоочтун өзгөчөлүгүнө ээ болгон кошмок сөздөр кошмок сын атооч деп аталат. Жазууда мындай сын атоочтун компоненттери бөлөк- бөлөк жазылат: кара курөң, ак саргыл, мала кызыл ж.б. Мисалы: Ак саргыл өңүнө мала кызыл көйнөк өтө жарашыктуу. (Ак саргыл, мала кызыл - кандай? деген суроого жооп берет, татаал сын, кошмок сын атооч, арасына эч кандай белги коюлбай, ыкташуу жолу менен жасалат).\n" +
                                "Ар бир компоненти сын атоочтон: ак саргыл, кара ала, кара тору, кара ала; сын атооч менен зат атоочтон: кара көз, кара каш, ак көңүл, ак пейил; сын атоочтун -луу мүчөсү уланган сын атооч менен айкашынан: узун бойлуу, кен далылуу, көп жактуу, нур чырайлуу ж.б. кошмок сын атоочтор да кездешет. Мисалы:\n" +
                                "Ак көңүл адамдан жамандык күтпө.\n" +
                                "(Ак көңүл - татаал сын атооч, кошмок сын.)\n" +
                                "Ушул эле өзгөчөлүктөр тактоочто дал өзүндөй кайталанат. Сын атооч ээнин милдетин төмөндөгүдөй лексика-\n" +
                                "грамматикалык формада туруп аткарат:\n" +
                                "✔️ Айлана - чөйрөдөгү кубулуштардын, көрүнүштөрдүн,\n" +
                                "буюмдардын атын атоочу сын атоочтор сүйлөмдүн ээсинин милдетин аткарышы мүмкүн. Мисалы: Жашыл бат оңсо, кызыл оңбойт. (Эмне бат оңот же оңбойт? -жашыл, кызыл –сүйлөмдүн ээси.)\n" +
                                "Морфологиялык жактан толук талдоо жүргүзө турган болсок, жашыл, кызыл - сын атооч. Маанисинде белгилүү бир ыраңды, түстү билдирет. Синтаксистик жактан - ээ, атооч жөндөмөдө турат, эмне? деген суроого жооп берет.\n" +
                                "\n\t\t\t\t\t\tЖакшы ашын жейт, жаман башын жейт.\n" +
                                "\t\t\t\t\t\tЖакшы ишке келет, жаман ашка келет.\n" +
                                "\t\t\t\t\t\tЖакшы журтунун камын жейт, жаман журтунун малын жейт.\n" +
                                "\t\t\t\t\t\tЖакшы эл камын ойлойт, жаман өз камын ойлойт.\n\n" +
                                "Демек, жакшы, жаман деген сөздөр сүйлөм тизмегинде\n" +
                                "(синтаксисте) заттык маанини ичине камтыган, бирок өзүндөгү сындык маанини жоготпойт. Морфологияда жай, сапаттык сын, уңгу формасында турат.\n" +
                                "✔️ Сын атоочторго таандык, сан мүчөлөр жалганып, ээнин милдетин аткарат. Кандай учурда?\n" +
                                "Мисалы:Кызылдан агы жакшы.\n" +
                                "Таандык мүчө уланып турган сөз - ээ, атооч жөндөмөдө семантикасында заттык мааниге ээ болуу менен бирге сындык маанисин жокко чыгарбай сактаган. Жакшы - унгу, жай сындан турган баяндооч.\n" +
                                "Сын + зат + таандык мүчө айкашкан сөздөн зат атооч түшүрүлсө андагы таандык мүчө сын атоочко жалганат да ээнин милдетин аткарат.\n" +
                                "Затташкан сын атоочтор толуктоочтук милдетти аткарат." +
                                "\n\n\t\t\t\t\t\tЖакшыга жанаш жамандан адаш.\n" +
                                "\t\t\t\t\t\tЖакшыга жут жок, жаманга кут жок.\n" +
                                "\t\t\t\t\t\tЖакшыга бир сөз, жаманга миң сөз.\n\n" +
                                "✔️ Сын атооч толуктоочтук милдетти иликтен башка жөндөмөдө туруп аткарат. Сөз айкаштын багындыруучу түгөйү, жөндөмө мүчөлүү зат атооч түшүрүлсө, жөндөмө мүчө багыныңкы түгөйү болгон сын атоочко барып жалганат да, сын атооч толуктоочтун милдетин аткарат.\n" +
                                "\nМисалы:\n" +
                                "\t\t\t\t\t\tКүлүк аттан күлүк am чыкса, төрт аягы тыбырайт.\n" +
                                "\t\t\t\t\t\tБул сүйлөмдү макал катары салыштыралы:\n" +
                                "\t\t\t\t\t\tКүлүктөн күлүк чыкса, төрт аягы тыбырайт,\n" +
                                "\t\t\t\t\t\tЧеченден чечен чыкса, оозу - мурду кыбырайт.\n" +
                                "\t\t\t\t\t\tМында күлүк аттан деген айкаш күлүктөн деген формага\n" +
                                "\t\t\t\t\t\tайланган, күлүк - аныктооч, күлүктөн - толуктооч. Жакшыга айтсан билет,\n" +
                                "\t\t\t\t\t\tЖаманга айтсан күлөт.\n\n" +
                                "Бул сүйлөмдө да адамга деген толуктооч түшүрүлгөндүктөн, жакшы, жаман деген сын атоочтор барыш жөндөмөнүн мүчөсү менен айкашып, кимге? деген суроого жооп берип толуктоочтун милдетин аткарды. Кыскасы, сын атоочтор илик жөндөмөдөн башка жөндөмөлөрдө турганда толуктоочтун милдетин аткарып калат.\n" +
                                "\n\t\t\t\t\t\tЖакшыга жакын болсоң, колун асманга жетер,\n" +
                                "\t\t\t\t\t\tЗалим менен жакын болсоң, башың жерге кирер.\n" +
                                "\t\t\t\t\t\tЖакшы сын атооч -га барыш жөндөмөсүнүн мүчөсү\n" +
                                "\nуланып толуктоочтун милдетин аткарса, залим менен деген жандооч менен катар келип, толуктоочтук милдетти аткарды.\n" +
                                "Сын атоочтор кээде этиштер менен айкашып, бышыктооч да болот. Мисалы: Таалайга дилгир элимдин тарыхын кенен жазбасам.");
                break;
            case 6:
                openActivityActivityThemes("Тема: Сан атооч", "Маселелер:\n" +
                        "1. Сан атооч сөз түркүмү боюнча жалпы маалымат.\n" +
                        "2. Сан атоочтун маанилик топторго бөлүнүшү.\n" +
                        "3. Сан атоочтордун жасалышы.\n" +
                        "\n1. Сан атооч заттардын (кээде кыймыл – аракеттердин) сан жагынан белгисин – жакталган санын (миң кой, кырк киши, жүз өрдөк ж.б.) же сан жагынан чамаланышын (он миңдей китеп, беш миңче уй), болбосо эсептөөдөгү катар ордун, иретин (1-, 2-, 3-) билгизет. Бул учурда ал сын атооч сыяктуу эле жөндөмөлөр менен жөндөлбөйт, таандык категориясы менен өзгөрбөйт. Синтаксистик жагынан да мүнөздүү түрдө зат атооч менен айкашып – аныктоочтун, кээде этиш менен айкашып, бышыктоочтун милдетин аткарат. М: Жүз кишинин ортосуна от жаккан адам бир кишини оң жолго салган адамдын тырмагынан айлансын. Эки адам чатакташса, алардын акылдуусу айыптуу. Ал сени издеп төрт келди.\n" +
                        "Сан атоочтор маанилериндеги жана грамматикалык жаратылышындагы айрым өзгөчөлүктөрүнө ылайык алты топко бөлүнөт: эсептик сан, иреттик сан, жамдама сан, чамалама сан, бөлчөк сан, топ сан.\n" +
                        "\n1. Заттардын, кээде кыймыл – аракеттин сан жагынан өзгөчүлүгүн эсептик сан билгизет. М: Чарбада жүз миң кой, беш жүз уй бар. Ат баспайм деген жерин жүз басат. Биз дарыядан чыктык жол менен, Алты миң төрт жүз кол менен («Манас»).\n" +
                        "Эсептик сан жогоркудай учурда сүйлөмдө аныктоочтун (зат атооч менен айкалышып), кээде бышыктоочтун (этиш менен айкашып) милдетин аткарат.\n" +
                        "Эсептик сандын өзүнө тиешелүү мүчөсү жок. Ошондуктан башка сан атоочтордун мүчөсү уланбаган сөздөрдүн (сан атооч) баары эсептик сан катары каралат. Алар туюндурган маанилерине ылайык төмөндөгүдөй майда топторго бөлүнөт: бирдик сандар, ондук сандар, жүздүк сандар, миңдик сандар\n" +
                        "ж.б. Ошентип, өзүнө тиешелүү мүчөсү болбогон заттардын кээде\n" +
                        "кыймыл – аракеттин санын, өлчөмүн, билгизип, сөз өзгөртүүчү системасы менен өзгөрө албаган, бирок эсептик түшүнүктүн аталышын туюндурса жөндөмөлөр менен жөндөлүп, таандык категориясы боюнча ырааттуу өзгөрбөгөн, көбүнчө аныктоочтун милдетин аткарган сан атоочтор эсептик сан атоочтор деп аталат.\n" +
                        "\n2. Иретик сан атоочтор заттардын сан жагынан катар иретин көрсөтүп, -ынчы мүчөсү аркылуу жасалат. Аягы үнсүз менен бүткөн сөзгө жалганса, мүчөнүн башкы тыбышы түшпөйт: биринчи, үчүнчү, кыркынчы, тогузунчу же экинчи, алтынчы, элүүнчү ж.б.\n" +
                        "Бул мүчө татаал эсептик сандын акыркы сөзүнө жалганат: он биринчи, жүз элүү төртүнчү, кырк бешинчи.\n" +
                        "Иреттик сан атоочтор өтө сейрек болсо да этиштер менен айкашып, кыймыл-аракетттин неченчи экенин көрсөтөт. Мисалы: Ал күнкү чоң жарышта Тайбуурул биринчи болуп келди. Терең сырымды сага биринчи айттым.\n" +
                        "Сүйлөм ичинде иретик сан атоочтор мүнөзүү түрдө аныктоочтун, кээде бышыктоочтун милдетин аткарат да, форма жактан өзгөрүүгө учурабайт.\n" +
                        "Ошентип заттардын кээде кыймыл – аракеттин сан жагынан катар иретин көрсөтүп, сөз өзгөртүү системалары аркылуу өзгөрбөгөн, көбүнчө аныктоочтун милдетин аткарган, -ынчы мүчөсү бар сан атоочтор иреттик сан атоочтор деп аталат.\n" +
                        "\n3. Жамдама сан. Сан атоочтун бул тобу сегизге чейинки эсептик сан атоочторго –оо, -өө мүчөлөрүнүн жалганышы аркылуу жасалат. Аягы үндүү менен бүткөн сөздөргө бул мүчөлөр уланганда сөздүн аяккы үндүү тыбышы түшүп калат: бирөө, үчөө, төртөө, бешөө же алтоо, жетөө.\n" +
                        "Жамдама сан эки түрдүү маанини камтый түшүндүрөт:\n" +
                        "\n1. Сан жөнүндөгү маани." +
                        "\n2. Зат жөнүндөгү маани.\n" +
                        "\nБирок бул маанилердин билиниши бирдей болбойт. Сан\n" +
                        "жөнүндөгү маани так даана билинсе, зат жөнүндөгү маани өтө эле жалпыланып туюндурулат. Мисалы: экөө келди десе, сан жөнүндө так, даана түшүнүк алабыз. Бирок заттын ким, эмне экендигин ачык биле албайбыз.\n" +
                        "Жамдама сан атоочтор өтө жалпыланган түрдө болсо да, заттык маанини билдиргендиктен, жөндөмөлөр менен жөндөлөт." +
                        "\n\nМисалы:\n" +
                        "\t\t\t\t\t\tАтооч. Экөө, алтоо\n" +
                        "\t\t\t\t\t\tИлик. Экөөнүн, алтоонун\n" +
                        "\t\t\t\t\t\tБарыш. Экөөнө, алтооно\n" +
                        "\t\t\t\t\t\tТабыш. Экөөнү, алтоону\n" +
                        "\t\t\t\t\t\tЖатыш. Экөөндө, алтоондо\n" +
                        "\t\t\t\t\t\tЧыгыш. Экөөдөн, алтоодон\n\n" +
                        "Ошентип, ачык айкын туюндурулган сандык, жалпыланган\n" +
                        "заттык маанини бир топко бириктирип билгизген, -оо, -өө мүчөлөрү аркылуу жасалып, жөндөмөлөр менен өзгөргөн, бирок калган сөз өзгөртүү системалары менен ырааттуу өзгөрбөй, көбүнчө ээлик, толуктоочтук милдетти аткарган сегизге чейинки сан атоочтор жамдама сан атоочтор деп аталат.\n" +
                        "\n\n4. Чамалама сан. Мындай сан атооч заттардын санын так, ачык-айкын билгизбестен, болжолдоп, чамалап билгизет, морфологиялык жол менен да, синтаксистик жол менен да жасалат.\n" +
                        "Морфологиялык жол менен жасалышында төмөнкү мүчөлөр менен уюшулат.\n\n" +
                        "\t\t\t\t\t\t-ча: кыркча, элүүчө, миңче ж.б.\n" +
                        "\t\t\t\t\t\t-дай: кырктай, ондой, жүздөй ж.б.\n" +
                        "\t\t\t\t\t\t-лаган: ондогон жүздөгөн, миңдеген ж.б.\n" +
                        "\t\t\t\t\t\t-лар: бештерде, отуздарда ж.б.\n\n" +
                        "Чамалама сандын синтаксистик жол менен жасалышында\n" +
                        "сан атооч чамалоо, өлчөм маанисиндеги сөздөр менен айкаша колдонулат же кош сөз тибиндеги эки башка сан атооч пайдаланылат.\n" +
                        "✔️ Уңгу түрүндөгү эсептик санга чакты, чамалуу сөздөр айкалышат: он чакты бала, миң чамалуу китеп, жүз чамасында адам.\n" +
                        "Бир өгүз арабага да он чакты кап менен эгин салышып, аны да пристанга узатышты.(Ч.А.)\n" +
                        "✔️ Чыгыш жөндөмөсүндөгү эсептик санга ашык, ашуун, көп, кем, аз деген сөздөр айкашат: миңден ашуун, он миңден көп ж.б.\n" +
                        "Биздин өлкөдө жүздөн ашуун улут жашайт.\n" +
                        "✔️ Барыш жөндөмөсүндөгү эсептик санга жакын деген сөз\n" +
                        "айкашат: Жер жүзүндө 8500 гө жакын түрдүү куш бар ж.б.\n" +
                        "✔️ Эсептик санды катар колдонуп, кош сөздөр тибине келтирүү аркылуу. Мындай учурда алардын алгачкысы кичине\n" +
                        "санды, кийинкиси чоң санды билгизүү керек: 10-15, 40-50 ж.б. Чамалама сан атоочтор заттык мааниге ээ болсо (субстантивдешпесе) сөз өзгөртүү системалары аркылуу өзгөрбөйт.Бирок кош сөздөр тибиндеги жамдама сан атоочтон жасалса, алардын жөндөлүү мүмкүнчүлүгү сакталат: үч-\n" +
                        "төртөөнү чакырды, төрт- бешөөнөн уктум ж.б.\n" +
                        "Ошентип, чамаланган санды билгизип, сөз өзгөртүүчү\n" +
                        "системасы менен дээрлик өзгөрбөгөн, мүнөздүү түрдө айкындоочтун милдетин аткарган сан атоочтор чамалама сан атоочтор деп аталат.\n" +
                        "\n5. Бөлчөк сан. Мындай сан атоочтор бир бүтүн нерсенин канча бөлүктөргө бөлүнгөнүн, анан бөлүктөрдүн канчасы жөнүндө сөз болуп жаткандыгын билгизүү зарылдыгынан келип чыккан. Мисалы: төрттөн үч, экиден бир ж.б.\n" +
                        "Кыргыз тилинде норма боюнча бөлчөк санда алымы бөлүмүнөн кийин айтылат. Булар өз ара төмөнкүдөй тутумдашат:\n" +
                        "✔️ Бөлүм чыгыш жөндөмөсүндө, алымы атооч жөндөмөсүндо туруу аркылуу: экиден бир, төрттөн үч ондон жети ж.б.\n" +
                        "✔️ Бөлүмү илик жөндөмөсүндө, алымы 3 – жакка таандык формада туру аркылуу: экинин бири, ондун экиси, жүздүн отузу ж.б.\n" +
                        "Ошентип, бүтүн нерсенин жалпысынан канча бөлүктөн турарын, ал бөлүктөрдүн канчасы жөнүндө сөз болуп жаткандыгын билгизген, заттык мааниге ээ болмоюнча, сөз өзгөртүү системалары менен өзгөрбөгөн сан атоочтор бөлчөк сан атоочтор деп аталат.\n" +
                        "\n6. Топ сан. Бир өңчөй заттардын канчадан бир топко бириктирилгендигин билгизип, эсептик санга чыгыш жөндөмөнүн мүчөсүн жалгоо аркылуу пайда болгонун билгизет. Мисалы: экиден, үчтөн, ондон, он-он бештен ж.б.\n" +
                        "Заттарды сан жагынан топ-топко бөлүштүрүү эки түрдүү мааниде берилет:\n" +
                        "✔️ тепетең, барабар бөлүнөт. Бул үчүн бир эле эсептик сан жеке, өз алдынча же кайталануу менен колдонулат да, чыгыш жөндөмөдө турат. Бештен дептер алдык. Биз он-ондон бөлүндүк.\n" +
                        "✔️чамалап, божомолдоп бөлүү. Бул үчүн эки башка эсептик сан атооч жупташып айтылып, чыгыш жөндөмөсүндө турат. Жөндөмө мүчө кээде эки сан атоочко, көбүнчө акыркысына жалганат: үчтөн-төрттөн отурушту, он-он бештен кой күттү ж.б.\n" +
                        "Т оп сан атооч чыгыш жөндөмөсүнүн формасында тургандыктан, башка сөз өзгөртүү системалары менен өзгөрбөйт. Сүйлөмдө бышыктоочтук милдетти аткарат.\n" +
                        "Ошентип, бир өңчөй заттардын канчадан бир топко бириктирилгендигин билгизип, сөз өзгөртүүчү системалары менен өзгөрбөгөн, бышыктоочтун милдетин аткарган сан атоочторду топ сан атоочтор дейбиз.\n" +
                        "\n3. Сан атоочтун жасалышы.\n" +
                        "Сан атооч сөздөр морфологиялык жол менен дээрлик жасалбайт. Айрым сан атоочтордун түрлөрүнүн (иреттик, жамдама жана чамалама сандар) жасалышында гана курандылар (-ынчы, -оо, -ча, -дай, -даган) бар. Булар тууралуу тиешелүү бөлүмдөрдө сөз болду.\n" +
                        "Синтаксистик жол менен татаал сан атоочтор жасалат. Бул жөнүндө да жогоруда, сан атоочтордун түрлөрүндө айтылды. Негизинен сан атооч сөздөр башка сөз түркүмдөрүнөн жасалбайт.");
                break;
            case 7:
openAtAtooch("Тема: Ат атооч","Маселелер:\n" +
        "1. Ат атооч сөз түркүмү боюнча жалпы маалымат.\n" +
        "2. Ат атоочтун маанилик топторго бөлүнүшү.\n" +
        "3. Ат атоочтун жөндөлүшү.\n" +
        "4. Ат атоочтун түзүлүшү.\n\n" +
        "\n" +
        "1. Затты же анын белгилерин атабай туруп, аларды жалпы мааниде көрсөтүүчү сөздөр ат атоочтор деп аталат. Тилде ат атооч эң байыркы убактардан тартып эле колдонулган. Бул анын колдонулууга ыңгайлуулугу менен байланыштуу. Ат атоочтун негизги мүнөздүү өзгөчөлүгү-маанисинин абстракттуулугу жана жалпылыгы. Ат атооч сөздө башка сөз түркүмдөрүнүн ордуна колдонулат.\n" +
        "Ат атоочтордун башка сөз түркүмдөрүнөн айырмалап көрсөтүүчү грамматикалык белгиси жок. Өзүнө тиешелүү суроолору да жок. Ат атооч сөздөр кайсы сөз түркүмүнүн ордуна колдонулса, ошол сөз түркүмүнүн суроосуна жооп берет жана ошол сөз түркүмүнүн грамматикалык категориялары менен өзгөрүүгө учурайт.\n" +
        "Ат атоочтор башка сөз түркүмдөрүнөн негизинен лексикалык мааниси боюнча айырмаланат. Алар мааниси боюнча өзүнчө сөз түркүмү катары лексикалык фондудан бөлүнүп чыккан.\n" +
        "Ат атоочтордун морфологиялык өзгөчөлүгү катарында жөндөлгөндө, алардын кээ бирөөлөрүнүн уңгусунун өзгөрүп кетишин гана атоого болот. Мисалы: мен, менин, мага, мени, менде, менден; ал, анын, ага, аны, анда, андан ж.б.\n" +
        "Ат атоочтор мүчөнүн жардамы менен башка сөз түркүмүнөн жасалбайт. Татаал ат атоочтор гана сөз жасоонун синтаксистик жолу менен жасалышына ээ. Мисалы: алда кандай, алда не, ар ким, кайсы бир, кимдир бирөө, эч кандай, эч ким, эч качан ж.б." +
        "\n2. Ат атоочтор маанисине карай төмөнкү топторго бөлүнөт:\n" +
        "\nЖактама: мен, биз (1-жак); сен,сиз, силер, сиздер(2-жак); ал,алар (3-жак).\n" +
        "\nШилтеме: бу (бул), ушу (ушул), ошо (ошол), тиги (тигил), тетиги (тетигил), тээтигил ж.б.\n" +
        "\nСурама: ким? эмне? не? кандай? кайсы? канча? нече? качан? кайда? кайдан? кана? ж.б.\n" +
        "\nАныктама: бүтүн, бүткүл, баары, ар ким, ар бир, өз ж.б. Белгисиз: кимдир бирөө, бир нерсе, кандайдыр, алда\n" +
        "кандай, алда ким ж.б.\n" +
        "\nТаңгыч: эч ким, эч нерсе, эч бир, эч качан, эч нерсе ж.б. Жактама ат атоочтор.\n" +
        "\nЖактама ат атоочтор затты жак аркылуу көрсөтөт. Жак\n" +
        "сөзгө катышкандардын сүйлөөчүгө карата болгон катышы боюнча аныкталат. Кыргыз тилинде сөзгө тике жана кыйыр түрүндө катышуучу үч жак бар. 1- жана 2- жак (мен,сен) сөзгө тике катышат, 3-жак (ал) кеп процессине катышпайт.\n" +
        "Жекелик түргө көптүк форманы уюштуруучу –лар мүчөсү жалганып, көптүк форманы (биз,силер,алар) уюштурат. 2- жактын сылык жана одоно формасы бар: сен-сиз, силер-сиздер.\n" +
        "Жактама ат атоочтордун өзгөрүшү.\n" +
        "Жак жана таандык категориясы боюнча баары тең эле өзгөрбөйт. Себеби, булар ошол таандык кылып турган тараптардын өздөрүн атайт. Жакчыл таандык мүчөлөр менен 3- жактын жактама ат атоочу гана өзгөрөт:\n" +
        "\n2) аным,аныбыз;\n" +
        "3) аның,аныңыз,аныңар,аныңыздар;\n" +
        "4) анысы.\n\n" +
        "Жалпы таандык мүчө менен жактама ат атоочтордун\n" +
        "бардыгы өзгөрөт: меники, биздики, сеники, сиздики, силердики, сиздердики, аныкы, алардыкы, аныңыздыкы, анысыныкы, аларыңыздыкы.\n" +
        "Жөндөмө категориясы боюнча да өзгөрөт:",R.drawable.morfology_at_atooch_1,"\n\n\n\t\t\t\t\t\t\t\t\tШилтеме ат атоочтор\n\n" +
        "Шилтеме ат атоочтор бир өңчөй заттардан же түшүнүктөрдүн ичинен бирөөнү бөлүп көрсөтөт. Кыргыз тилиндеги ат атоочтор толук жана кыскартылган формада кездешет: бу-бул, ушу-ушул, ошо-ошол, тиги-тигил. Кыскартылган формага -л тыбышынын жалганышы менен толук форма уюшулат.\n" +
        "Шилтеме ат атоочтордун өзгөрүшү.\n" +
        "Шилтеме ат атоочтор өзгөргөн учурда алардын аяккы тыбышы (л) түшүп калат. Булар негизинен зат атооч сөздөрдү алмаштыргандыктан, зат атоочтун грамматикалык категориялары менен өзгөрөт.\n" +
        "Жак жана таандык категориясы боюнча:\n" +
        "Бул-мунум, мунуң, мунуңуз, мунусу; мунубуз, мунуңар, мунуңуздар, булары (мунусу).\n" +
        "Ушул- ушунум, ушунун, ушунуңуз, ушунусу; ушунубуз, ушунуңар, ушунуңуздар, ушулары (ушунусу).\n" +
        "Бардык шилтеме ат атоочтор жалпы таандык мүчө менен өзгөрөт: мунуку, мунусунуку, ушунуку, ошонуңдуку, тигиниңиздики, тээтигиники ж.б. Жак мүчөлөр менен да өзгөрүү өхзгөчөлүктөрүнө ээ: ошолмун, ошолсуң, ошолсуз, ошол; ошолбуз, ошолсуңар, ошолсуздар, ошолор ж.б.\n" +
        "Жөндөмө категориясы боюнча да өзгөрөт:",R.drawable.morfology_at_atooch_2,"\n\n\nСурама ат атоочтор\n\n" +
        "Сурама ат атоочтор белгисиз затты же сандык жана сапаттык белгилерди аныктоо үчүн колдонулуучу сөздөр.\n" +
        "Бул ат атоочтор төмөнкүлөр: ким? эмне? кандай? кайсы? канча? нече? кайда? кана? кайдан? качан?\n" +
        "Бул ат атоочтор сурамалык мааниде колдонулган учурда бир сөзгө же болбосо бүтүн бир сүйлөмгө да тиешелүү болушу мүмкүн. Бирок бул эки учурда тең затты жана сан, сапаттык белгини тике көрсөтө албайт, алардын ат атоочтук көрсөтүү мааниси тыңдоочунун жообу аркылуу такталат:\n" +
        "\n-Бул ким?\n" +
        "-Уулум.\n" +
        "-Кайсы үй?\n" +
        "-Кийинкиси.\n" +
        "-Өңү кандай?\n" +
        "-Кызыл.\n\n" +
        "Сурама ат атоочторду алар жоопту талап кылган маанилерге\n" +
        "карата өзүнчө топторго бөлүүгө болот:\n" +
        "\n1. Жооп катары зат атоочторду талап кылган сурама ат\n" +
        "атоочтор: ким? эмне? жана булардын өзгөргөн бардык формалары.\n" +
        "2. Жооп катары сын атоочторду талап кылган сурама ат атоочтор: кандай? кайсы?\n" +
        "3. Жооп катары сан атоочторду талап кылган сурама ат атоочтор: канча? нече? канчанчы? неченчи? канчоо? нечөө?\n" +
        "4. Жооп катары тактоочторду талап кылган сурама ат атоочтор: кайда? кайдан? качан? кана?\n" +
        "5. Жооп катары этиштерди талап кылган сурама ат атоочтор: эмне кылып жатат? эмне болду? эмне болот? эмне кылат? ж.б.\n\n" +
        "Сурама ат атоочтордун өзгөрүшү да мына ушул топторго ылайык жооп болуп түшө турган сөздөрдүн өзгөрүү өзгөчөлүктөрүнө жараша болот. Контексттеги маанисине карай алар суроо маанисин да туюндурбай калышат: Ким иштебесе ал тиштебейт, ж.б.\n" +
        "\n\n\t\t\t\t\t\t\t\t\tАныктама ат атоочтор\n\n" +
        "Аныктама ат атоочтор бир өңчөй заттарды, түшүнүктөрдү жалпылап бир топко бириктирип же топтон жалгыздатып бөлүп көрсөтөт. Алар берген маанилерине жараша жалпылагыч, жиктегич жана өздүк болуп үч топко бөлүнөт:\n" +
        "Жалпылагыч аныктама ат атоочтор заттарды, түшүнүктөрдү кандайдыр бир топко бириктирип же кошуп жалпылап көрсөтөт. Мисалы: бүтүн, бүткүл, бардык, баары, бардыгы, бүт, бүтүн ж.б. Булардын айрымдары гана таандык болуп өзгөрөт жана жөндөлөт.\n" +
        "Жиктегич аныктама ат атоочтор заттарды, түшүнүктөрдү тобунан ажыратып, бөлүп көрсөтөт, жекелигин аныктайт. Мисалы: ар бир, ар ким, ар кайсы, ар кандай ж.б. Булар таандык болуп да, жөндөмө мүчөлөрү менен да өзгөрө берет.\n" +
        "Өздүк аныктама ат атооч затты (көбүнчө сүйлөп жаткан тарапты) башкалардан бөлүп көрсөтөт. Мындай ат атооч бирөө гана: өз. Бул сөз таандык болуп да, жөндөмөлөр менен жөндөлүп, айрым жактар боюнча да өзгөрөт.\n" +
        "\n\n\t\t\t\t\t\t\t\t\tБелгисиз ат атоочтор\n\n" +
        "Ар кандай заттардын, түшүнүктөрдүн жана алардын мейкиндик-мезгилдеш же кайсы бир башка касиеттеринин белгисиз экенин билгизген ат атоочтор белгисиз ат атоочтор деп аталат. Мисалы: алда канча, алда кандай, алда ким, алда не, кимдир бирөө, кандайдыр бир, бир нерсе, бирдеме, бир нече ж.б.\n" +
        "Белгисиз ат атоочтор маанилери боюнча өзүнчө төмөндөгүдөй топтордон турат:\n" +
        "\n1. Заттык белгилердин белгисиздигин билдирген ат атоочтор: кимдир бирөө, бир нерсе, бирдеме, алда ким, алда не ж.б. Булар зат атоочтун грамматикалык категориялары менен өзгөрө берет: бир нерсем, бирдемең, бир нечебиз; кимдир бирөөнүн, кимдир бирөөгө, кимдир бирөөнү, кимдир бирөөдө, кимдир бирөөдөн, кимдир бирөөлөр ж.б.\n" +
        "2. Касиет, сын-сыпат белгилердин белгисиздигин же болжолдуулугун билдирген ат атоочтор: кандайдыр бир, кайсы бир, алда кандай ж.б. Булар жөндөмөлөрдө өзгөрбөйт, айрымдары таандык болуп айтылышка ээ: кандайдыр бири, кайсы бирибиз, кай бириңер ж.б.\n" +
        "3.Сан-өлчөм белгилердин белгисиздигин же болжолдуулугун билдирген ат атоочтор: бир нече, бир канча, алда канча ж.б. Булар стилдик максатта гана жөндөмө мүчөлөрү менен өзгөрө бериши мүмкүн.\n\n" +
        "Таңгыч ат атоочтор\n" +
        "Айтыла турган заттын, мезгилдин, касиеттин, орундун жок экендигин же ойго тескери келген маанини билдирген ат атоочтор таңгыч ат атоочтор деп аталат. Мисалы: эч качан, эч ким, эч нерсе, эчтеке, эч бир, эч кандай ж.б.\n" +
        "\t\t\t\t\t\t\t\t\tТаңгычататоочтордун мааниликтоптору:\n\n" +
        "1. Кандайдыр заттын же заттык түшүнүктөрдүн жок экендигин, сөзгө катышпагандыгын билгизген ат атоочтор: эчтеке, эч нерсе, эч ким. Булар зат атоочтун бардык категориялары менен өзгөрө берет: эчтемем, эчтемең, эчтемеңиз, эчтемеси, эчтемебиз, эчтемеңер, эчтемеңиздер; эчтеменин, эчтемеге, эчтемени, эчтемеде, эчтемеден; эч кимсиң ж.б.\n" +
        "2. Кандайдыр сапаттык белгилерди, түшүнүктөрдү жок кылып, танып көрсөткөн ат атоочтор: эч кандай, эч кайсы. Булар жөндөмө категориясы боюнча өзгөрөт: эч кайсынын, эч кайсыга, эч кайсыны, эч кайсыда ж.б.\n" +
        "3. Мейкиндик жана мезгилдик түшүнүктөрдү танып көрсөткөн ат атоочтор: эч качан, эч кайда, эч кайдан. Булар зат атоочтун грамматикалык категориялары менен өзгөрбөйт.");
break;
            case 8:
                openActivityActivityThemes("Тема: Этиш","Маселелер:\n" +
                        "1. Этиш сөз түркүмү боюнча жалпы маалымат.\n" +
                        "2. Этиштин грамматикалык категориялары.\n" +
                        "3. Этиштин түзүлүшү жана жасалышы.\n\n" +
                        "1. Этиш - кыймыл аракетти билдирет. Кыймыл аракеттин мааниси кең, б.а. нагыз билинип турган этиштер менен бирге, ал – абал (отур, тур), ал – абалдын өзгөрүшү (картай, агар, жашар) сыяктуу башка түшүнүктөрдү кыймыл – аракет түрүндө көрсөтөт. Этиште ал-абал, чак менен байланыштырылып, убакыт боюнча өтүлүүчү кыймыл-аракет түрүндө берилет. Этиштин ар кандай кыймыл-аракетин убакытка байланыштыруу этишти башка сөз түркүмдөрүнөн айырмалоочу өзгөчөлүгү болуп эсептелинет.\n" +
                        "Этишке мүнөздүү жана аны башка сөз түркүмдөрүнөн айырмалоочу грамматикалык категориялар- мамиле, ыңгай, чак.\n" +
                        "\n\n\n\t\t\t\t\t\t\t\t\tМамиле категориясы.\n\n" +
                        "Мамиле категориясы этиштик кыймыл-аракетке карата сүйлөмдүн ээсинин объектилик-субъектилик карым-катышта экендигин билдирүү үчүн колдонулат. Кыймыл-аракеттин ээге болгон мамилесин аныктоо дегенибиз - сүйлөмдүн ээсине мамиле мүчөлөрү жалганып, баяндоочтук милдет аткарган этишке карата объект же субъект (реалдуу же реалдуу эмес субъект) экендигин белгилөө. М: «Атам өтүк тиктирди» жана «Атам өтүкчүгө өтүк тиктирди» деген сүйлөмдө грамматикалык ээ-бул атам. 1-сүйлөмдө ишти чыныгы иштөөчүнүн субъектиси. 2-сүйлөмдө чыныгы иштеген субъект-толуктооч.\n" +
                        "Ошентип мамиле формаларынын кээ биринде грамматикалык ээ өзүнүн баяндоочуна карата иштеп, чыныгы иштөөчү субъектиси болсо, кээ бирөөндө боло албайт.\n" +
                        "Кыргыз тилинде мамиле категориясынын түрү бар: негизги, өздүк, кош, аркылуу, туюк.\n" +
                        "\nНегизги мамиле-кыймыл-аракеттин ээ тарабынан иштелгендигин көрсөтөт. Туунду жана тубаса этиштер мамиле формаларынын жасалышы үчүн негиз болуп кызмат кылышат. Ошентип алар негизги мамиле болуп эсептелет.\n" +
                        "Өзүнө тиешелүү мүчөсү жок. М: Айша кир жууду. Кээде – ган мүчөсү. - Айтылган сөз жерде калбайт.\n" +
                        "\nКош мамиле: субъектилердин өз ара, же биргелешип иштешкен кыймыл-аракетин билдирет.Ал этиш сөздөргө -ыш мүчөсүнүн жалганышы аркылуу жасалат. М: Жүздөй жигит дүр этип аттанышып, карагайы көрктүү шаардай көрүнүп, балык жон тартып жаткан тоону бет ала бастырышты. (К.М)\n" +
                        "\nӨздүк мамиле-кыймыл-аракеттин реалдуу субъектиге багытталганын, же анын айланасында топтолгонун көрсөтөт. – ын мүчөсү М: тоюн, ачын, аян, бошон, сактан, мактан ж.б.\n" +
                        "\nТуюк мамиледе этиштер сырттан болгон кыймыл- аракеттин грамматикалык субъектиге багытталганын билдирет. Мында субъект ошол кыймыл аракетти башынан өткөрөт, ага дуушар болот. –ыл мүчөсү М: кабагы ачылды, жарпы жазылды, ж.б.\n" +
                        "\nАркылуу мамиле: кыймыл-аракеттин башка бирөө тарабынан иштелгенин блдирет. Мүчөлөрү көп: -дыр, -кар/- кыр, -каз/-кыз, -ар/-ыр, -ыз/-из, -сөт, -т, -ыт ж.б.\n" +
                        "М: өстүр, отургуз, чыгар, угуз, көрсөт, күчөт, коркут ж.б.\n" +
                        "\n\n\t\t\t\t\t\t\t\t\t\t\tЫңгай категориясы\n\n" +
                        "Кыймыл-аракеттин чындыкта аткарылышына карата сүйлөөчүнүн мамилесин билдирет. Чындыкка карата бул мамилени билдирүү үчүн кыргыз тилинде беш ыңгай колдонулат: баяндагыч, буйрук, шарт, тилек, ниет.\n" +
                        "\nБаяндагыч ыңгай өткөн чак, учур чак, келер чак, түрүндө кыймыл-аракеттин аткарылышын ачык көрсөтөт: окудум, окуйм, окуйт. Мүчөлөрү: -а, -ды, -ган, -ыптыр, -чы ж.б.\n" +
                        "\nБуйрук ыңгай сүйлөөчүнүн тыңдоочуга же тыңдоочу аркылуу 3-жакка карата буйруу иретинде жасаган мамилени баяндайт. Буйрук ыңгайды этиштин негизги формасы уюштурат, Тубаса этиштер –оку, жаз, бол, бүт ж.б. –гын,-гыла, -ыңыз, -сын, -ыш+сын, гы+ла мүчөлөрү да жалганат.\n" +
                        "Шарттуу ыңгай – аракет-кыймылдын иш жүзүнө ашырылышы үчүн шарт болуп түшкөн этиш. Мүчөсү –са. М: келсе, алса, ичсе, жатса, кайтса, айтса, ж.б.\n" +
                        "\nТилек ыңгай - сүйлөөчүнүн башкаларга каалаган каалоосу (оң же терс мааниде) ар башка, ар түркүн болгондугуна байланыштуу, аны уюштуруучу мүчөлөр да ар башка – айын/йы, -гай+эле. Мисалы: барайын, жөнөйүн, келгей эле, ж.б.\n" +
                        "\nНиет ыңгай - аракет-кыймылдын жүзөгө ашырылышына карата сүйлөөчүнүн ниетин билдирет. Негизги мүчөсү –мак, - макчы. Мисалы: көрмөк, сунуштамак, айтмакчы, сурамакчы ж.б.\n\n" +
                        "\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tЧак категориясы\n\n" +
                        "Этиштин чак категориясы кыймыл-аракеттин сүйлөп жаткан мезгилге карата болгон катышын билдирет. Башкача айтканда, кыймыл-аракеттин сүйлөп жаткан учурда болуп жаткандыгын, же сүйлөп жаткан учурдан мурун болуп өткөндүгү, же болбосо иштин болорун көрсөтөт. Чак категориясы - этишке таандык категория, ал- этишти башка сөз түркүмдөрүнөн айырмалоочу негизги белгилеринин бири.\n" +
                        "Чак категориясы, негизинен, этиштин баяндагыч ыңгайына мүнөздүү. Этиштин шарттуу, буйрук, ниет, тилек ыңгайлары чындыкты болуп жаткан кыймыл-аракетти көрсөтпөй, кыймыл- аракеттин аткарылышына керектүү болгон шартты, ниетти, каалаган ойду же буйрууну билдирет б. а. модалдуулукту көрсөтөт; алар чак категориясына толук ээ эмес жана чактык маанилерди ачык билдире алышпайт. Баяндагыч ыңгай, буга карама-каршы, кыймыл-аракеттин азыркы учурда болуп жатканын, мурун болуп өткөндүгүн, же келечекте болорун чындык катары баяндайт, натыйжада андан этиштин чак категориясы ачык көрүнүп турат. Баяндагыч ыңгай үч чак менен айтылат: келер чак, учур чак, өткөн чак.\n" +
                        "\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tУчур чак\n\n" +
                        "Учур чак кыймыл-аракеттин сүйлөнүп жаткан мезгилинде болуп жатканын билдирет. Кыймыл-аракеттин жүрүшү речтин сүйлөнгөн мезгилинен мурда башталып, кийин да улантылышы мүмкүн. Учур чак түзүлүшүнө карата жөнөкөй жана татаал болуп экиге бөлүнөт.\n" +
                        "\n1. Учур чактын жөнөкөй түрү. Бул түрү уңгуга мүчөнүн жалганышы аркылуу жасалат.\n" +
                        "1) Учур чактын -ууда формасы (фонетикалык варианттары менен). Бул формасы сүйлөнгөн убакта кыймыл-аракеттин созулуп жаткандыгын билдирет. Морфологиялык жагынан кыймыл-атоочтун -оо//-өө, -уу//үү мүчөлөрү+жатыш жөндөмөсүнүн мүчөсүнөн турат.\n" +
                        "2) Чакчылдардын -е//-й формасы аркылуу. Бул мүчөлөр чактык мааниге жак мүчөлөрүнүн жалганышы аркылуу гана жасалат.\n" +
                        "Учур чактын татаал түрү -а-е-й, -ып формасындагы чакчылдарга жак мүчө жалгана турган жат, тур, отур, жүр деген жардамчы этиштердин кошулушу аркылуу аналитикалык жол менен жасалат. Учур чактык маани көбүнчө ушул жол менен берилет; Мен бар-а+жат-а-м. Эл кел-ип+жат-а-т.\n\n" +
                        "\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tКелер чак\n\n" +
                        "Келер чак кыймыл-аракеттин сүйлөнгөн мезгилден кийин болорун билдирет. Келечекте болуучу кыймыл-аракеттин жүзөгө ашырылышы бирде күнөмсүз, ачык болсо, бирде күнөм туудурушу мүмкүн. Ушул маанисине карата келер чак айкын келер чак, арсар келер чак болуп өз ара экиге бөлүнөт.\n" +
                        "\n1. Айкын келер чак. Айкын келер чак кыймыл-аракеттин болор, болбосун ачык көрсөтөт. Формалык белгиси боюнча учур чактын -а-е--й формасынан айрылбайт. Экөөнүн жасалышы бирдей: чакчылдардын -а-е-й формасына жак мүчөлөрүнүн жалганышы аркылуу уюшулат. Келер чактык же учур чактык мааниде колдонулушу сүйлөмдүн контекстиси боюнча аныкталат.\n" +
                        "\n2. Арсар келер чак. Келер чактын бул түрү кыймыл- аракеттин болор, болбосун арсар көрсөтөт. Арсар келер чактын морфологиялык көрсөткүчү болуп -ар-ер мүчөсү эсептелет.\n\n" +
                        "\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tӨткөн чак\n\n" +
                        "Өткөн чак сүйлөнүп жаткан мезгилден мурун болгон кыймыл-аракетти билгизет, кыймыл-аракет ар түрдүү кырдаалда жана ар кандай мезгилде болгондугуна карата өткөн чак өз ара төмөнкүдөй болуп бөлүнөт:\n" +
                        "\n1. Айкын өткөн чак. Айкын өткөн чактын морфологиялык белгиси -ды мүчөсү. Ал кыймыл-аракеттин аткарылгандыгы сүйлөөчү үчүн айкын-ачык болгон учурда колдонулат.\n" +
                        "Айкын өткөн чак да сүйлөнгөн мезгилге эч бир тиешеси жок, жалпы эле кыймыл-аракетти билдирет. Бул мааниде ал өтө сейрек түрдө макал-лакаптардан, насыят ырлардан учурайт:\n" +
                        "Жардылык сени кантейин,\n" +
                        "Жандай досту жат кылдың.\n" +
                        "Карылык сени кантейин,\n" +
                        "Сүйлөр сөзгө мерт кылдың.\n" +
                        "\n2. Жалпы өткөн чак. Өткөн чактын бул түрү этишке -ган\n" +
                        "мүчөсүнүн жалганышы аркылуу жасалат. -ган мүчөлүү этиш, жак мүчөсү жалганып, баяндоочтук милдетти аткарып турганда, өткөн иштин фактысын сүйлөнгөн мезгил үчүн баяндайт.\n" +
                        "\n3. Капыскы өткөн чак. Капыскы өткөн чактын морфологиялык мүчөсү – ып, -ыптыр.\n" +
                        "\n4. Адат өткөн чак. Өткөн чактын бул түрү адаттанган сыяктуу дайыма болгон кыймыл-аракетти билдирет. Мунун морфологиялык формасы болуп –чу,\n" +
                        "-оочу,-уучу, -ышчу мүчөсү эсептелет:\n\n" +
                        "\n" +
                        "\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tАтоочтуктар\n\n" +
                        "Белгилүү бир убакытка тушташ кыймыл-аракетти заттын белгиси катарында керсөтүүчү этиштин грамматикалык туунду формалары атоочтуктар деп аталат.\n" +
                        "Атоочтуктар затты кыймылдык белгиси боюнча көрсөтүү, аныктоо зарылдыгынан келип чыккан: Мына майрам, мына кызык тамаша: ыр ырдаган ырчысы, комузун черткен комузчусу, бий бийлеген бийчиси, кыягын тарткан кыякчы, кыскасы бардыгы ушул жерде экен (А. У.). Тамактын камын кылып жаткан басмачылар чаң-тополоң түштү (К.Ж) .\n" +
                        "Атоочтуктар этиштик жана атоочтук касиеттерге ээ. Этиштик касиети төмөнкүлөр: 1) кыймыл-аракетти билгизет: Куш аяган киши көк карайт, ат аяган киши жер карайт. Сөздү угар жерге айт, суу-ну сиңер жерге төк; 2) мамиле, чак категорияларына ээ. 3) этиштик касиетин сакташып, өздөрү менен бирге айтылган сөздөрдү жөндөмөнүн тигил же бул формасында болушун талап кылат, б. а. аларды башкарышат.\n" +
                        "\nАтоочтук касиеттери төмөнкүлөр: сын атооч сыяктуу, заттын белгисин билдиришип, аныктоочтук милдет аткарышат. Ал эми этиштин калган туунду формалары (кыймыл атооч, чачкылдар болсо аныктоочтук милдет аткарышпайт).. Мисалы: айдалган жер, окуган киши; кызыл чыт, көк китеп ж. б. Атоочтуктар менен сын атоочтор заттын жалпы эле белгисин билдирип, аныктоочтук милдет аткарганы менен экөө бири- биринен да айырмаланат. Атоочтуктарга сөз өзгөртүүчү мүчөлөр аныкталгычы түшпөсө да жалганат, алардын атооч маанисиндеги касиетке ээлигинин иегизги белгиси ушунда. Мындай учурда да алар жөндөмөлөрдү башкаруу жөндөмдүүлүгүн сакташат, заттанган түшүнүк катарында кыймыл-аракеттин атын же анын процессин билдиришет.\n" +
                        "\n\n" +
                        "\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tЧакчылдар\n\n" +
                        "Жакты жана чакты көрсөтпөй туруп, негизги этиштин кошумча кыймыл-аракетин билгизүүчү туунду форма чакчылдар деп аталат. Чакчылдар негизги этиш менен бирге айтылган учурда аларды аныктоо, тактоо катарында кошумча кыймыл-аракетти билгизет, бышыктоочтук милдет аткарат. Мисалы: Ал каткырып күлдү. Акшырая карады. Бул сүйлөмдөрдө каткырып, акшырая –чакчылдар өздөрүнөн кийинки негизги кый-мыл-аракеттерди кандайча жана кантип болгонун тактап, кощумчалап, алардын белгиси катарында пайдаланылды. Негизги кыймыл-аракетти тактоо, бышыктоо- чакчылдардын башкы мааниси. Бул жагынан алар тактоочтор менен жакындашат.\n" +
                        "Чакчылдар ар дайым эле кошумча кыймыл-аракетти билгизе бербейт. Чакчыл мүчөлөрдүн кээ бирөөлөрү, асыресе -а жана -ып мүчөлөрү (кээде -ганы формасы да) этиштик уңгулуу татаал этиштердин компоненттерин бириктирүүчу грамматикалык каражат катарында да пайдаланылат; мүчөлөр катыштырылбай, татаал этиш куралбайт, ала кел, бара кел, тосуп ал, жатып, ал, карап тур, чаап кой, сатып бер, сатып ал, алып сал ж. б. Мындай учурда негизги кыймыл-аракетти чакчылдар фор-масындагы этиштер билгизет, жардамчы этиштик экинчи компоненти аркылуу ага грамматикалык кошумча маани киргизилет.\n" +
                        "Чакчылдардын бирден бир өзгөчөлүгү нагыз чакчылдык мааниде (кошумча кыймыл-аракетти билгизүү үчүн) айтылган учурда, алар чакты жана жакты билгизбейт; чакты өзүнөн кийинки негизги этиш билгизет. Мисалы: күлө сүйлөдү, эчкирип ыйлады ж. б. Мындагы күлө, эчкирип деген чакчылдар жакты жана чакты билдиришкен жок, бул маанини алардын соңунда турган негизги этиштер билгизип турушат. Чакчылдардын -а//-е//-й жана -ып мүчөлөрү баяндоочтук орунда туруп, өзүнчө кыймыл-аракетти билгизген толук маанилүү этиш катарында колдонулса, буларга жак мүчөлөрү жалганат жана чакты да билдирет: мен бар-а-мын, сен бар-ып- сың ж. б.\n" +
                        "\n\n\t\t\t\t\t\t\t\t\t\t\t\tКыймыл атоочтор\n\n" +
                        "Кыймыл-аракеттин атын, же кыймылдын процессин билдирүүчү этиштин туунду формалары кыймыл атоочтор деп аталат. Кыймыл атоочтор этишке -оо, -уу, -ып, -мак, -май жана - ыш мүчөлөрүнүн жалганышы аркылуу жасалат: баруу, келүү, кыйноо, жыйноо, олтуруш ж. б.\n" +
                        "Кыймыл атоочтун кээ бир формалары, этиштик маанисин жоготуп, атоочтор (зат, сын) тобуна өтүп кетишкен. Бирок грамматикалык формаларынын бирдигине жана атоочтук касиетке ээлигине карап, кыймыл атоочторду алар менен (зат, сын) бирдей даражада кароого болбойт. Булардын атоочтор группасына өтүп кеткендери менен кыймыл атоочтор экөөнүн ортосундагы айырмалар төмөнкүлөр:\n" +
                        "\nI) Кыймыл атоочтор кыймыл-аракеттин атын, же болбосо кыймылдын процессин билдирет: сайроо, олтуруш ж. б.; булар да этиш сыяктуу кыймыл-аракетти билгизет. Ал эми атоочтор группасына биротоло өтүп кеткен туунду формалар (зат, сын) болсо заттык же болбосо сын-сыпаттык маанини б. а. статикалык түшүнүктү билдирет: жазуу, суроо, тааныш, күрөш, уруш, чабыш ж. б.;" +
                        "\n\n2) Кыймыл атоочтор этишке мүнөздүү болгон грамматикалык категорияга (мамиле) ээ: жаздырыштын кереги жок, жазылыштын кереги жок ж. б. Атоочтор группасына өтүп кеткен этиштик туунду формалары (зат, сын) мындай касиетке ээ эмес;\n" +
                        "\n3) Кыймыл атоочтор, этиштик касиетин сактап, өздөрү менен бирге айтылган сөздөрдү жөндөмөнүн тигил же бул формасында болушун талап кылат:\n" +
                        "Кыймыл атоочторго да, атоочтор сыяктуу жөндөмө, таандык сөз өзгөртүүчү мүчөлөр жалганат, сүйлөмдө атоочтор сыяктуу ээлик жана толуктоочтук милдет аткарышат.");
                break;
            case 9:
                openActivityActivityThemes("Тема: Тактооч","Маселелер:\n" +
                        "1. Тактооч сөз түркүмү тууралуу жалпы маалымат.\n" +
                        "2. Тактоочтун лексико-грамматикалык белгилерине карай топторго бөлүнүшү.\n" +
                        "3. Тактоочтордун жасалышы.\n\n" +
                        "\n" +
                        "Азыркы күндө тактооч өзүнчө сөз түркүмү катары түркология илиминде, анын ичинде кыргыз тил илиминде да жетиштүү деңгээлде изилденген. Кыргыз тили илиминин башатында турган кызыл профессор К.Тыныстановдун окуу китебинде тактооч деген сөз түркүмү катталган эмес. Кээ бир окумуштуулар тактооч өз алдынча сөз түркүмүн түзөт дешсе, кээ бирлери тактооч сөздөрдүн бир бөлүгүн сын атоочко, бир бөлүгүн зат атоочко кошуп келишкен.Тактоочтун башка сөз түркүмүнөн болгон айырмасын ачып, өзүнчө сөз түркүмү экендигин окумуштуу С.Давлетов \"Тактоочтор\" (1960) деген эмгегинде далилдеген.\n" +
                        "Кыймыл-аракеттин ар түрдүү кырдаалын (ордун, мезгилин, себебин, максатын, сан - өлчөмүн, сын - сыпатын) көрсөтүп, сүйлөмдө көбүнчө этиш сөздөр менен айкашып келип, бышыктоочтук милдет аткарган сөздөр тактоочтор деп аталат.\n" +
                        "Ал сөз түркүмүнүн ичинен сын атоочко эң эле жакын турат, сын атооч сыяктуу бир катар тактоочтор белгини көрсөтүп, кандай? деген суроого жооп болуп түшө алат. Мисалы:\n" +
                        "Терең дарыя тынч агат. Эрте ысыган бат муздайт. Бөксө чайнек бат кайнайт.\n" +
                        "Ушул жерден сын-сыпат тактооч менен сын атооч окшош десек болот. Анткени үчөөнө тен эле кандай? деген суроо берилип жатат. Муну менен биз эки нерсени түшүнүшүбүз керек. Тактооч дайыма этиштин ар түрдүү кырдаалын ачык көрсөтөрүн, сын атооч зат атоочтон мурда келип, заттын ар түрдүү белгилерин көрсөтөрүн ажыратабыз. Муну жогорудагы макал-ылакаптардан бир эле сүйлөм ичинде далилдесек болот.\n" +
                        "1- сүйлдөмдөгү терен, тынч деген сөздөрдүн экөөнө тен кандай? деген суроо берилди. Бул окшоштугу. Ал эми айырмачылыгы терен - сын атооч, себеби заттын (дарыянын) белгисин ачып көрсөтсө, тынч – тактооч, себеби этиштин сын – сыпатын (дарыянын кандай агарын) билгизди.\n" +
                        "Тактоочтор башка сөз түркүмүнөн төмөнкү белгилери менен айырмаланат:\n" +
                        "✔️Кыймыл - аракеттин ар түрдүү кырдаалын (ордун, мезгилин, себебин, максатын, сан -өлчөмүн, сын-сыпатын) билгизип, маани жактан абстракттуу келет.\n" +
                        "✔️ Морфологиялык жактан тактоочтун өзүнө гана тиешелүү куранды мүчөлөрү бар. Алар:\n" +
                        "- ча: бала + ча – балача; адам + ча = адамча;\n" +
                        "-лап: эрте + лап = эртелеп; күн + лап = күндөп;\n" +
                        "түн + лап = түндөп.\n" +
                        "Синтаксистик жактан этиш сөздөр менен айкашып келип,\n" +
                        "сүйлөм тизмегинде бышыктоочтук милдет аткарат.\n" +
                        "2. Мына ушул үч белги тактоочту өзүнчө сөз түркүмү кылып турат. Тактоочтор лексика-грамматикалык маанилерине\n" +
                        "карай экиге бөлүнөт:\n" +
                        "\n1. Бышыктагыч тактоочтор.\n 2. Аныктагыч тактоочтор.\n\n" +
                        "Бышыктагыч тактоочтор кыймыл-аракеттин боло турган мезгилин, өтө турган ордун, болуш себебин, же максатын көрсөтүп, өз ара бир нече топко бөлүнөт.\n" +
                        "\n\n\n\t\t\t\t\t\t\t\t\t\t\t\tМезгил тактоочтор.\n\n" +
                        "Кыймыл-аракеттин боло турган учурун, мезгилин көрсөтүп, Качан? Качантан бери? Кайсы кезде? Качанга чейин? деген суроолорго жооп берет.\n" +
                        "Мезгил бышыктагыч тактоочторго негизинен төмөнкү сөздөр кирет: азыр, анан, ар дайым, ар качан, ар убак, бүгүн, кез- кезде, эртен, эртели-кеч, жайды - жайлай, кышты-кыштай, мурун, кийин ж.б. Мисалы: Мурунку чыккан кулактан, кийинки чыккан мүйүз өтүптүр. \n" +
                        "\n\n\n\t\t\t\t\t\t\t\t\t\t\t\tОрун тактоочтор.\n\n" +
                        "Кыймыл-аракеттин боло турган ордун, багытын көрсөтөт да, кайсы?, кайда?, кайсы жактан?, кайсы жакка? деген суроолорго жооп берет. Алга, артка, алды-артына, ары-бери, илгери, жогору, төмөн, анда-мында, ушунда ж.б.тактоочтор кирет. Мисалы:\n" +
                        "Алда кайдан кербен тартып келаткан,\n" +
                        "Кербенчинин төөлөрүндөй чубашкан.\n" +
                        "\n\n\n\t\t\t\t\t\t\t\tСебеп жана максат тактоочтор.\n\n" +
                        "Кыргыз тилинде сан жагынан өтө аз. Буларга:\n" +
                        "аргасыздан, атайын, эрксизден деген саналуу сөздөр кирет. Мисалы:\n" +
                        "Атайлап түшүнбөгөн киши болуп жер карады.\n" +
                        "Себеп жана максат бышыктагыч тактоочтор сын- сыпаттык маанилерге да ээ болушат. Мисалы:\n" +
                        "Аяктуу сөзгө аргасыз жооп кайтарат.\n" +
                        "Аргасыз деген сын-сыпат тактооч, кандай? деген суроо\n" +
                        "берилди. Бышыктоочтун милдетин аткарды.\n" +
                        "\n\n\n\t\t\t\t\t\t\t\t\t\t\tАныктагыч тактоочтор.\n\n" +
                        "Мындай тактоочтор кыймыл-аракеттин сын-сыпатын, сан - өлчөмүн билдирип, өз ара бир нече топко бөлүнөт.\n" +
                        "\n\n\nСын-сыпат аныктагыч тактоочтор кыймыл-аракеттин ар түрдүү сапаттык жагынан өзгөчөлүгүн кандай ык менен ишке ашырыларын, белгисин көрсөтүп кандай? кантип? кандайча? кимче? эмнече? деген суроолорго жооп берет: акырын, аста, адамча, айбанча, тымызын, тез, дароо, бат, ылдам, жай, бирге, бетме-бет, оозмо-ооз, каадасынча, мурункусунча, өзүнчө, көзүнчө, менчилеп, сенчилеп ж.б. сөздөр кирет. Мисалы: Дүйшөнкул Шопоков, Чолпонбай Түлөбердиев өз элин коргоп баатырларча курман болду. (Баатырлар - зат атооч, -ча мүчөсү уланып тактооч болду да, кантип? деген суроого жооп берди. Сүйлөмдө бышыктоочтук милдет аткарды.)\n" +
                        "Эпосто баатырлардын аттары адамча сүйлөйт.\n" +
                        "(Адам - зат атооч, -ча мүчөсү уланып, сын-сыпат тактооч болду да, кандайча? деген суроо берилди. Сүйлөмдө бышыктоочтук милдет аткарды.)\n\n" +
                        "\nСан-өлчөм аныктагыч тактоочтор кыймыл аракеттин сан-өлчөм жактан өзгөчөлүгүн билдирип, канча? нече? канчалык? канчалап? нечелеп? деген суроолорго жооп берет: барынча, болушунча, жетишинче, жапырт, аз - маз, ушунчалык, ошончолук, аз-аздан, саал-паал, бир-бирден, көп-көптөн ж.б. сөздөр кирет. Мисалы:\n" +
                        "Калыгул кары анча шашпайт.\n" +
                        "(Анча деген сан-өлчөм тактооч болду да, кандай? деген\n" +
                        "суроого жооп берди. Сүйлөмдө бышыктоочтун милдетин аткарды.)\n" +
                        "\n3.Тактоочтордун морфологиялык жол менен жасалышы. Негизге сөз жасоочу мүчө жалгоо аркылуу жасалган тактоочтор морфологиялык жол менен жасалган тактоочторго жатат. Кайсы сөз түркүмүнөн жасалгандыгына карай өз ичинен бир нече топко бөлүнүшөт.\n" +
                        "\n1. Зат атоочтон жасалган тактоочтор. Мындай тактоочторду жасоодо төмөнкү мүчөлөр колдонулат:\n" +
                        "-ча: бул мүчө кыргыз тилинде гана эмес, башка түрк тилдеринде да тактоочту жасоочу өнүмдүү мүчө. Анын жардамы менен зат атоочтон жасалган тактоочтор кандайдыр бир нерсенин кыймыл-аракетин негиз аркылуу туюндурган нерсенин кыймыл-аракетине окшоштуруп билгизет: жолборсчо качырды, бүркүтчө шаңшыды.\n" +
                        "-лап: бул мүчөнүн жалганышы менен жасалган тактоочтор сыртынан караганда -ла жана -ып мүчөсү уланган этиштерге окшоп кетет. Мисалы: Экөөлөп, кооздоп деген сөздөр -ып формасындагы чакчылдар. Ал эми айлап - жылдап деген сөздөр -лап мүчөсү аркылуу жасалган тактоочтор. -лап мүчөсү аркылуу мезгилдик маанидеги зат атоочтон жасалган тактоочтор кыймыл-аракеттин болуш, канчалык созулуш мезгилин билгизет: күндөп, түндөп, айлап, жылдап ж.б.\n" +
                        "-чылап: мүчөсү зат атоочторго негиз аркылуу туюндурулган заттын кыймыл-аракетине окшоштуруларын салыштырып билгизет.\n" +
                        "-лай мүчөсү аркылуу жасалган тактоочтор көбүнчө кыймыл-аракеттин канча мезгилге чейин созулушун билгизет: күздөй, жаздай, жайдай, күздү-күздөй, жайды-жайлай ж.б" +
                        "\n Мисалы:\n" +
                        "Жайды-жайлай ырдады, ийнелик жаны тынбады.\n" +
                        "(Жайды-жайлай деген тактооч болду да, бышыктоочтук милдет аткарды. Кантип? деген суроо берилди.)\n" +
                        "-лата деген мүчө зат атоочко уланып да, сын атоочко уланып да тактооч жасайт: жаздaтa, күздөтө, кыштата. (Бул жерде жаз, күз, кыш зат атооч сөздөргө -лата мүчөсү уланып тактооч жасалды.) Мисалы:\n" +
                        "Кымыз куюлду. Улуулата сунулду.\n" +
                        "(Улуу - зат атооч, -лата мүчөсү уланып тактооч болду. Сүйлөмдө бышыктоочтун милдетин аткарат да, кандай? же кантип? деген суроо берилет.)\n" +
                        "\n\n\nТактоочтордун синтаксистик жол менен жасалышы.\n\n" +
                        "Тутумунда экиден кем эмес түзүүчү негизи болгон, алар жалпысынан бир маани билгизип, сүйлөмдүн бир мүчөсү болуп кызмат аткарган тактоочтор синтаксистик жол менен жасалган тактоочтор болот. Булар татаал тактоочтор деп аталат. Татаал тактоочтор сын атооч сыяктуу кош жана кошмок болуп эки топко бөлүнөт.\n\n\n" +
                        "\n\n\n\t\t\t\t\t\t\t\t\t\t\t\tКош тактоочтор.\n\n" +
                        "Грамматикалык касиети жагынан тактоочтун өзгөчөлүгүнө ээ болгон кош сөздөр кош тактоочтор деп аталат. Булардын компоненттеринин арасына сызыкча коюлат. Мисалы: оозмо- ооз, бетме-бет, жайды-жайлай, кышты-кыштай ж.б.\n" +
                        "Кош тактоочторду жасалышына карата негизинен төмөнкү түрлөргө бөлүүгө болот:\n" +
                        "✔️ Негиздердин кайталанышы же жупталышы менен жасалган тактоочтор: бат-бат, тез-тез, ылдам-ылдам, өйдө - ылдый, ары-бери ж.б.\n" +
                        "✔️ Биринчи компоненти негизги формасында туруу менен жасалган тактоочтор. Мындай типтеги тактоочтордун экинчи компоненти мейкиндик жөндөмөлөрдүн формасында болот: кез- кезде, күндө-күндө, анда-санда, андан-мындан ж.б.\n" +
                        "✔️ Биринчи компоненти негиз формасында, экинчи компоненти жөндөмөлөр формасында туруу менен жасалган тактоочтор. Мындай типтеги тактоочтордун экинчи компоненти мейкиндик жөндөмөлөрдүн формасында болот: кез-кезде, аз- аздан ж.б.\n" +
                        "✔️Эки компоненти тең жөндөмөлөр формасында турган тактоочтор: кээде-кээде, күндө-күндө, анда-санда, андан- мындан ж.б.\n" +
                        "✔️Биринчи компонентине -ма мүчөсү жалганып, экинчи компоненти негиз түрүндө турган тактоочтор: үймө-үй, көзмө- көз, жекеме-жеке, колмо-кол ж.б.\n" +
                        "\n\n\n\t\t\t\t\t\t\t\t\t\tКошмок тактоочтор.\n\n" +
                        "Грамматикалык касиети жагынан тактоочтун белгилерине ээ болгон кошмок сөздөр кошмок тактоочтор деп аталат. Булардын компоненти өз-өзүнчө араларына эч белги коюлбай жазылат: алда кайда, алда качан, ар качан, эч убакта, бир кезде, бир күнү, ар убак, ар дайым ж.б.\n" +
                        "Мисалы: Эч убакта, эч качан, эч нерсе унутулбайт.\n" +
                        "Кошмок тактоочтордун биринчи компоненттери катары көбүнчө эч, бир, ар, алда деген сөздөрү колдонулат.\n");
                break;
            case 10:
                openActivityActivityThemes("Тема: Кыргыз тилиндеги сырдык жана тууранды сөздөр","\n" +
                        "Маселелер:\n" +
                        "1. Сырдык сөздөр жана алардын маанисине карай бөлүнүшү.\n" +
                        "2. Сырдык сөздөрдүн жазылышы.\n" +
                        "3. Тууранды сөздөр жана алардын түрлөрү.\n" +
                        "4. Тууранды сөздүн түзүлүшү, колдонулушу жана\n" +
                        "жазылышы.\n\n" +
                        "1. Сүйлөм тизмегинде туруп айтылуучу ойдогу ички сезимдерди жана адамдын айбанаттарга карата болгон түрдүү мамилесин билдирүү үчүн колдонулган сөздөр сырдык сөздөр деп аталат. Мисалы: Пай-пай-пай, эмне деген казына, эмне деген байлык! (Т.С.) Ах, айлана кандай сонун көрүнөт! Өш! Талаада калгыр, өш! (Т.С.)\n" +
                        "Сырдык сөздөр берген маанисине карай экиге бөлүнөт.\n" +
                        "\n1) Сезимди билдирүүчү сырдык сөздөр\n" +
                        "2) Айбанга карата мамилени билдирүүчү сырдык сөздөр.\n" +
                        "\nСезимди билдирүүчү сырдык сөздөр адамдын ар түрдүү ички сезимин, айлана-чөйрөгө карата болгон мамилесин билдирет:\n" +
                        "\nа) Кубануу, ыраазы болуу, кубаттоо, мактоо. Мисалы: Бах! Сонун ырдашат экен ээ! Бали! Эбегейсиз зор демилге көтөргөн экенсиңер. (Н.Б.) Ботом, сен кайда кеттиң?\n" +
                        "\nб) Өкүнүү, кайгыруу, капалануу, коркуу, кейүү, чочуу. Мисалы: Ой, чиркин ай! Өчпөс ойго күндөн-күнгө чөктүң го. (К.Ж.) Кап, унутуп калганымды карачы! Апей, жылан! Ой, кокуй оой! Баятан эле айтпайсыңбы.\n" +
                        "\n2. Айбанга карата болгон мамилени билдирүүчү сырдык сөздөр. Мында айбанаттарды чакыруу же токтотуу, айдоо иретинде колдонулат. Мисалы: Өш! Чү-чү! Ноо! Кош! Түбө- түбө! Пыш-пыш! Күчү-күчү! Мо,мо! Кыруу,кыруу! Чиге, чиге! Чөк,чөк! " +
                        "Сырдык сөздөр сүйлөм мүчөлөрү менен байланышпайт жана мүчөлүк милдетти да аткарбайт. Өзүнчө бөлүнүп айтылат. Бирок айрым учурда бир сөз, же бүтүн бир сүйлөм катарында колдонулушу да мүмкүн. Мисалы: Атчандар келип калды! Айда! Чү-чү! Ноо!\n" +
                        "Сырдык сөздөр сүйлөм мүчөлөрү менен байланышпайт жана мүчөлүк милдетти да аткарбайт. Өзүнчө бөлүнүп айтылат. Бирок айрым учурда бир сөз, же бүтүн бир сүйлөм катарында колдонулушу да мүмкүн. Мисалы: Атчандар келип калды! Айда! Чү-чү! Ноо!\n" +
                        "Сырдык сөздөр мааниси жагынан адамдын эмоциялык сезимдерин (өкүнүү, кайгыруу, чочуу, жактырбоо, кубаттоо ж.б.) жана айбанатка карата болгон эрктик мамилени билдирет.\n" +
                        "Сырдык сөздөр менен тууранды сөздөрдүн өздөрүнө гана таандык болгон бөтөнчөлүктөрү бар. Сырдык сөздөрдүн мааниси жагынан да, морфологиялык түзүлүшү жагынан да, синтаксистик кызматы жагынан да маанилүү сөздөр менен кызматчы сөздөрдөн айырмаланган бөтөнчөлүктөрү бар. Маанилүү сөздөр менен салыштыра караганда сырдык сөздөр маани жактан кишинин ар түрдүү эмоциялык сезимдерин билдирген менен, морфологиялык жактан өзгөрбөйт, синтаксистик жактан сүйлөм мүчөсүнүн кызматын аткарбайт, тагыраак айтканда, сүйлөм мүчөлөрү менен синатксистик байланышта болбойт.\n" +
                        "\n3. Сырдык сөздөрдүн жазылышы. Сырдык сөздөр айрым жазылат да, сүйлөмдүн башына, ортосуна, аягына келе берет.\n" +
                        "Сырдык сөздөр сүйлөмдүн башында өтө күчтүү сезим менен айтылса, өзүнөн кийин илеп белгиси келип, андан кийинки сөз чоң тамга менен башталып жазылат. Мисалы: Бали! Ырчы болсо сендей болсун.\n" +
                        "Эгерде сүйлөмдүн башында күчтүү сезим менен айтылса, сырдык сөздөн кийин үтүр коюлат: Ай, ай, Зарыл эжеке. (Т.С.)\n" +
                        "Сырдык сөздөр сүйлөмдүн ортосуна келсе, эки жагына үтүр коюлат: Бейше, баракелде, келтирип иштепсиң!\n" +
                        "Сырдык сөздөр сүйлөмдүн аягына келсе, өзүнөн мурун үтүр, өзүнөн кийин илеп белгиси келет. Мисалы: Бир аз мурда келгенде болмок экен, бах!" +
                        "Сырдык сөздөр кайталанып айтылса, арасына дефис коюлат. Мисалы: Пай-пай-пай, салган экен үйдү. Өш-өш, түбө- түбө.\n" +
                        "\nТууранды сөздөр. Тууранды сөздөр адабий тилибизде кеңири колдонулуп, сөздөрүбүзгө кооздук, тактык маанини берет. Айрыкча кыргыздын төл сөздөрүндө тууранды сөздөр көп кездешет.\n" +
                        "Жандуу, жансыз заттардан чыккан үндү, тыбышты, кыймылды, элести, көрүнүштү туурап, окшоштуруп көрсөткөн сөздөрдү тууранды сөздөр дейбиз. Мисалы: Маа-маа деген койдун үнү угулду. Мылтык тарс этти. Жалт-жалт, шыңгыр, калдаң-калдаң, жарк ж. б.\n" +
                        "Тууранды сөздөр тыбыш жана элес тууранды болуп экиге бөлүнөт.\n" +
                        "\nТыбыш тууранды сөздөр. Жандуу, жансыз заттардан чыккан үндү, тыбышты туурап көрсөтөт. Мисалы: Койдун маараганы (маа), уйдун мөөрөгөнү (мөө), мылтыктын тарс-тарс эткени, суунун шылдыраганы, чымчыктын чыйпылдаганы (чыйп-чыйп), күндүн күркүрөгөнү, чөптүн шуудураганы ж. б.\n" +
                        "\nЭлес тууранды сөздөр. Заттардын сырткы кебетесин, кейпин, же заттардын кыймыл-аракетиндеги, сырткы көрүнүшүндөгү айрым бир элести билдирет. Мисалы: Дардаң- дардаң, кыдың-кыдың, кыйтың-кыйтың, багжаң-багжаң, далдаң- далдаң. Солдоюп, сөлдөйүп, каркайып. Бул сөздөр заттын кыймылындагы сырткы көрүнүшүн элестетип көрсөтөт. (Солдоюп кебетесин карасаң ж. б.) Шарт, шып, жылт, жарк, мөлт, чап. Бул сөздөр заттардын кыймылындагы болгон тездикти элестеп көрсөтөт (Көздүн жашы мөлт эле дей түштү).\n" +
                        "Тууранды сөздөр жөнөкөй, татаал болуп экиге бө-лүнөт.\n" +
                        "\nЖөнөкөй тууранды сөздөр бир гана сөздөн турат да, дайыма өт, де деген жардамчы этиш сөздөр аркылуу айтылат. Мисалы: Алыстан от жылт этти. Мылтыктын үнү тарс дегенде, анын жүрөгү болк дей түштү.\n" +
                        "\nТатаал тууранды сөздөр. Эки же андан көп сөздөрдөн түзүлөт. Мисалы: Алыста мелт-мелт эткен –Ысык-Көл. Кыдың- кыдың торпогум. Асманда чагылган жарк-жарк этти.\n" +
                        "\n\n\nТууранды сөздөрдүн түзүлүшү, колдонулушу жана жазылышы.\n\n" +
                        "Зат атооч сөздөр менен бирге айтылган тууранды сөздөр ал заттын сын-сыпатын, белгисин билдирет да, сүйлөмдө айкындоочтук милдетти аткарат. Мисалы: Далдактаган тетиги жоруну карачы. Тоодон калдыр-кулдур дабыш угулду. Төмөн жактан бак-бак үн чыкты. Күш-күш деп паровоз келип калды (калдыр-күлдүр, бак-бак, күш-күш деген тууранды сөздөр, биринчиден, айкындоочтук милдетти аткарса, экинчиден, өзү жандап турган заттардын сын-сыпатын, белгисин көрсөттү).\n" +
                        "Тууранды сөздөрдөн кийин эт, де деген жардамчы этиштер бирге айтылып, баяндоочтук милдетти аткарат. Мисалы: Мылтыктын үнү тарс-тарс этти. Алыстан от жылт деди. Темир шыңгыр этти (тарс-тарс этти жылт деди, шыңгыр этти – баяндооч).\n" +
                        "Тууранды сөздөр курандылардын жардамы менен этиштен атоочко, атоочтон этишке өтүп айтыла берет.\n" +
                        "\n1) -а, -анда, -да, -ылда мүчөлөрү тууранды атоочторду этишке өткөрөт. Мисалы: -а, аягы р тыбышы менен бүткөн сөздөргө жалганат. Шыңгыр-а, шыңгыра, кылдыр-а, кылдыра. - анда, -ылда мүчөлөр бир муундуу атооч сөздөрдү этишке өткөрөт. Карс + ылда –карсылда, эп + ылда –эпилде, күрс + ылда –күрсүлдө, быш-аңда –бышаңда, кыз-аңда –кызаңда ж.б.\n" +
                        "\n2) -да мүчөсү аягы ң тыбышынан бүткөн атоочторду этишке өткөрөт. Мисалы:Кыбың-да –кыбыңда, кудуң-да –кудуңда, кидиң + да –кидиңде.\n" +
                        "\n3) -алаң, -гай, -чый мүчөлөрү аягы й тыбышы менен бүткен тууранды этиштерди атоочко өткөрөт. Мүчө уланганда уңунун аягындагы й тыбышы түшүп калат. Мисалы: Арбай+алаң - арбалаң, калдай+гай -калдагай, дырдый+гый -дырдыгый.\n" +
                        "\n4) -ган, -ынкы, -гыч, -ган мүчөлөрү аягы й тыбышы менен бүткөн тууранды этиштерди атоочко өткөрөт, бирок мында й тыбышы түшпөйт. Мисалы: калдай+ган –калдайган, дардай+ыңкы –дардайыңкы, калдай+гыч—калдайгыч, барсай+гыч–барсайгыч, далдай+ган –далдайган.\n" +
                        "Аягы к, п тыбыштары менен бүткөн тууранды сөздөргө - ылда мүчөсү уланганда, эки үндүүнүн, ортосунда к, п тыбышы өзгөрбөйт. Бул тууранды сөздөрдөгү айрыкча бир өзгөчөлүк болуп эсептелет. Мисалы: бак+ылда –бакылда, как+ылда – какылда, тап+ылда – тапылда, шып+ылда – шыпылда, чып+ылда – чыпылда.\n" +
                        "Татаал тууранды сөздөрдүн араларына дефис коюлуп жазылат. Мисалы: Шыңгыр-шыңгыр, тарс-турс, карс-курс, күп- күп, дүңгүр-дүңгүр.");
                break;
            case 11:
                openActivityActivityThemes("Тема: Кызматчы сөз түркүмдөрү","Маселелер:\n" +
                        "1. Байламталар.\n" +
                        "2. Бөлүкчөлөр.\n" +
                        "3. Жандоочтор.\n" +
                        "4. Модалдык сөздөр.\n\n" +
                        "1. Кыргыз тилиндеги сөз түркүмдөрүн биз негизги (маани берүүчү), өзгөчө жана кызматчы сөз түркүмдөрү деп бөлүштүргөнбүз. Кызматчы сөз түркүмдорү өз алдынча лесикалык мааниге ээ болбой, сүйлөмдө негизги сөз түркүмдөрүнө кошумча грамматикалык маани тартуулайт. Булар «маани бербөөчү сөз түркүмдөрү» деп да аталат.\n" +
                        "Ошентип, сөз менен сөздү, сүйлөм менен сүйлөмдү байланыштыруу, ийкемдүү тутумдаштыруу милдетин аткарып, кошумча ар түрдүү грамматикалык маанилерди алып келген сөздөрдү кызматчы сөз түркүмдөрү дейбиз. Кыргыз тилинде алар төмөнкүлөр:\n" +
                        "1. Байламталар\n" +
                        "2. Бөлүкчөлөр\n" +
                        "3. Жандоочтор\n" +
                        "4. Модалдык (кыялий - мамиле) сөздөр.\n" +
                        "\n\n\n\t\t\t\t\t\t\t\t\t\t\t\tБайламталар\n\n" +
                        "Сүйлөмдөгү сөздөрдү, сөз айкаштарын жана кошмок сүйлөмдүн тутумундагы жөнөкөй сүйлөмдөрдү бири-бири менен байлашытырып турган кызматчы сөздөр байламталар деп аталат.\n" +
                        "Байламталар, биз жогоруда белгилегендей, маани берүүчү сөздөргө кызмат кылып, өз алдынча лексикалык маани бербейт. Алар ар кандай грамматикалык маанилерди жаратат.\n" +
                        "Кыргыз тилиндеги байламталардын көпчүлүгү лексикалык мааниси бар сөздөрдөн келип чыккан. Мисалы: анткени (андай+эткен+ы), жана (жан+а), себеби (себеп+ы), деле (дагы+эле) ж.б. Байламталардын тутумдук түзүлүшү да өтө ар түрдүү. Алар бир эле сөздөн, эки сөздөн жана бир нече сөздөн да курала берет. Ошондуктан кыргыз тилинде байламталар түзүлүшүнө карай жөнөкөй жана татаал байламталар болуп экиге бөлүнөт.\n" +
                        "Бир эле сөздөн турган байламталарды жөнөкөй байламталар дейбиз. Алар: а, андыктан, анткени, ары, бирок, болбосо, да, дагы, деле, жана, менен, нары, не, ошондуктан, себеби, эгер, эгерде ж.б.\n" +
                        "Эки же андан көп сөздөн турган байламталарды татаал байламталар дейбиз. Алар: ал эми, андай болсо, анткен менен, жана да, же болбосо, кандай ... ошондой, канчалык ... ошончолук, неге десең, ошол себептүү, ошондой болгону менен, ошондой болсо да, ошон үчүн, эгерде ... ошондо ж.б.\n" +
                        "Кыргыз тилинде байламталар аткарган кызматына карай өз ара дагы экиге бөлүнөт. Бир тобу сөз менен сөздү да, сүйлөм менен сүйлөмдү да байланыштыра берет. Башка бир тобу сүйлөм менен сүйлөмдү гана байланыштырып, сөз менен сөздү байланыштырбайт.\n" +
                        "\nа) Сөз менен сөздү да, сүйлөм менен сүйлөмдү да байланыштыруучу байламталар: ары, да, дагы, дале, деле, жана, же, же болбосо, менен ж.б.\n" +
                        "\nб) Сүйлөм менен сүйлөмдү гана байланыштыруучу байламталар: а, ал эми, андай болсо, андыктан, анткени, анткен менен, аның үчүн, бирок, жана да, же болбосо, кандай ... ошондой, канчалык ... ошончолук, ошол себептүү, ошондой болгону менен, ошондой болсо да, ошон үчүн, эгер, эгерде ... ошондо ж.б." +
                        "\n\n\n\nБайламталардын маанисине карай бөлүнүшү\n\n" +
                        "Байламталардын сөз менен сөздү, же сүйлөм менен сүйлөмдү байланыштыра турган мүмкүнчүлүгү алардын грамматикалык мааниси болуп саналат. Мына ошол маанисине карай багындыргыч байламталар жана багындырбас байламталар болуп эки чоң топко бөлүнөт. Анткени, байламталардын бир тобу өздөрү байланыштырган тилдик бирдиктерди бири-бирине көз каранды абалда кармап байланыштырса, экинчи бир тобу байланышып жаткан тилдик бирдиктерди бири-бири менен тең укукта кармап байланыштырат.\n" +
                        "\n\n\n\t\t\t\t\t\t\t\tБагындыргыч байламталар\n\n" +
                        "Кошмок сүйлөмдүн тутумундагы сүйлөмдөрдү бири- биринен кандайдыр деңгээлде көз каранды абалда тутуп байланыштырган байламталар багындыргыч байламталар деп аталат. Алар төмөнкүлөр: андыктан, анткени, кандай ... ошондой, канчалык ... ошончолук, неге десең, ошол себептүү, ошондуктан, ошонун натыйжасында, ошон үчүн, себеби, эгер, эгерде, эмне үчүн десең ж.б.\n" +
                        "Багындыргыч байламталар өздөрү туюндурган маанилик өзгөчөлүктөрүнө жараша андан ары дагы топторго бөлүнөт.\n" +
                        "\nа) Себеп байламталар тутумдашкан сүйлөмдөрдүн бири- бири менен кандайдыр бир ойдун айтылыш же чечилиш себеби аркылуу байланышын камсыз кылат. Буларга андыктан, анткени, неге десең, ошол себептүү, ошонун натыйжасында, ошон үчүн, себеби, эмне үчүн десең сыяктуу байламталар кирет.\n" +
                        "Себеп байламталардын айрымдары (анткени, неге десең, себеби, эмне үчүн десең) багыныңкы сүйлөмдүн баш сүйлөмдөн кийин, айрымдары болсо (андыктан, аның учун, ошол себептүү, ошондуктан) багыныңкы сүйлөмдүн баш сүйлөмдөн мурда келишин талап кылат.\n" +
                        "\nб)Шарттуу байламталар тутумдашкан сүйлөмдөрдүн бири- бири менен кандайдыр бир ойдун макулдашуу, убадалашуу маанилеринде байланышын камсыз кылат. Алар: эгер, эгерде. Булар адатта шарттуу ыңгайдын -са мүчөсү жалганган баяндоочу бар багыныңкы сүйлөмдөрдө колдонулуп, баш сүйлөмдөгү аракеттин аткарылыш шартын билдирет.\n" +
                        "Шарттуу байламталар менен байланышканда багыныңкы сүйлөм баш сүйлөмдөн мурда да, кийин да келе берет.\n" +
                        "\nв)Салыштырма байламталар тутумдашкан сүйлөмдөрдөгү ойдун бири - бири менен салыштырылып, өлчөнүп, ченелип айтылышын түшүндүрөт. Буга кандай ... ошондой, канча ... ошончо, канчалык ... ошончолук деген сыяктуу татаал байламталар кирет.\n" +
                        "\n\n\n\t\t\t\t\t\t\t\tБагындырбас байламталар\n\n" +
                        "Сөз менен сөздү, же сүйлөм менен сүйлөмдү бири-бирине баш ийдирбей, тең укукта кармап байланыштырган байламталар багындырбас байламталар деп аталат.\n" +
                        "Тутумдашкан сөздөрдүн же сүйлөмдөрдүн ортосундагы ой ырааттуулугуна байланыштуу багындырбас байламталар өз ара төмөнкүдөй топторго бөлүнөт:\n" +
                        "\nа) Байланыштыргыч баламталар сөз менен сөздү, же сүйлөм менен сүйлөмдү маанисине карай жай гана байланыштырат. Буга ары, да, дагы, дале, жана, жана да, жана дагы, менен, нары деген байламталар кирет.\n" +
                        "Байланыштыргыч байламталар ар дайым бирөңчөй мүчөлөрдү же тең байланыштагы кошмок сүйлөмдөрдөгү жөнөкөй сүйлөмдөрдү бири-бири менен тутумдаштырат.\n" +
                        "\nб) Каршылагыч байламталар кошмок сүйлөмдөрдүн тутумундагы карама-каршы маанидеги жөнөкөй сүйлөмдөрдү бири-бири менен тутумдаштырат. Каршылагыч байламталарга а, ал эми, андай болсо да, анткени, анткен менен, этсе да, бирок, бирок да, деген менен, ошентсе да, ошондо да, ошондой болгону менен, ошондой болсо да деген сыяктуу байламталар кирет.\n" +
                        "\nв)Божомолдогуч байламталар бири-бири менен тутумдашкан сөздөрдүн, же сүйлөмдөрдүн кайсы биринин гана ишке ашар-ашпасын, ырастыгын, тууралыгын, бар же жок экендигин билдирет. Булар болбосо, же, же болбосо, не деген сыяктуу байламталар.\n" +
                        "\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tЖандоочтор:\n\n" +
                        "Сүйлөмдө атооч сөздөрдү жандап, алардын өз ара карым-\n" +
                        "катышын эпке келтирип, аларга ар кыл грамматикалык маани ыйгарып турган кызматчы сөздөр жандоочтор деп аталат.\n" +
                        "Жандоочтор сүйлөмдө өзү жандап айтылган сөздөрдүн башка сөздөр менен синтаксистик байланышка түшүшүн шарттайт. Кыргыз тилинде гана эмес, дээрлик бардык түрк тилдеринде жандоочтор аркылуу ишке ашкан синтаксистик байланышты башкаруу байланышы катары карап, жандоочтук башкаруу деп аныкташкан. Ошентип, жандоочтор дайыма атооч сөздөрдү жандап жүрүп, алардан кийин келет. Демек, алар жөндөмө мүчөлөрүнүн милдеттери сыяктуу милдет аткарат.\n" +
                        "Кыргыз тилинде жандоочторго аркылуу, ары, башка, баштап, бери, бетер, бойдон, бойлой, бойлоп, бою, боюнча, гана, да, дейре, деле, жараша, жете, жөнүндө, жуук, илгери, караганда, карай, карата, катар, кийин, көздөй, көрө, көрөкчө, менен, мурун, өңдүү, сайын, сөрөй, соң, сымак, сымал, сыңар, сыяктуу, тарта, тууралуу, чакты, чалыш, чамалуу, чамасында, чейин (дейин), шекилде, шекилдүү жана башка сөздөр кирет.\n" +
                        "Жандоочтор табиятына жараша чыныгы жандоочтор жана өтмө жандоочтор (функционалдык жандоочтор) болуп экиге бөлүнөт.\n" +
                        "Чыныгы жандоочторго бетер, боюнча, гана, дейре, деле, жуук, карай, карата, көздөй, өңдүү, сайын, сөрөй, соң, сымак, сымал, сыяктуу, тартып, чакты, чейин деген сыяктуу жандоочтор кирет. Булар ушу турган турпаты менен эле жандоочтор болуп, сөздөрдү сөз түркүмдөргө бөлүштүрүүнүн логикалык (семантикалык) принциби менен эле аныкталып турат. Булардын жандооч экендигин аныктоодо морфологиялык жана синтаксистик принциптер талап кылынбайт.\n" +
                        "Өтмө жандоочторго ары, башка, баштап, бери, да, жараша, илгери, караганда, кийин, менен, мурун деген сыяктуу жандоочтор кирет. Булар тексттеги ойлорго жараша бирде жандооч болсо, бирде башка сөз түркүмдөрдүн бири болуп да келе берет. Булардын жандооч экендигин аныктоодо логикалык (семантикалык) принцип жетишсиз болуп, аларды биз дайыма сөз түркүмдөргө бөлүштүрүүнүн морфологиялык жана синтаксистик принциптеринин жардамы менен аныктайбыз.\n" +
                        "Жандооч сөздөрдүн дээрлик бардыгы тилдин өсүп-өнүгүшү менен бара-бара өз алдынча маани берүүдөн калып, жандоочтук кызматты аткарып калышкан. Мисалы: соңунан басты (затташкан тактооч), соңку жыл (сын атооч), өзүм жалгыз болгон соң (жандооч), иш бүткөн соң барам (жандооч) ж.б.\n" +
                        "Кээ бир жандоочтор этиш сөздөрдөн, кээ бирлери атоочтордон пайда болгон. Этиштерден пайда болгон жандоочтор: сайын, баштап, тартып, карай, бойлой, көздөй, тарта, боло, жараша, карата, көрө ж.б.\n" +
                        "Атоочтордон пайда болгон жандоочтор: ары, бери, аркылуу, тууралуу, шекилдүү, өңдүү, чамалуу, бою, бойдон, боюнча, менен, үчүн ж.б.\n" +
                        "\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tБөлүкчөлөр\n\n" +
                        "Сүйлөмгө, болбосо сүйлөмдөгү кайсы бир сөзгө кошумча грамматикалык маани же маанилик бир касиет алып келүүчү кызматчы сөздөр бөлүкчөлөр деп аталат.\n" +
                        "Кыргыз тилиндеги бөлүкчөлөрдүн бир тобу чыныгы бөлүкчөлөр болот (го, да, өтө, эң, эч, гана, түк, ным, дегеле, турсун, түгүл, турмак, тургай, чылк ж.б.), калган бөлүгү сүйлөмдөгү кызматына, маанисине жараша гана бөлүкчөлөр (өтмө бөлүкчөлөр) болуп эсептелет (аябай, жалаң, гой, деген, белем, такыр, кудум, бейм, нак, как, так, ары, эми, тек, өңкөй ж.б.). Бул акыркы топтогулардын бардыгы тилибизде бөлүкчөлөр болгону менен, алар өздөрүнүн келип чыккан тегин жогото элек, кээде башка бир сөз түркүмүнүн кызматында да болуп калышы мүмкүн. Мисалы: аябай - ая, -ба, -й; гой - кой- (этиш сөз); деген - де-, -ган: белем - -бы, эле, -т ж.б.\n" +
                        "Кыргыз тилинде бөлүкчөлөрдү алардын берген маанилерине жараша бир нече топторго бөлүштүрөбүз.\n" +
                        "\n\n\n\t\t\t\t\t\t\t\t\t\tЧектегич бөлүкчөлөр\n\n" +
                        "Чектегич бөлүкчөлөр кандайдыр бир затты, белгини, касиетти же кыймыл-аракетти башка заттардан, белгилерден, касиеттерден же кыймыл-аракеттен ажыратып, бөлүп, чектеп көрсөтүү маанилерин кошумчалайт. Буга гана, эле деген бөлүкчөлөр кирет.\n" +
                        "\n\n\n\t\t\t\t\t\t\t\t\t\t\t\tКүчөткүч бөлүкчөлөр\n\n" +
                        "Күчөткүч бөлүкчөлөр айкашып келген сөздөргө же өздөрү катышып турган сүйлөмгө күчөтүү, апыртуу, ашыра көрсөтүү маанилерин кошумчалайт. Алар: абдан, аябай, өтө, эң.\n" +
                        "Күчөткүч бөлүкчөлөргө дегеле, дым, жалаң, ным, өңкөй, өңчөй, такыр, түк, чылгый, чылк, чымкый, чым, чымкый деген сыяктуу сөздөр да кирет. Кыргыз тилинде күчөткүч бөлүкчөлөр негизинен сын атоочтор менен тактоочтордун күчөтмө даражасын уюштурат: дегеле сонун, абдан жакшы, абдан жакын, аябай сулуу, аябай эрте, өтө кооз, өтө алыс, эң бийик, эң жакын, чылк алтын, чым кара, чымкый кызыл ж.б.\n\n" +
                        "\n\n\n\t\t\t\t\tАныктагыч-тактагыч бөлүкчөлөр\n\n" +
                        "Аныктагыч-тактагыч бөлүкчөлөр айкашып келген сөздөрдүн же өздөрү катышып турган сүйлөмдүн маанилерине кандайдыр аныктык, тактык белгилер кошумчалайт. Аныктагыч-тактагыч бөлүкчөлөргө да, дагы, дал, дале, кудум, нак деген сыяктуу бөлүкчөлөр кирет.\n" +
                        "Аныктагыч-тактагыч бөлүкчөлөр адатта этиш сөздөр менен айкашып келип, алардын маанилерине кошумча грамматикалык маани ыйгарат.\n" +
                        "\n\n\n\t\t\t\t\t\t\t\t\t\t\t\tТангыч бөлүкчөлөр\n\n" +
                        "Тангыч бөлүкчөлөр айкашып келген сөздөргө же өздөрү катышып турган сүйлөмдөргө айтыла тургун ойду, фактыны тануу, жокко чыгаруу маанилерин кошумчалайт. Буга эч, тургай, турмак, турсун, түгүл өндүү бөлүкчөлөр кирет.\n" +
                        "Эч деген тангыч бөлүкчө сурама ат атоочтор менен кошулуп айтылып, тангыч ат атоочторду уюштурат: эч качан, эч ким, эч нерсе, эч кандай ж.б. Кээ бир сөздөрдө уңгуга кошулуп, биригип да кеткен. Мисалы: эчтеме.\n" +
                        "\n\n\n\t\t\t\t\t\t\t\t\t\t\t\tСурама бөлүкчөлөр\n\n" +
                        "Сурама бөлүкчөлөр айкашып келген сөздөргө же өздөрү катышып турган сүйлөмдөргө суроо маанисин кошумчалайт. Сурама бөлүкчөлөргө ыя, я, ээ деген сөздөр кирет. Булар кээде ээ ыя, го ыя, го ээ деген өз ара айкалыштарда да колдонула берет.\n" +
                        "\n\n\n\t\t\t\t\t\t\t\t\t\t\tЫрастагыч бөлүкчөлөр\n\n" +
                        "Ырастагыч бөлүкчөлөр айкашып келген сөздөрдө же өздөрү катышып турган сүйлөмдөрдө айтылган ойдун, маанинин, фактынын туура же туура эместигин, сүйлөөчүнүн ага макул же макул эмес экендигин билдирет. Буга да, ооба деген бөлүкчө кирет. Мисалы: Ооба, сенин айткандарың туура экен. Контекстке жараша кээде башка бөлүкчөлөр да ырастоо маанисин билдире бериши мүмкүн: Кантсе да уучуң гүлгө толтурар бир ою бар го. (Т.С.).\n" +
                        "\n" +
                        "\n\n\n\t\t\t\t\t\t\t\t\t\tБожомолдогуч бөлүкчөлөр\n\n" +
                        "Божомолдогуч бөлүкчөлөр айкашып келген сөздөрдүн же өздөрү катышып турган сүйлөмдөрдүн маанисинде кандайдыр шек, божомол, күмөн бар экендигин билдирет. Булар бейм, белем, го деген бөлүкчөлөр.\n" +
                        "Божомолдогуч бөлүкчөлөр күмөн мааниси менен бирге суроо маанисин да кошо билдире бериши мүмкүн.\n" +
                        "\n\n\n\t\t\t\t\t\t\t\t\t\t\t\tЖалыныч бөлүкчө\n\n" +
                        "Жалыныч бөлүкчө айкашып келген сөздөрдүн же өздөрү катышып турган сүйлөмдөрдүн маанисине кошумча кандайдыр жалынуу, жагынууну да билдирет. Жалыныч бөлүкчө гой.\n" +
                        "Жалыныч бөлүкчө гой кээде какшык маанисинде да колдонулат: Суусун жок, бара гой, кагылайын... (Т.С.) Анын жалынуу же какшык маанисинде колдонулганы тиешелүү сүйлөмдүн мааниси менен аныкталат.\n" +
                        "\n\n\n\t\tМодалдык (кыялий-мамиле) сөздөр\n\n" +
                        "Сүйлөмдөгү айтылуучу ойдун чындыкка, акыйкатка карата болгон ар түрдүү катышы жөнүндө сүйлөөчүнүн көз карашын туюндурган сөздөр модалдык сөздөр деп аталат.\n" +
                        "Модалдык сөздөр төмөнкүлөр: айтор, албетте, арийне, балким, болжолу, дейм, жарыктык, керек, көрүнөт, кыязы, мүмкүн, окшойт, өңдөнөт, сөзсүз, сыягы, тийиш, чагымда, чамасы, чыгар, чындыгында, шекилдүү, шекилде, шексиз, ыктымал, ыраматылык, ырас ж.б.\n" +
                        "Булардын модалдык сөздөр деп аталышынын себеби латын тилинин «модус» (кыргызча жол, ык, амал маанилерин билдирет) деген сөзүнөн келип чыккан. Кыялий-мамиле сөздөрдүн бардыгы модалдык маанилерди, сүйлөөчүнүн кыялындагы айтылар-айтылбас мамилелерди туюндурат.\n" +
                        "Кыргыз тилинде модалдык сөздөр тутумдук түзүлүшү боюнча негизинен маани берүүчү сөз түркүмдөрүнөн келип чыккан сөздөр болуп эсептелет. Айрымдарынын (балким, мүмкүн, айтор, арийне ж.б.) түпкү уңгусу таптакыр таанылбай калган. Айрымдарынын тутумунда түпкү уңгусу даана эле байкалып турат. Мисалы: Болжолу- болжол, -ы (таандык уланды).\n" +
                        "\nЖарыктык - жары-, -ык (этиштен атооч жасоочу куранды), -тык (атооч сөздөрдөн атооч жасоочу куранды).\n" +
                        "\nКөрүнөт - көр-, -ын (өздүк мамиленин мүчөсү), -а (чакчылдын мүчөсү), -т (үчүнчү жактын келер чак маанисиндеги көрсөткүчү).\n" +
                        "\nЧындыгында - чын, -дык (атоочтон атооч жасоочу куранды), -ы (үчүнчү жактын таандык уландысы), -нда (жатыш жөндөмөсүнүн уландысы).\n" +
                        "Кыялий-мамиле сөздөрдү түпкү теги боюнча шарттуу түрдө атооч уңгулуу модалдык сөздөр жана этиш уңгулуу модалдык сөздөр деп экиге бөлөбүз.\n" +
                        "Атооч уңгулуу модалдык сөздөр: болжолу, кыязы, өңдөнөт, сөзсүз, сыягы, чагымда, чындыгында, шексиз, ыраматылык ж.б.\n" +
                        "Этиш уңгулуу модалдык сөздөр: дейм, демек, жарыктык, көрүнөт, окшойт, тийиш, чыгар ж.б.\n" +
                        "Кыялий-мамиле (модалдык) сөздөрдүн маанилери алар катышып турган сүйлөмдүн бүтүндөй алкагын, бүтүндөй ойду камтыйт. Алар сүйлөмдөгү ойдун, тигил же бул кыймыл- аракеттин ишке ашышынын мүмкүндүгүн, ыктымалдыгын, зарылдыгын, ишенимдүүлүгүн, шектүүлүгүн жана ойдун аткарылышына карата ишенгендикти, күмөн санагандыкты, кайсы бир окуянын болгондугунун анык же болжолдуу экендигин билдирет. Мына ушундай маанилик белгилери боюнча модалдык сөздөрдү төмөндөгүдөй топторго бөлүштүрүүгө болот.\n" +
                        "\n1. Ойдун чындыкка дал келүүсүн ырастап, кубаттап билдирүүчү модалдык сөздөр: акыйкатта, албетте, арийне, дурус, сөзсүз, чындыгында, чынында, шексиз, ырас ж.б.\n" +
                        "\n2. Ойдун чындыкка дал келүүсүнө божомол, шектүүлүк, ыктымалдуулук маани берүүчү модалдык сөздөр: балким, болжолу, керек, кыязы, мүмкүн, өңдөнөт, сыягы, сыяктуу, чагымда, шекилдүү ж.б.");
                break;
        }
    }
}
