package com.example.schoollanguage;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;
import android.widget.Button;

import java.util.ArrayList;
import java.util.logging.StreamHandler;

public class Razdel1Activity extends AppCompatActivity implements AdapterRazdel1.OnItemClickListener {
    RecyclerView recyclerView;
    private AdapterRazdel1 adapterRazdel1;
    private ArrayList<ItemTitle> list;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_razdel1);

        recyclerView = findViewById(R.id.recyclerViewRazdel1);
        LinearLayoutManager manager = new LinearLayoutManager(this);

        list = new ArrayList<>();
        list.add(new ItemTitle("Лексикология"));
        list.add(new ItemTitle("Семасиология"));
        list.add(new ItemTitle("Табу жана эвфемизм"));
        list.add(new ItemTitle("Синоним"));
        list.add(new ItemTitle("Омоним"));
        list.add(new ItemTitle("Антоним"));
        list.add(new ItemTitle("Этимология"));
        list.add(new ItemTitle("Фразеология"));
        list.add(new ItemTitle("Терминология"));
        list.add(new ItemTitle("Ономастика"));
        list.add(new ItemTitle("Лексикография"));
        adapterRazdel1 = new AdapterRazdel1(list);
        recyclerView.setLayoutManager(manager);
        recyclerView.setAdapter(adapterRazdel1);
        adapterRazdel1.setOnItemClickListener(Razdel1Activity.this);

    }

    void openSecond(String data) {
        Intent intent = new Intent(Razdel1Activity.this, ActivityThemes.class);
        intent.putExtra("key", data);
        startActivity(intent);
    }
    void openLeksigrophyActivity(String key,String string){
        Intent intent = new Intent(Razdel1Activity.this, LeksikogrophyActivity.class);
        intent.putExtra(key, string);
        startActivity(intent);
    }
    @Override
    public void onItemClick(int position) {
        switch (position) {
            case 0:
                openSecond("\n\nЛЕКСИКОЛОГИЯНЫН ПРЕДМЕТИ, МАКСАТЫ ЖАНА МИЛДЕТТЕРИ\n\n" +
                        "                                                                                             " +
                        "Лексикология – (гректин lexikos – “сөзгө таандык, тийешеси бар” + logos – “илим, маалымат” деген сөзүнөн алынган) тилдин сөздүк курамын, системасын изилдейт.\n" +
                        "Тилдик жана маданий системалар өз ара көп жагынан айырмаланат, ошондой эле жакындашат, демек, адамдын тилине, ой жүгүртүүсүнө, жаратылышты кабылдоосуна жана маданиятына негизделген жалпы түшүнүктүк базисти көрсөтүп турган лексика-семантикалык ар түрдүүлүк кездешет. Бул өз кезегинде тилдеги, бөтөнчө лексикадагы ийкемдүүлүктү жана универсалдуулукту жаратып, сөздүн элдин пикирлешүүсүндө өмүр сүрүшүн шарттайт, улуттук мүнөзүн аныктайт.\n" +
                        "Кыргыз тили - кыргыз элинин улуттук, Кыргыз Республикасынын мамлекеттик тили жана кыргыз калкынын улуттук руханий (духовный) маданиятынын бир түрү (формасы).\n" +
                        "Кыргыз тили теги жана пайда болушу тарыхы жагынан түрк тилдерине (анын күн чыгыш бутагына/канатына) кирет. Ал эми түрк тилдери алтай тилдерине, өз кезегиде алтай тилдери урал-алтай тилдерине кирет.\n" +
                        "Бул тилдерде сүйлөгөн калктар байыркы убакта жана ХХI кылымда да, негизинен Борбордук Азиянын жана Чыгыш Европаны мекендеп турушат.\n" +
                        "Эне тилдеги бардык сөздөрдүн жыйындысы лексика деп аталат, башкача айтканда, лексика бир тилдеги сөздүк курамды билдирет. Лексика деген термин грек тилиндеги “лехiкоs” деген сөзүнөн алынган. Ал кыргызча сөз дегенди билдирет.\n" +
                        "Сөз жөнүндө тил илиминде (айрыкча славянистикада) бир нече теориялык аныктама бар. Алардын айрымдары төмөнкүлөр:\n" +
                        "1. Сөз - бир нерсени туюнткан тыбыштардын комплекси. Бул аныктамага кыргыз тилиндеги айрым фактылар каршы келет. Мисалы, бирок, же, бейм, беле, го деген бир түшүнүктү туюнтпаган сөздөр учурайт жана уу («яд»), ээ («хозяин») деген бир эле тыбыштан турган сөздөр да кезигет.\n" +
                        "2. Сөз - бир маани билдирген тыбыштардын курамы. Мындай учурда бир түшүнүктү сөз эмес, сөздүн тизмеги билдириши да ыктымал. Мисалы, темир жол, тери тон.\n" +
                        "3. Сөз - нерсенин аты же жаратылыштагы кубулуштар менен көрүнүштөрдү (мисалы, бороон, жамгыр, бубак, чагылган ) билдирген тилдик бирдик. Андай болгон учурда нерсенин атын, жаратылыштын кубулуштарын жана көрүнүштөрүн туюнтпаган же, эле, анткени, айтмакчы, баса деген сөздөрдү кантебиз?\n" +
                        "Ошентип, биз сөз тууралуу жогорудагы аныктамаларды жана жалпы эле сөздүн кыргыз тилиндеги табиятына таянып туруп, төмөндөгүдөй аныктаманы сунуш кылабыз.\n" +
                        "Тилдеги өз алдынча мааниге ээ болгон, бир түшүнүктү туюнткан же өз алдынча колдонулган эң кичинекей лингвистикалык бирдик - сөз. Өз кезегинде сөз эң кичинекей бөлүкчөдөн (бөлүкчөлөрдөн) же тыбыштардан турат.");
                break;
            case 1:
                openSecond("          \n\nСЕМАСИОЛОГИЯ\n\n" +
                        "Дүйнөлүк тилчилер өздөрүнүн лингвистикалык изилдөөлөрүндө (бөтөнчө XX кылымдын орто ченинен тартып) жаратылышты таанып-билүүдө кишинин акыл-эсинде логикалуулуктун ырааттуулугунун алкагында сөздөр психологиялык системада глабалдуу орунда турарын сезишкен. Ошондон улам лексикалык кызматты (функцияны) бөлүп көрсөтүшкөн. Ушундай эле абалды азыркы кыргыз тилинин лексикасы тууралуу эле айтууга болот. Натыйжада семасиологиянын алкагынаноруналгансөзмаанилери,алардын бөлүнүш типтери кызыгууну жаратат.\n" +
                        "Эне тилдин сөздүк курамындагы ар бир сөздүн грамматикалык жана лексика-семантикалык мааниси болот. Булар сөздөрдү өз ара андан ары бөлүштүрүүдө өзөктүү категориялардан болуп саналат (Дагы эмгегибиздин “Сөзгө лексикалык талдоо” деген бөлүкчөсүн караңыз).\n" +
                        "Сөздүн (лексикалык бирдиктин) өзүчө жеке турганда да, сүйлөм курамында да лингвистикалык алкакта өмүр сүрүшүнүн алгачкы, өзөктүк белгиси – семантикасы (мааниси). Ошондон улам (дагы башка белгилердин негизинде) сөздүн лексикалык маанисине биринчилерден болуп назар ташталат.\n" +
                        "          \n\nСӨЗДҮН ЛЕКСИКА - СЕМАНТИКАЛЫК МААНИСИ\n\n" +
                        "Кишинин аң-сезиминин натыйжасында бул же тигил зат (нерсе) тууралуу заттык түшүнүктүн жаралышы жана калыптанышы же денотация аракети. Демек, кишинин акылына чагылган көрүнүштүн пайда болушу сөздүн семантикасын жаратат да, ошону кармат турат.\n" +
                        "Кишинин таанып-билүү аракети зат, окуя (кубулуш) жөнүндөгү түшүнүгүнүн шарттуу белгиси болгондуктан, пикирлешүү процессинде байкалып-байкалбаган боёкчолорду жаратат. Мунун өзү сөздүн лексика- семантикалык маанисин пайда кылат да, жашай баштайт. Мындан (акырындап) семантикалык мааниде улуттук менталлитеттин бүлбүлдөгөн учкуну уялап, сөздүн семантикалык маанисине туруктуулук алып келет да, ар кандай кырдаалга жараша өзгөрүп турушун шарттайт, ийкемдүүлүк жаратат. Мисалы: мүчө, уюл, саат.\n" +
                        "Эне тилдин сөздүк составындагы ар бир сөздүн негизинен (семантикалык) лексикалык жана грамматикалык мааниси болот. Аз сандагы гана сөздөрдө, айталы, кызматчы сөздөрдө грамматикалык маани болуп, лексика- семантикалык маани болбошу ыктымал.\n" +
                        "         \n\nСӨЗДҮН ГРАММАТИКАЛЫК МААНИСИ\n\n" +
                        "Тилдеги сөздөрдүн дагы бир олуттуу жагы, алардагы грамматикалык маани. Грамматикалык маани улуттук тилдин тыбыштык турпатынан (формасынан) калыптанган, коммуникативдик каражаттардын кыртышында жашаган, сөздөрдүн абстракциялык көрүнүшүнүн алкагындагы калыптанган" +
                        "көрүнүш.\n" +
                        "Ар бир сөз өзүнчө жеке турганда да, сүйлөмдүн тутумунда турганда да\n" +
                        "лексикалык жана грамматикалык маани билдирет. Буга ырыстын алды – ынтымак жана аңгемебиз көпкө созулбаса да, натыйжалуу болду деген сүйлөмдөрдөгү сөздөрдү өзүнчө ар бирин бөлүп да, сүйлөмдүн тизмегинде тургандагы абалында да талдоого болот. Мисалы, ырыс – жыргал, таалай, бакыт деген сөздөргө синоним, бул анын лексикалык мааниси. Ырыс эмне деген суроого жооп берет, демек, зат атооч – бул анын грамматикалык мааниси. Алды деген сөз жемиши, натыйжасы деген сөздөргө синоним, бул анын лексикалык мааниси. Заттын арты, асты, үстү, айланасына байланышкан абалга карата колдонулат да, эмнеси деген суроого жооп берет, демек, тактооч болуп саналат.\n" +
                        "Экинчи сүйлөмдөгү да деген сөздү ала турган болсок, ал лексикалык маани билдирбейт, бирок байламталык милдет аткарып турат. Бул анын грамматикалык мааниси болуп саналат.\n" +
                        "Сөздүн лексикалык мааниси менен грамматикалык маанилери өз ара тыгыз байланыштуу болот жана алардын логикалык маанисине карата грамматикалык маанисин аныктоого мүмкүндүк түзүлөт. Дал ушул себептен жана сөздүк составда лексикалык маани берген сөздөргө караганда жалаң гана грамматикалык маани менен жашаган сөздөр аз. Сөздөрдүн лексикалык жана грамматикалык маанилерин үйрөнүүдө лексикалык маани берүү жагына айрыкча көңүл бөлүнөт.\n" +
                        "        \n\nСӨЗДҮН КОНТЕКСТТИК ЖАНА ЭМОЦИОНАЛДУУЛУК МААНИЛЕРИ\n\n" +
                        "Кандайдыр бир сөздөрдүн гана ошол курчап турган сөздөрдүн жалпы суммасынын таасиринин негизинде сөздүн башка бир мааниде берилиши же кошумча маани билдириши контексттик маани болуп саналат. Мисалы, Кайра куруунун шарапаты биздин жергенин да көп жагына тийди. Кандай деңгээлде болбосун ачык айтып, түз сүйлөгөнгө бет алдык. Качан депутаттын турпаты кандай болот деп ой бөлүшчү элек. Эми минтип сын берип жатабыз («СК», 25.02.1990, 3-б.). Өткөн шайлоо буга сабак болуп, кимден эмне кеткендигин ойлондурат деген ойдобуз («СК», 25.02.1990, 3-б.). Үгүт үйүндө «көгүлтүр экран» да шайлоочулардын карамагында («СК», 25.02.1990, 3-б.).\n" +
                        "Келтирилген мисалдардагы: 1) «ачык айтып»; 2) «түз сүйлөгөнгө»; 3) «сын берип жатабыз»; 4) «көгүлтүр экран» деген сөздөр (же сөз айкалыштары): 1) эч нерсени жашырбай, бетке айтуу; 2) тартынбай, ийменбей оюн билдирүү; 3) жакшысын-жакшы, жаманын-жаман (же болгонун болгондой) айтуу; 4) сын алгы (телевизор) же андан көрсөтүлүүчү маалыматтар деген маанилерди туюндурду.\n" +
                        "Демейде жөн эле маани берилбей же анчалык назар салынбай сүйлөнгөн сөз же сөздөр ар кандай сүйлөө жагдайына (же речтик жагдайга) байланыштуу күчөтүлүп, өзгөчөлөнтүлүп айтылат, бөлөкчө баяндаганда, андан өзүнүн ички сезимин окурманга жеткирүү үчүн сөздү же сөздөрдү бөтөнчө бөлүп ээликтире" +
                        "(жээликтире), көкүтө эмоцияга малып сүйлөйт. Мындай учурда кадыресе колдонулуп жүргөн сөз (же сөздөр, айрыкча фразеологизм) кишинин сезимине байланыштуу кошумча мааниге ээ болуп, жаңы түс менен сырдалат. Мисалы, Айтса – арманыбыз көп. Айлыбызды иш таппай көчө таптаган жана ышкырыгы таш жарган ондогон жаштарыбыз бар. Алар эмнеге иштебейт? Себебин териштире тургандар кимдер? («СК», 25.02.90, 3-б.).\n" +
                        "Дагы канча олуттуу маселелерге орундуу ой айтсаң, эч ким кой дебейт. Демократия деген – демократия («СК», 25.02.1990, 3-б.). Ошентип, белгиленген маалыматтар сөздүн эмоционалдуулук мааниси жана ушундай кырдаал менен түшүндүрүлөт.\n" +
                        "        \n\nСӨЗДҮН ТҮЗ ЖАНА ӨТМӨ МААНИЛЕРИ\n\n" +
                        "Өтмө маани көбүнчө образдуулук жана эмоционалдуулук менен байланышта болот да наминативдик жана коннотативдик маанилер менен туташып, элестүүлүккө багыт алат. Мисалы: “...Эртең менен “Манас” тоонун көлөкөсү Шекердин өңүрүнө жетип турат. Мына ушунун өзү ар бир адамга тириликтин түбөлүктүүлүгүнүн элесин, дүйнө өз ордунда экен деген кебелбес канаттануу сезимин берет. Талас кырка тоолорунун мына ушул бийиктик чокусунан улуу бабабыз Манас өз жеринин кыйырларына дүрбү салып, кайсыл жактан душман көрүнөт деп, изин чалып турчу экен...” (Ч.Айтматов, 2008, 8- том, 6-7-б.)\n" +
                        "Келтирилген мисалда өңүр сөзү текстте – контекстте наминативдик да, коннотативтик да мааниде - көрүнүш - байкалып турган аймак, түбөлүктүүлүктүн көрөңгөсү маанисинде жана шарттуулук менен чырмалыша берилген.\n" +
                        "***\n" +
                        "Өтмө маанилүүлүк жаралып, жашап кетишине бул же тигил жазуучу-акындын турмуштук түшүнүгүнө кабылдоосунан улам жаралат. Мисалы:\n" +
                        "“Ак чардак” “Таң алдында таттуу махабат,\n" +
                        "Көл толкунун улам каратат. Дал ошондо күүлөп канатын, Кийген өңдүү аппак халатын. Ойкут да, кайкыйт Ак чардак.\n" +
                        "Көл жээгинен көөлгүп күн чыгат, Келбөөчүдөй кайра жай сызат. Бирок менин махабатым, Айланчыктап артта калат.\n" +
                        "жараша болуп, өздүк-өзүмдүк (Сөзүн, обонун жазган – А.Корообаев)" +
                        "                        Көрүнө да калса Ак чардак.\n" +
                        "Көл түбүндө сүзөт Ак чарбак,\n" +
                        "Көл үстүндө сүзөт Ак чардак. Арасынан таппай өзүңдү, Кайдасың, ай, сүйгөн Ак чардак?!”\n" +
                        "Мында автордун берейин деген оюунун көркөм жана образдуу (ошондой эле жеткиликтүү) болушуна ойдун өзөгү ак чардак кушу, анын ак чабак аркылуу кубулжуп берилип жатат.\n" +
                        "(“Обон” газетасы, 2009, декабрь, 8-бет.). Образдуулук - өтмө маани көркөм чыгармаларда, алардын ичинен поэзияда арбын учурайт. Мисалы: Жакшы адамды сөз ээрчийт, жаман\n" +
                        "адамды чөп ээрчийт (эл макалы).\n" +
                        "Мында макалдын сюжеттик өзөгүндө сөз, чөп ээрчийт деген сөз курамы\n" +
                        "турат да, ойдун образдуулугуна өбөлгө (түзүп) болуп турат.\n" +
                        "Сөздүн лексикалык мааниси катып калган же ар качандан бир качан\n" +
                        "өзгөрбөй турган туруктуу көрүнүш эмес, ал дагы ар кандай шартка жараша өзгөрүлүп - өнүп турат. Башкача айтканда, элдин аң-сезиминин өсүшүнө, айлана-чөйрөгө (табигатка) карата болгон көз-карашына, жашоо-турмуштун өзгөрүшүнө, ошондой эле тилдик составдагы сөздөрдүн өз ара көп кырдуу байланышына, таасирине ылайык сөздүн лексикалык мааниси өзгөрүүдө болот.\n" +
                        "Чындыктагы реалдуу көрүнүш менен сөздүн угулушунун ортосундагы катыш сөздүн маанисин түзгөндүктөн, сөздүн түз мааниси деп сөздөрдүн объективдүү чындыктагы кубулуштарга тике багытталган жана аларды билдирүү үчүн колдонулган лексикалык маанисин айтабыз. Сөздүн дал ушул түз маанисинин негизинде (алгачкы маңызынын базасында) дагы бир кошумча маани пайда болот, бул сөздүн өтмө мааниси болот. Мисалы, «Мезгил жебеси көзгө илешпейт» («СК», 25. 02. 1990, 1-б.) – убакыт ушунчалык тез өтүп жатат деген мааниде.\n" +
                        "Сөздүн өтмө мааниси көркөм текстке анализ жүргүзүү, бөтөнчө фоно- морфологиялык кубулуштар, стилистикалык көрүнүштөр менен чырмалышып, көрөңгөлүү угуту Чыгыш поэзиясына барып жалгашат да, сөз маанилеринин мухитине, кыртышына сиңип кетет.\n" +
                        "        \n\nСӨЗДҮН КОНКРЕТТҮҮ ЖАНА АБСТРАКТУУ МААНИЛЕРИ\n\n" +
                        "Эне тилдин сөздүк жыйынындагы сөздөрдүн берген маанилери кишиге туюмдуулугу жагынан ар кандай болот. Мисалы, үй, саат, жол, чач, көйнөк, карагат, көз, төө, көл, арык, кымыздык деген сөздөр заттык конкреттүү маанини билдирет, башкача айтканда, аларды сезүү органдары аркылуу кабылдап туюнууга мүмкүн. Мындай сөздөрдүн жалпы тобу конкреттүү маанини билдирген сөздөр деп аталат. Келтирилген мисалдардагы сөздөрдүнконкреттүү, так маанилери менен бирге жалпылагыч (абстрактуу) маанилери да бар. Мисалы, саат деген сөз конкреттүү бир саатты эмес, жалпы эле саат аттуунун бардыгына колдонулуп жатат. Чындыгында саат: чоң-кичине, жаңы – эски, кол саат, дубалга асма саат, кумдуу саат сыяктуу дагы башка топторго ажырайт.\n" +
                        "Ошентип, сөздүн атоо кызматы, түшүнүгү болуу менен бирге бир эле учурда конкреттүү, так жана жалпылагыч, абстрактуу маани дагы мүнөздүү болуп саналат. Демек, мындан адамдар нерселерге, көрүнүштөргө, кубулуштарга так ат берип атоо менен аларга жалпылоочу, абстракциялоочу аттарды да беришкен. Бул өзү кишилердин ойлоо сезиминде түшүнүктү пайда кылышкан.\n" +
                        "Кыскасы, лексикология үчүн сөздөрдүн конкреттүү атынан башка да анын жалпылоочулук, абстракциялык маанисин билүү да олуттуу, анткени тилдеги сөздөрдүн түшүнүк берүү касиети болбосо, анда ал байланыш куралынын кызматын аткара албай калат болчу. Ошол себептен тилдеги түшүнүк, маани жана абстракция чоң касиетке ээ.\n" +
                        "Жаштык, жыргал (жыргализм), тилек, үмүт, күч, сана, келечек, окуу\n" +
                        "сыяктуу сөздөр адамдын акыл-сезиминде жалпыланган, акыл-эстин күчү менен гана түшүнүүгө мүмкүн болгон сөздөр. Алар абстрактуу маанидеги сөздөр болуп саналат.\n" +
                        "Сөздөрдүн конкреттүү жана абстрактуу маанилери (ошондой эле лексикалык жана оошмо маанилери да) бири-бирине тыгыз байланыштуу келип, өз ара уюмдашып, ошол эле учурда диффузиялык касиетке ээ (бөлүнүп- чачыроо касиетине ээ болот). Дал ушул себептен айрым учурда сөздүн кайсы мааниси баштапкы, кайсы мааниси чачырап чыккандагысы экендигин аныктоо бир топ кыйынчылыкка турат. Бирок практикада алар анчалык кыйындык туудурбайт.\n" +
                        "        \n\nСӨЗДҮН ЖЕКЕ ЖАНА КӨП МААНИЛҮҮЛҮГҮ\n\n" +
                        "Эне тилибиздеги сөз менен маани (туюндурган мааниси) бири-бирине тутумдаш, уюмдаш келет жана маани бериши жагынан сөздөр ар түрдүү учурайт. Мисалы: токту, тайлак, комуз, обо, бал, түнт, мунарык деген сөздөр негизинен бир эле маани берип турат. Алар тил илиминде жеке маанилүү (же моносемия) деп аталат. Ал эми кээ бир сөздөр кош маанидеги ат катары да колдонулат. Мисалы, чай десек: кайнатылып, ичине чай салынып ичүүгө даяр болгонун да, чайдын кайнаган сууга салууга даяр кургак массасын да айта беребиз. Ошондой эле көрүнүшкө алма, өрүк, жаңгак, жүзүм деген сөздөрдү кошууга болот, башкача айтканда, бул сөздөр ошол жемиштердин дарагын да, мөмөсүн (ашын) да туюнтат.\n" +
                        "Дүйнө элдеринин, ошондой эле түрк, анын ичинде кыргыз тилинде көпчүлүк сөздөр кеңири жана көп мааниде колдонулат. Өз кезегинде ал маанилер ич ара байланышта, карым-катышта болуп, баштапкы маанисинен кийинки маани чачырап, ажырап чыгат. Сөздөрдөгү бул көрүнүш көп маанилүүлүк же полисемия деп аталат. Сөздүн көп маанилүүлүгүнө мисал" +
                        "келтирүү үчүн «Кыргыз тилинин түшүндүрмө сөздүгүнө» (1984-жылы «Мектеп» басмасынан жарык көргөн 1-томуна), андагы «Кашка» (442-бет), «Ал» (57-58-беттер), «Кара» (468-470-беттер) деген сөздөргө токтолобуз.\n" +
                        "Кашка (442-бетте): 1. Боздоо, зарланып каттуу ыйлоо: Көзүнүн жашын көл кылып, какшап ыйлап боздоду («Мендирман»).\n" +
                        "2. Тынбай сүйлөй берүү, безенип ырдоо, безилдөө: Какшасам күн-түн үн салып, койду аны ким тыңдап? (Бөкөмбаев).\n" +
                        "3. Катуу үшүү, муздоо: Суусамырдын суусун көрдүң беле, апа? Тим эле муздагынан мээ какшайт (Байтемиров).\n" +
                        "4. Сыздап ооруу, зыркыроо: Колу-бутум какшап ооруп, шишип кетти («Кыргызстан аялдары»). Ошондой эле ушул сөз катышкан төмөндөгүдөй сөз айкаштары жана фразеологиялык бирдиктер берилген: какылдап-какшоо бир нерсе жөнүндө безилдеп, кайра-кайра какшап айта берүү: Кемчиликтерди жоелу деп, какылдап-какшап айтып келе жатам (Убукеев). Кан какшоо – 1) какшана берүү, кайра-кайра айтып какшай берүү: Энеси машинага чыгып: «Тарастан айрылба!» деп ыйлап, Ленага кан какшап айткан (Баялинов); 2) Зарлаган кейиштүү абалда болуу, зар кагуу: Кан какшап басмачынын азабынан, Зарлады муңга батып далай бейбак (Шамшиев); 3) зыркырап- сыздап ооруй берүү: Бутум эле кан какшайт. Ошондой эле дагы ушул сөз катышкан зар ыйлоо, зар какшоо, зар кагуу (боздоо, какшап ыйлоо) деген фразеологизмдер кезигет.\n" +
                        "Экинчи мисал ал (57-58-бетте) төмөндөгүчө берилген: Ал I. 1) Адамдын, жаныбарлардын булчуңдарын чыңалтуу менен кыймыл-аракет жасоо жөндөмдүүлүгү; күч, кубат, дарман: - Шаштырба, баатыр, шаштырба, кемпирдин баскан алы ушул (Сыдыкбеков).\n" +
                        "2) Абал, шарт, болгон мүмкүндүк: Ушул алымды жолдошторума билгизбейсиңби? (Турусбеков).\n" +
                        "Ал II. 1) (анын, ага, аны, анда, андан) – үчүнчү жакты же тарапты билдирүүчү жактама ат атооч: Ал көргөн жок беле?\n" +
                        "2) Көрсөтүү, шилтөө, белгилөө маанисинде колдонулуучу шилтеме ат атооч: Ал казанга барууга Элемандын сырттаны Эми чыкты камынып («Эр Төштүк»). Ошондой эле ушул сөзгө байланыштуу Ал (же ол) дүйнө деген фразеологиялык бирдик да берилген.\n" +
                        "Ал III. 1) Бир нерсени кол менен кармоо, кармаган абалда болуу; бир нерсени өз тарабына өткөрүү, өзүнүкү кылуу: Ак шайы көйнөк колго алып, булгасаң боло Алымкан (Токтогул).\n" +
                        "2) Илүү, мыкчый кармоо (куштарга карата): Каркылдаган өрдөктү Качырып тийип куш алса («Олжобой менен Кишимжан»).\n" +
                        "3) Почта, телеграф же башка бирөө аркылуу жиберилген нерсени өзүнө тиешелүү кылуу, колуна тийгизүү: Кат алды.\n" +
                        "4) Соодалашуу, алмаштыруу ж.б. жолдор менен сатылуучу нерсеге ээ болуу, менчиктөө: Мал базардан ат алдык.\n" +
                        "5) Бирөөгө үйлөнүү, баш кошуу, жаңы бүлөлүү болуу, бүлө кошулуу: Ашык болуп жүргөнүн Аламын десе башка адам Адамдын көөнү сүйөбү? («Олжобай менен Кишимжан»); Келин алды, аял алды." +
                        "6) Кабылдоо, ишке коюу, белгилүү бир ишти иштөөгө дайындоо:\n" +
                        "Кызматка алды, мугалимдикке алды.\n" +
                        "7) Кызматтан, белгилүү бир иштен түшүрүү, бошотуу: Ишти начарлатып\n" +
                        "жибергендиги үчүн кызматтан алды.\n" +
                        "8) Берилген, туйган нерсесин сезиминде сактоо, сактай билүү; кармап калуу: Эске алды, көңүлгө алды, ойго алды.\n" +
                        "9) Пайда болуу, байкоо: Арпа баш алган кез, Дарактар мөмө алды.\n" +
                        "10) Бирөө же бир нерсе жөнүндө кеп-сөз кылуу, талкуулоо, сураштыруу:\n" +
                        "Тергөөгө алды. Суракка алды.\n" +
                        "11) Кандайдыр бир натыйжага ээ болуу, жетишүү:\n" +
                        "Ар бир койдон 2 килограммдан жүн алды.\n" +
                        "12) Жеңүү, жеңип чыгуу: Аламын жоону деп жүрөм Ар ким мага беттесе\n" +
                        "(«Эр Табылды»).\n" +
                        "13) Кандайдыр бир курал менен чабуу, кесүү, кырып түшүрүү: Устара\n" +
                        "менен чач алды. Сакалын алды.\n" +
                        "14) Бир сандан экинчи бир санды кемитүү, аны тиешелүү бир санга азайтуу: Жыйырмадан жетини алса, он үч калат.\n" +
                        "15) Атооч сөздөр менен айкалыша келген бир катар учурларда ошол айкалышкан сөзүнө байланыштуу болгон абалга өтүүнү, ошондой абалда, көрүнүштө, аракетте ж.б. болууну билдирет: Байыр алды. Тынч алды. Багыт алды. Орун алды.\n" +
                        "16) Жөндөмөдөгү бир катар атооч сөздөр менен айкалышып келген учурларда, ошол сөзгө байланыштуу болгон тынчсыздандыруу, козгоо абалын көрсөтөт: Уйкусун алды, Мазасын алды. Тынчын алды.\n" +
                        "17) Көмөкчү этиштин милдетин аткарып, негизги этиштин натыйжасын чыгарат: Токтосун ашка кетчүү чыгымдарды эртелеп эл-журтунан жыйып алган (Маликов).\n" +
                        "18) Атоочтук формада таандык мүчө менен (алганын, алганың, алганы) заттык мааниде колдонулат: Алганым аман бар бекен? («Ала-Тоо»).\n" +
                        "Ошондой эле ушул сөз катышкан төмөндөгүдөй фразеологизмдер берилген: Көңүлүнө алуу (же оюна алып калуу) – капа болуп калуу, таарынуу; кек сактап калуу. Капарына албоо – көңүл бөлбөө, элес кылбоо, тоотпоо, кабагым – кашым дебөө. Алдын алуу – кырсыкты, ооруну ж.б. болтурбай коюунун же болбосо ырбатып, күчөтүп жибербөөнүн аракетин кылуу, кандайдыр бир иш боюнча күн мурунтан аракет кылуу. Ушул эле сөздүн аягында ушул сөз катышкан дагы төмөнкү фразеологизмдер берилген: Ала качуу, оозуна албоо, кой оозунан чөп албаган, колго алуу, моюнга алуу, тил алуу.\n" +
                        "Ошентип, жогору жакта аталган «Сөздүктөгү» келтирилген какша жана ал деген сөздөргө карата берилген түшүндүрмөлөргө, аныктамаларга маани жактан – ажыратууларга, ошондой эле алардын маани жактан өз ара катышына таянып туруп: сөздүн көп маанилүүлүгү өз ара өтө чиеленишкен көрүнүш экендигин белгилөөгө болот.\n" +
                        "Кыргыз тилинде сөз жасоонун фонетикалык, морфологиялык, аналитикалык деген ыктары бар." +
                        "        \n\nФОНЕТИКАЛЫК ЫКМА\n\n" +
                        "Фонетикалык ыкма (жол) менен жасалышы\n" +
                        "г//б//ж:\n" +
                        "ага – аба – ажа – ч//ж//и: ай+ыр ач+ыл аж+ыра\n" +
                        "Сөз башында: болук (эттүү, салмактуу, семиз; арык эмес), толук.\n" +
                        "***\n" +
                        "Тултук (кишинин денен түзүлүшүн, мүчөсүн сүрөттөөдө,\n" +
                        "сыпаттоодо). Образдуулукту түшүндүрүүдө: бултук. ***\n" +
                        "Чейин\n" +
                        "Дейин – аралык мерчемге, өлчөмгө карата.\n" +
                        "Фоно-морфологиялык абалда: чолок, чолток (кыска, демейдеги\n" +
                        "көрүнүштөн башка).\n" +
                        "Чакыр, бакыр.\n" +
                        "***\n" +
                        "Бакыр, өкүр – этиштик абал-кыймыл: синонимдүү/коннотациялык көрүнүш.\n" +
                        "        \n\nМОРФОЛОГИЯЛЫК ЫКМА\n\n" +
                        "Жаңы сөздөрдүн жасалышында тилде пайда болгон муктаждыкты канаатандыруу үчүн ички грамматикалык мүмкүнчүлүктөр мобилизацияланат. Алардын бири (болгондо да байыркы ыкмалардын бири) – сөздү морфологиялык (структуралык) жагынан өзгөртпөйт эле, жаңы (өтмө) мааниде колдонуу. Бул тил илиминде көп маанилүүлүк же полисемия деп аталат, б.а., айрым сөздөр бир эмес, бир нече лексика-семантикалык мааниге ээ болот.\n" +
                        "        \n\nАНАЛИТИКАЛЫК ЫКМА\n\n" +
                        "Сөздөрдүн сүйлөм тизмегинде өз ара байланышуу эрежелеринин негизинде тизмектешип (ошону менен бирге лексикализацияланып), белгилүү бир түшүнүктү атоо үчүн колдонулат. Бул ыкма сөз жасоонун синтаксистик (б.а., тизмектин ортосунда ажырым болгондуктан) жолу деп аталат.\n" +
                        "Ушул жерде айтып кете турган бир нерсе, дүйнөдөгү тилдерди типологиялык жактан топтоштурууда флексиялануучу тилдердин эң негизгилеринин бири алардын фузия кубулушунун (б.а., мүчө жалганганда уңгунун бузулушунун) мүнөздүүлүгү. Ал эми агглютинациялануучу (мүчөлөнмө же уңгуга мүчөнүн биринин артынан экинчисинин белгилүү бир субардинацияны сактоо менен келе бериши боюнча алсак), аларда фузия кубулушун (көрүнүшүн) айрым гана белгилери байкалат.\n" +
                        "Сөздөрдүн көп маанилүүлүгүн билүү практикалык, тажрыйбалык маселелер менен байланышта экендигин көрөбүз. Өз кезегинде практикалык проблемалар лексикографтардан терең филологиялык билимди, теориялык даярдыкты талап кылат. Сөздүн семантикалык кыртышы агглютинацияланма тилдерде прагматикалык абалдын огунда айланат.\n" +
                        "СӨЗДҮН НОМИНАТИВДИК, КОННОТАТИВДИК МААНИЛЕРИ\n" +
                        "Сөздүн реалдуу орун алышынын (жашашынын) негизги факторлору алардын затты атоо кызматы менен маанинин алчыланышкан өңүтү, нерсенин элеси менен байланышкан шарттуулук туюм. Мисалга жайлоо деген сөздү алсак, кенен аймакты (бөтөнчө мал багууга шарты бар чөлкөмдүү) түшүнөбүз. Бул анын номинативдик мааниси. Ал аймактык багытта (ошондой эле өтмө мааниде) бул жакшы, жыргай турган аймак, кишинин материалдык маданиятынын чордону, очогу катары кабыл алынат. Мындай көрүнүш кишилердин ойлоо сезиминин, андан улам калыптанган түшүнүгүнүн натыйжасы болуп саналат да, лексика-семантикалык туруктуулукту жаратып, коом үчүн кыймылдуу түшүнүктүн алкагын кеңейтип, семантикалык мейкиндикти пайда кылат. Дал ушунун (ушундай көрүнүштөрдүн) коом сыяктуу ар дайыма кыймылда болуп, эволюциялык абалда жашарын билдирет. Мындан сөздүн (ар бир эле сөздүн) кишинин таанып-билүүсүнүн ички-тышкы семантикалык жылышынын алкактык байланышын чиелентет. Мунун өзү сөздүн номинативдик жана коннотативдик маанилеринин лексика- семантикалык талаага (сапарга) алып чыгат.\n" +
                        "Семасиология – сөз маанилеринин изилдегендиктен, ал лексикалык бирдиктин семантикалык өңүтүн, анын сөздүк түшүнүк же түшүнүктү атап берүү (денотат) менен карым-катышын жана сигнификат аркылуу лексикалык кордун (уюткунун) маанилик табиятынын, сөздүн типтеринин семантикалык чынжырланышкан (моносемия, полисемия, экспрессивдүүлүк) жактарына үңүлөт да, анын мезгилдик, мейкиндик тилкеси (талаасы, өзөнү) байкалат. Өз кезегинде мунун баары сөздөгү номинативдик жана коннотативдик маанилердин кыртышына барып такалат.");
                break;
            case 2:
                openSecond("\n\nТАБУ ЖАНА ЭВФЕМИЗМ\n\n" +
                        "Мифтик түшүнүккө, диндик ишенимге, ар кандай ырым-жырымга ишенүүгө, цензуралык тыюу салууга жана орой, осол сөздөрдү сүйлөөдөн оолак болууга байланыштуу пайда болгон жана колдонулган сөздөр табу (же кыргызча тергеме) сөздөр деп аталат.\n" +
                        "Ошондой эле, табынууга, мифологиялык ынанууга байланыштуу затты " +
                        "(же нерсени) өз аты (мурда берилген аты) менен айтпоо жана олдоксон сүйлөп алуудан, чочулоодон, тыюу салынганды айтып албас үчүн жасалган аракеттерден улам пайда болгон, анткени илгерки адамдар (түрктөр, анын ичинде кыргыздар) дүйнөнү кабылдоодо (алардын туюм моделине – үлгүсүнө ылайык) сөздүн маанилик күчүнө, магиялык маанисине өтө ишенишкен. Ушундан улам кыргыздар бөрүнү – карышкыр, аюуну - өтөгөн, чечекти – улуу тумоо, кызамыкты – гүл (же кызылгүл), кызылча, сокурду жана жыланды азиз деп аташкан. Демек, табу – тыюу салынган сөз дегенди туюнтат.\n" +
                        "Ошентип, табу – тарыхый–этнографиялык жана психолингвистикалык (парапсихикалык) категория десе да болуп.\n" +
                        "Табу азыркы мезгилде бир катар тилдерде (мисалы, орус тилинде) дээрлик унут болгон, ошондуктан ал тилдердин азыркы кездеги окуу китептери менен окуу куралдарында бул темага анчалык көңүл бурулбайт. Табу азыркы убакта түрк тилдеринде, анын ичинде кыргыз тилинде аздыр-көптүр жашап жаткан көрүнүш. Бул көрүнүштү күйөөгө чыккан жаш аялзаттын турмушунан, ошого жараша анын кайын туугандарынын, кээде ошондой эле ошол айылдагы күйөөсүнүн жакын туугандарынын өз атынан атабоо – тергеп айтуу салтынан байкайбыз.\n" +
                        "Бул көрүнүш бүгүнкү күндө, кыргыз тил илиминде — кыргыз ономастикасы, анын ичинде кыргыз антропонимикасында демейдеги процесс катары жашап жатат. Аны төмөнкү текст – үлгү далилдейт." +
                        "«\n\nЭМНЕ ДЕП ТЕРГЕЙМ?» ...\n\n" +
                        "«Азыркы келиндердин тергегенин айт».\n" +
                        "Дүкөндөн лезвие таппай жүрүп, Калыгул сапсыйтып сакал коюп алыптыр. Анысы да элдикине окшоп сыйда өссөчү. Тимеле тикчийет. «Элдики жүн да уйпаланып. Вот меники – накта сакал», деп мекчейе калмай жайы бар. Келиндери аны «Кактус аке» деп алышыптыр. Качан көрсөң аялы баштыгын көтөрүп, чай издеп базарда жүрөт. «Чай деген базарда болмок беле, дүкөн кыдырып издебейсиңби», - десең: «Ошо дүкөндөгү чайды таап берчи мага» деп кайра өзүңө асылат. Аны «Чайнворд жеңе» деп алышты.\n" +
                        "Масракун мас болуп келсе эле үйүндөгү чака, чайнегин ыргыта тепмей жайы бар экен. Келиндери аны ырас кана «Футболист аке» деп алышыптыр. Таяк менен койгулабаганына шүгүр. Болбосо «Хоккеист аке» болмок экен.\n" +
                        "Өгүнү Ташмамат тамынын шыйпырын жаап атып кулап түшүптүр. Ооруканадан чыгып келээри менен «Космонавт аке» болду да калды.\n" +
                        "Качан көрсөң директирдин машинесин жууп, тазалап, жүрчү Билаалы деген бригадир бар. Ал болсо «Комплимент аке», кээде «Салфетка аке».\n" +
                        "Бая күнү коңшубуздун келини, биздики менен шыбырашып, шыңкылдашып эле аш үйдө бир топко отуруп калышты. Ичимден: «Ата-а айланайындар, бир жыл көрүшпөгөнсүп тим эле сагынышкансыңар го. Ии, үйдө кемпир жокто чериңерди бир жазышкылачы» - деп төркү үйдө бутту сунуп жата кеттим.\n" +
                        "\uF02D Кечээ «Дефицит аке» келип, мага импортный туфли, «Дон Жуанга» шляпа, «Радиого» индий чай апкелиптир, - деп калды коңшумдуку." +
                        "\uF02D А «Монументкечи», - дейт биздики.\n" +
                        "\uF02D Ага бир пальто алып келген экен, кечке тиктеп туруп: -«Мен эмне балто кийгидей бала белем», - деп койду.\n" +
                        "«Ий, «Дефицит акеси» соодада иштеген кайнагасы го. «Дон Жуаны» өзүнүн күйөөсү болуш керек». Шуулдаган кайран эме, дурус атка конуптурсуң.. Ташмылтыктай тырсылдаган кайненеси бар эле бу да, үбөлүк жутуп алгансып какыя басчу, кайран коңшум сен да келишкен атка ээ болупсуң», - деп көзүмөн жаш чыкканча ыкшып, моокумум кана боорумду тырмап калдым.\n" +
                        "Анан, «атаа – а, кайран келиндерим, мага эмне деп ат койдуңар болду экен. Баягы текшерүүдө коңшумдун огороду меникинен ашык чыгып калып, көп чатакташып жүрүп жарымын кестирип алдым эле». Болду-болбоду «баскынчы аке» же «басмачы аке» дей саласыңар го деп андан ары тыңшап калсам, мени үйдө жок деп ойлоду көрүнөт:\n" +
                        "\uF02D «Баскынчы акем» кайда кетти эле? – деп калса болобу коңшумдуку.\n" +
                        "Биздики да камырабай:\n" +
                        "\uF02D Ал акең «кыргыйдай тийчү чабуулун» пландаштырып жатат төркү бөлмөдө - дейт.\n" +
                        "Кудай өзүң сактай көр, көзүм аңтарылып эле жатып калыптырмын.\n" +
                        "Бир маалда ыргып туруп:\n" +
                        "\uF02D Хайт! - деп бакырып калдым.\n" +
                        "Аш үй тарап тапыр-тупур эле болуп кетти, терезеден карасам экөө тең\n" +
                        "көчөдө безип баратышкан экен.\n" +
                        "Башымды чыгарып:\n" +
                        "\uF02D Ээй, арам гана... - деп, андан ары буларды кандай «тергээримди»\n" +
                        "билбей туруп калдым.\n" +
                        "Жогорудагы «Кыргызстан маданияты» (01.03.1990, 16-бет) жумалыгынан\n" +
                        "алынган «Эмне деп тергейм?» деген макаладагы маалыматтарга караганда, сакалы, муруту алынбай жүрүп өскөн Калыгулду «Кактус аке» дейт, анткени мында адамдын сакалы лезвия жоктуктан көпкө алынбай жүрүп, түз тикчие өскөндүгү себепчи болгон.\n" +
                        "Ал эми чай издеп жүрүп көп кыдырган, бирок чайды таппаган Калыгулдун аялына карата «Чайнворд жеңе» деген ат коюлган.\n" +
                        "Мас болуп келип, үйүндөгү идиштеринин тынчын алган Масракунга «Футболист аке» деген сонун ат берилет.\n" +
                        "Тамын шыйпырлап жатып, үйдүн төбөсүнөн кулап кетип, ооруканага жатып чыккан Ташмаматка келиндер «Космонавт аке» деген ысым ыйгарышат.\n" +
                        "Ар дайыма директорлордун машинасын жууп-тазалап жүргөн Билаалыга «Комплимент аке», «Салфетка аке» деген атактар менен аташат.\n" +
                        "Ошентип, жогорудагы мисалдардан төмөндөгүдөй жыйынтыктарды чыгарабыз. Тергеме сөздөр: биринчиден, кыргыз антропонимиясы менен лексикасындагы сөз жасоонун, энчилүү ат берүүнүн салтка айланган үлгүсү сакталып жатат; экинчиден, табу жолу менен пайда болгон антропонимдер" +
                        "тергөө салтына байланышкан мотивдерди сактоо менен катар, атактардын (орусча прозвище, ылакап аттардын) жасалыш үлгүлөрүнөн да кабарлап турат; үчүнчүдөн, коюлган тергеме аттардын бардыгы турмушубуздагы – кыргыз лексикасындагы интернационалдык лексика менен байланышкан.\n" +
                        "Табу кыргыз тилинде көбүнчө кишинин өмүрүнө коркунуч туудурган катуу, жугуштуу ооруларды айтуудан жана жаныбарлардын аттарын атоолордон байкалат жана ошондой эле балага энчилүү ат коюу салттарынан жана мергенчиликке, кыймыл-аракетти туюнтууга карата айтылган сөздөрдөн сезилет. Жогорудагыдай көрүнүштөрдөн улам кыргыз тилиндеги табу сөздөр төмөндөгүдөй топторго ажыратылат:\n" +
                        "1. Кишинин (көбүнчө жаш баланын) өмүрүнө коркунуч туудурган коркунучтуу, жугуштуу оорулардын аттарына байланыштуу табу (тергеме) сөздөр: чечек деген ооруну – улуу тумоо; чоң кесел; безгек деген ооруну – калтыратма, ысытма.\n" +
                        "2. Оор, жугуштуу жараларга карата айтылган тергеме сөздөр. Мисалы, сыздоок деген сөз – чыйкан, көтү бош деп тергелет.\n" +
                        "3. Жаныбарларга карата кыргыздар аюуну - өтөгөн, бөрүнү - кашабаң, карышкыр, ит куш, улума; жолборсту – шер деп тергешет.\n" +
                        "Кыргыз тилинде табунун үлгүсү катары элибизде айтылып жүргөн, өткөн кылымдын орто ченинде кагаз бетине түшүрүлгөн төмөнкү уламыш мисал болот. Аны келин күйөөсүнө мындай деп айтат: «Шабыраманын ары жагында, шаркыратманын бери жагында, маараманы улума жеп жатат. Сууруманы сууруп ал, жанымага жаный чап». Келтирилген тергемелер мынайча чечмеленет: шабырама – камыш, шаркыратма – суу, маарама – кой, улума – бөрү, суурума – бычак, жаныма – бүлөө.\n" +
                        "4. Кыргыз турмушунда табу антропонимдерде, киши аттарын тергөөдө кеңири колдонулат. Мисалы," +
                        "\n  Эл арасында айтылып жүргөн адамдын энчилүү аты\n" +
                        "1. Кымбатбүбү, Кымбатгүл, Кымбатбек ж.б.\n" +
                        "2. Козубай, Козубек, Козуке, Козугүл, Козутай ж.б.\n" +
                        "3. Арыкбай\n" +
                        "4. Сайра, Сайракан, Сайрагүл ж.б.\n" +
                        " \nАнын тергелиши\n" +
                        "1. Балы (эжем, акем, кайним ж.б.).\n" +
                        "2. Марка, Маркабай (аке, аба, кайним, жездем ж.б.).\n" +
                        "3. Өстөн (тийиштүү тууганчылык термини кошулуп айтылат).\n" +
                        "4. Булбул (эже, эжем ж.б. тууганчылык жана кишинин жаш өзгөчөлүгүнө ылайык сөз жанаша айтылат)." +
                        "\nАдамдын атын тергеп айтуу эмне менен түшүндүрүлөт ?\n" +
                        "Кыргыз тилчи, профессор Карбоз Дыйкановдун пикирине караганда, «Кыргыз элинде улууну урматтоо, кичүүнү кадырлоо себебинен ат тергөө" +
                        "пайда болгон. Ат тергөө менен ошол ысымга уйкаш сөздөрдү да тергешет» (Дыйканов К. Кыргыз тилинин таблицалары. –Фрунзе: Мектеп, 1971. -186- бет).\n" +
                        "Биздин пикирибизче, бул маселе мындайча түшүндүрүлөт: Улууну урматтоонун эң алгачкы түрү жана көчмөндүктүн маданиятынын өлөңдүү формасы.\n" +
                        "Орус тилинде табу: Отдать богу душу, протянуть ноги, скончаться – вместе умереть деген лингвистикалык мисал менен берилет.\n" +
                        "\n\n\nЭВФЕМИЗМ\n\n\n" +
                        "Бул термин грек тилинен euphemismos: eu – жакшы + pheme – сүйлөймүн деген сөздөрүнөн алынган. Бизче орой, одоно кептерди «назик, жумшак, сылык, сыпаа айтамын, жагымдуу сүйлөө» дегенди билдирет да, коом турмушундагы этика (адеп-ахлап) нормалары, адептүү, маданияттуу сүйлөө далалаты менен түшүндүрүлөт. Мисалы, бала төрөбөгөн аялга карата: согончогу канабаган, бала үнүн укпаган, туяксыз как баш, куу баш, жеке макоо, багар-көрөрү жок деген эвфемизмдер – сылык сөздөр колдонулат.\n" +
                        "Кыргыз тилиндеги эвфемизмдер колдонулуш кырдаалына жана азыркы кездеги калыптанган абалына карата: нукура (же өзүнчө, жеке колдонулган) эвфемизмдер жана контексттик эвфемизмдер болуп бөлүнөт.\n" +
                        "Нукура (же накта, нагыз) эвфемизм дегенде эч кандай текстсиз эле мааниси түшүнүктүү болгон, ар дайыма туруктуу колдонулган сылык сөздөрдү айтабыз. Мисалы, жаңыдан күйөөгө чыккан жаш аял затка карата: турмуш курду, турмушка чыкты, баш кошту, күйөөгө чыкты, күйөөгө тийди, күйөөлүү болду, тагдыры бирикти, коломтосунан түтүн булатты, турмуш сапарын улантты (дагы жогорудагыдай эле мааниде, бирок бир аз ороюраак түрүндө: эрге тийди, эрдүү болду деп да айтабыз).\n" +
                        "Ал эми өз алдынча турганда эвфемизм катары колдонулбай, сүйлөм тизмегинде гана сылыктык касиетке ээ болгон сылык сөздөр да учурайт. Буларга көбүнчө индивидуалдык мүнөздөгү (же болбосо айрым авторлордун чыгармаларынан кезиккен) көрүнүшкө ээ. Мисал (акын Барпы Алыкуловдун «Мөлмөлүм» деген ырынан): Эки илебиң ачылган кызыл гүлдөй, Мөлмөлүм. Мында бир эле учурда: салыштыруу, ал аркылуу ойду күчөтүү-оргуштатып, ономастикалык сылыктык-назиктик орун алган. Демек, эвфемизм категориясы орун алып жатат. Бул Чыгыш поэзиясындагы залкар акындардын азаптуу- академиялык ашыктыгы, анын субтропикалык эвфемизми жайгашкан.\n" +
                        "Тематикалык жактан алганда кыргыз тилиндеги эвфемизмдер төмөндөгүдөй топторго ажырайт:\n" +
                        "1. Адамдын мүнөзүнө карата колдонулган эвфемизмдер: жайдары, кичи пейил, ак жүрөк.\n" +
                        "2. Кишинин сырткы көрүнүшүнө карата пайдаланылган эвфемизмдер: болук, эткел, толмоч (бочка, былтыгый, чанач, меш ж.б.).\n" +
                        "3. Кишинин сапатына карай айтылган эвфемизмдер: жылдыздуу, кулагы катуу, каңырыш, бойго жетти ж.б.\n4. Адамдын касиетин баяндоодо колдонулуучу эвфемизмдер: маңдайы жарык, ичкен ашын жерге койгон ж.б.\n" +
                        "5. Психологиялык абалга, эмоционалдык жагдайга карата айтылган эвфемизмдер: табы жок, көзү түштү, жылдызы өчтү, нуру кетти, сынынан ажырады, жакшы көрүп калды, жүрөгүнө түйүп (сактап) жүрөт ж.б.\n" +
                        "Дагы белгилөөчү бир факты, кыргыз тилинде эвфемизмдер көбүнчө поэзияда, анан прозада, драмалык чыгармаларда кеңири кезигет.\n" +
                        "Ошентип, эвфемизмдер речтин (сүйлөнүүчү сөздүн) сылыктыгын, жатыктыгын, эмоционалдуу көркөмдүгүн, эстетикалык даражасын, жагымдуулугун арттырат, чөйрөдөгү ылайыксыз нерселер жөнүндө, ыңгайсыз одоно (же экстремиалдуу) абалдан таттуу сөздөр менен сүйлөп чыгууга, көңүл оорутпоого түрткү берет. Ошол эле учурда автордук-чечендик өнөрүнүн түйүнү да байкалат.\n" +
                        "Орус тилинде эвфемизм: " +
                        "\n" +
                        "1. Он в почтенном возрасте – вместе он стар; " +
                        "\n" +
                        "2. Он пороха не выдувает – вместе он неумен. " +
                        "\n" +
                        "3. Не сочиняйте – вместе не врите деген лингвистикалык мисалдар менен коштолот.\n" +
                        "\n\n\nТабу менен эвфемизмдин окшоштугу жана айырмасы\n\n\n" +
                        "Табу менен эвфемизм сөздөрүнүн мүнөздүү бир өзгөчөлүгү - алар билдирген мааниси жана сөздөрдүн өз ара ширелишип-биригиши боюнча бир жагынан фразеологизмдерге жакындап, синонимдик катарды түзөт. Мисалы, демейдеги, нейтралдык речтеги өлдү деген сөз: О дүйнө (же а дүйнө) кетти, келбес сапарга аттанды, кайтпас сапарга узады, көз жумду, каза тапты, жан (же жаны) таслим болду, дүйнөдөн өттү (же кайтты), ичер суусу, көрөр күнү түгөндү (же бүттү) жана башка сөз айкалыштары, фразеологизмдер менен берилет. Ал эми согуш майданында өлгөн жоокерге карата (жогоруда келтирилген мисалдар менен катар) кара кагаз келди, окко учту, жаздым болду, туулган жердин топурагы буюрбады, киндик каны тамган жерге кайтып келбеди деген дагы бөлөк сөз айкалыштары менен фразеологизмдер колдонулат. Ушул мисалдардан тергеме сөздөр менен сылык сөздөрдүн өз ара ички маанилик жана чыгыш жагынан жакындыгы бар экендигин көрөбүз.\n" +
                        "Демек, табу менен эвфемизмдин дагы кандай айырмасы жана жакындыгы бар деген суроо туулат.\n" +
                        "Айырмасы – биринчиден, чыгышы жагынан, табу мурда, ал эми эвфемизм кийин чыккан деп болжолдонот. Буга кандай далил бар? Жооп: илгери адамдар сөздүн магиялык маанисине (кудуреттүү – күчүнө) абдан катуу ишенишкен. Ал турсун, сөздүн өзүнө өзгөчө бир сыйкырдуу, кереметтүү көрүнүш катары мамиле жасашкан, сөздүн маанисин ант катары карманып, тумар түрүндө сезишкен. Эвфемизм (сылык сөздөр болсо) адамдардын аң-сезиминин жогорку баскычка көтөрүлүп, эстетика-этикалык нормаларынын калыптана баштаган доору менен кошо жаралат.\n" +
                        "Экинчи айырмачылык, табу акырындык менен жоюлуп бара жаткан көрүнүш, ал эми эвфемизм болсо байып, жайылып бара жаткан, күндөлүктурмушта активдүү колдонулган процесс.\n" +
                        "Үчүнчү жагынан, табу тергелген сөздү айтпай, аны башка синонимдер,\n" +
                        "метафора, метонимия, снекдоха жолу менен айтууга түрткү берет, натыйжада тергелип жаткан сөздүн маанисине синонимдеш сөз жаралат. Мисалы, мурда кыргыздар Алтын деген антропонимди Мүрөң (монголчо «алтын», орусча «золото»), Күмүш деген ысымды Мөңгүн (монголчо «жалтырак», орусча «серебро»), Түлкүбай деген адам атын Кыса деп тергешкен.\n" +
                        "Ошентип, мындайча тергөө - тилде негизинен лексикалык синонимдердин жаралышына жол ачат. Ал эми эвфемизм көбүнчө синтаксистик синонимдерди, фразеологизмдердин пайда болушуна себепчи болот.");
                break;
            case 3:
                openSecond("\n\n\nСИНОНИМДЕР\n\n" +
                        "Кыргыз тилиндеги синонимдер жөнүндөгү адабияттарда бир нече аныктамалар бар, алардын ичинен «Кыргыз тилинин синонимдер сөздүгү» (Жапаров, Сейдакматов, 1984, 3-б.) деген эмгекте мындайча жазылган: «Айтылышы ар башка келип, бирдей же бири-бирине жакын түшүнүктү билдирген сөздөр синонимдер» деп аталат. Синонимдердин мүнөздүү белгилери төмөнкүлөр:\n" +
                        "а) семантикасы бирдей түшүнүктү же бири-бирине жакын кубулушту, көрүнүштү, нерселердин, буюмдардын аттарын билдириши;\n" +
                        "б) морфологиялык жактан бир сөз түркүмүнө таандык болушу;\n" +
                        "в) тыбыштык түзүлүшү жана морфемалык куралышы боюнча ар башка болушу;\n" +
                        "г) синтаксистик жагынан бирдей сүйлөм мүчөсүнүн милдетин аткарышы.\n" +
                        "Кыргыз тилиндеги синонимдерге карата айтылган бул төрт аныктамага адам - киши, сакта - корго деген синонимдерди алып, мисалдар менен иллюстрациялайбыз.\n" +
                        "Адам – киши:\n" +
                        "Адам сөзүнөн сынат, уй мүйүзүнөн сынат (макал). Артыбыздан атчан, тебетей кийген кара мурут киши келди («Ала-Тоо»). Келтирилген мисалдардагы адам - киши;\n1) мааниси боюнча бирдей түшүнүктү билдирет; \n2) морфологиялык жактан зат атооч сөз түркүмүнө кирет да, ким? деген суроого жооп берет; \n3) аларды өз ара салыштырганда тыбыштык жана морфемалык түзүлүшү боюнча ар башка; \n4) синтаксистик жагынан келтирилген сүйлөмдө - «Адам сөзүнөн сынат» деген сүйлөмдө «адам» ээлик милдетти аткарып турат, б.а., бул сүйлөмдөгү «адамды» «киши» деген сөз менен алмаштырсак же анын тескерисинче, кийинки сүйлөмдөгү «киши» деген сөздү «адам» менен ооштурсак, сүйлөмдүн мааниси грамматикалык жактан эч кандай (олуттуу) өзгөрүүгө учураган жок.\n" +
                        "Экинчи мисал, сакта - корго.\n" +
                        "Аталары менен улуу агаларынын улуу мурастарын көздүн карегиндей сакташат («Ленинчил жаш»). Өзүлөрүнүн ата журтун көкүрөктөрү менен коргошту («Ленинчил жаш»). Келтирилген мисалдардагы сакта - корго деген синонимдерди талдап көрсөк: \n1) семантикалык (лексикалык же лексика- семантикалык) мааниси боюнча бири-бирине жакын түшүнүктү билдирет; \n2) морфологиялык жактан этиш сөз түркүмүнө кирет да, кыймыл-аракетти билдирип, эмне кылат? кантет? эмне кыл? деген суроолорго жооп берет; \n3) тыбыштык жана морфемалык түзүлүшү жагынан ар башка; \n4) синтаксистик жагынан баяндоочтук милдетти аткарып турат.\n" +
                        "Тилдеги синонимдик маанини ар түрдүү жол менен туюнтууга болот. Мисалга, айт деген сөздү алсак, ага жакын маанини сүйлө - де – баянда деген синонимдер түшүндүрүлөт: Тууган күйдүрүп айтат, душман сүйдүрүп айтат (макал). Ойноп сүйлөсөң да, ойлоп сүйлө (макал). Саламат көрдүң шүгүр де, алыска кеткен уулуңду. Билген - көргөнүңдү эл-журтка баянда («Ленинчил жаш»). Ошондой эле келтирилген лексикалык синонимдердин билдирген маанисин сөз тизмектери менен да туюнтууга болот: сөз сал, кеп сал, сөз айт, кеп айт, сөз кыл, кеп кур, кеп кыл ж.б. Жогорудагы синонимдер билдирген маанисине жакын ойду алтын шилекейиңди чачырат деген фразеологизм да туюнтат. Ал эми какша, безелен, келжире, былжыра деген сөздөр да аталган синонимдерге жакын ойду билдирет, бирок алардын бардыгында (айт-сүйлө- де-баянда деген синонимдерди салыштырганда) кандайча сүйлөнгөндүгү кошо айтылып жатат, ички сезими (эмоция) кошо чагылып жатат. Мына ошондуктан лексикалык синонимдик маани бир сөз менен экинчи сөздүн ортосундагы маанинин бирдейлиги же жакындыгы боюнча аныкталат. Ошол себептен кыргыз тили боюнча түзүлгөн сөздүктө сөз тизмектеринин, б.а., синтаксистик синонимдердин маанилери эмес, сөз менен сөздүн өз ара маанилери, катышы эске алынат жана стилистикалык категория катары көңүл бурулат. Көркөм текстке лингвистикалык иликтөө ишинде назар салынат.\n" +
                        "Сөздөрдүн тилдеги жашап жаткан абалына жана бирдей кырдаалда туруп, биринин ордуна экинчисин алмаштырып айтууга болгон жөндөмдүүлүгүнө, колдонулуш бөтөнчөлүгүнө карай алардын синонимдик катышы аныкталат.\n" +
                        "Бул катыш боюнча алар шарттуу түрдө толук жана жарым жартылай синонимдер болуп ажырайт. Өз кезегинде толук синонимдер (шарттуу түрдө) жакын жана чала (алыс) маанилеш деген топторго бөлүнөт.\n" +
                        "Толук синонимдер өзүнчө турганда да, сүйлөмдүн тутумунда да, сөз айкалыштарында да бирин экинчиси менен толук алмаштыра алат. Мисалы, амал – айла-арга, карма - тут, тез – ылдам – бат – бачым – дароо – чапчаң, ук - тыңша - эшит ж.б.. Мындай синонимдер сөздүн составында анчалык көп эмес. Сөздөрдүн стилдик–эмоционалдык жеке касиеттерине ар бир синонимдин өзүнө таандык кошумча кең жана тар экендигине, жыш (көп) жана сейрек (аз) колдонулушуна жараша бирде жекече турганда да, сөз айкалышынын тутумунда да, сүйлөмдүн тутумунда да бирин экинчиси алмаштыра берүүгө мүмкүн болсо, бирде контексттик абалда гана мындай абалга жетише алат. Алардын дал ушул жагдайына карап чала маанилеш деп аталат.\n" +
                        "Мисалы, чой - соз - кер, чоку - дөбө - дөң, тамак - азык (же азык-түлүк) – аш. Келтирилген чой - соз - кер деген синонимдерде: жипти чой-соз-кер деп, чоюлган - созулган, керилген кыз ж.б. ушундай жагдайларга карата айтабыз. Ал эми ишти чой - соз (создуктуруу, аткарбай эле шылтоолорду айтып жүрө берүү маанисинде) деп айтышыбыз мүмкүн. Ишти кер деп айтпайбыз. Элибиздин сөздүк курамынан, айрыкча географиялык термин жана топоним Бишкек шаарында «Керме-Тоо» деген дүкөндүн атын жолуктурабыз. Бирок чоймо же чоюлма тоо, созмо (же созулма) тоо деп айтпайбыз. Айтпасак да керилип, созулуп, чоюлуп жаткан жапыз тоолор массивин түшүнөбүз. Мындай топтогу синонимдерге жалпылык маани менен жекелик маани болжолдуу түрдө бирдей болот.\n" +
                        "Жогоруда эскерткендей жартылай маанилеш синонимдер алыс жана контексттик синонимдер деген топторго ажырайт да, ушул семантикалык илеби менен жашайт." +
                        "Мисалы, үй курдук, там тургуздук, үй салдык деп айтабыз. Мында кур, сал, тургуз деген сөздөр синоним. Ошондой эле жол курдук, жол салдык деп айтабыз, бирок жол тургуздук деп айтпайбыз. Дагы мисал, килем (чий, таар, тор, өрмөк) токудук – соктук деп айтабыз. Буга салыштырмалуу ат токудум деп айтабыз да, ат соктум деп айтпайбыз. Келтирилген мисалдардан байкалып тургандай, сөздөр өз ара айрым учурда синоним болсо, кээде андай касиетке ээ боло албайт, б.а., алардын синоним же синоним эмес экендиги сүйлөм тизмегинде байкалып турат. Булар кыргыз тил илиминде маанилеш синонимдер деген термин менен аталат. Алыс синонимдердин жалпылык маанисине караганда, жекелик мааниси басымдуулук кылат. Алардын биринин ордуна экинчиси колдонула албай калганы, синонимдик ажыроо чегине жеткендиги болуп саналат.\n" +
                        "Өзүнчө жеке турганда синонимдик мааниси байкалбаган, бирок контекст ичинде (кептин кичинекей бир бөлүгүндө гана) сөздөрдүн өтмө, оошмо жана комбинатордук маанилеринин таасиринде жакындаштырылып алынган, айтылган сөздөр контексттик синонимдер деп аталат. Мисалы, контексттик синоним:\n" +
                        "Элестеп жоодур кезиңди, Эстеймин жылгын кезиңди. Байырлап турбай жаштык кез,\n" +
                        "Бат эле өтөт шекилдүү\n" +
                        "(Б.Сарногоев. Ашуудан берген отчетум. - Фрунзе, Кыргызстан, 1984, 109-б. «Акың жок эрте карууга» деген ырынан).\n" +
                        "Бул куплеттеги жылгын деген сөз бетиңден нуруң чачырап, абдан көркүңө чыгып турган кезиң деген мааниде (б.а., кызгылт түстө болуп чыгуучу, өсүүчү чырпык сыяктуу бадал өсүмдүгүнүн өтмө туютмасында) айтылып, күлгүн - бажырайып ачылган деген сөздөргө ушул ыр саптарынын алкагында – булл контекстте гана синоним болуп жатат да, контексттик маани байкалат.\n" +
                        "Экинчи мисал:\n" +
                        "Бетинде эми мезгил салган чыйыр бар, Улгайдым деп улутунба сулуу жар. Жаш кезинде жалындашып жүрбөйбү, Биз эле эмес, бизден бир топ улуулар\n" +
                        "(Б.Сарногоев. Ашуудан берген отчетум. - Фрунзе: Кыргызстан, 1984, 112-б. – «Өткөндөрдү элестеп» деген ырынан).\n" +
                        "Мында Бетинде эми мезгил салган чыйыр бар деген сап жүзүңдү эми бырыш баскан, карылыктын белгиси байкалган, картайгансың деген мааниде ушул ыр сабында гана, ушул контекстте гана айтылып жатат. Аны карылыгы жеткен, бир топ жашка барган деген ж.б. сөздөр же сөз айкалыштары менен алмаштырып айтууга болот. Дагы мисал, Капсалаңдын кызынын жылдызы жок (оозеки речтен). Бул сүйлөмдөгү жылдызы жок дегенди: өңү серт, сулуу эмес, көрксүз, чырайсыз деген синонимдер алмаштырууга болот жана ал ушул сүйлөмдө гана ушул маанилерди билдирип турат. Көптөгөн кылымдар бою көркөм маданиятын сөз аркылуу өнүктүргөн калктарда (анын ичинде кыргыздарда) контексттик синонимдер ойдун өтө тереңинде жашайт." +
                        "\n\n\n(I) СИНОНИМДИК КАТАР\n\n" +
                        "Мааниси жагынан жакын сөздөрдүн бир кылка катышы синонимдик катар деп аталат. Мисалы:\n" +
                        "- атак-даңк – мартаба – даража – авторитет – аброй – абийир – бедел;\n" +
                        "- жолугушуу – учурашуу – кезигишүү – кездешүү - көрүшүү - жүздөшүү -\n" +
                        "беттешүү;\n" +
                        "- чака – челек – бакыр - көнөк.\n" +
                        "Синонимдик катарды түзгөн сөздөр бир түшүнүктү же бир нерсени туюнтушу боюнча сигнификаттык синонимдер жана денотативдик синонимдер болуп экиге бөлүнөт. Сигнификаттык синонимдер бири-бирине жакын түшунүктү билдирет, бирок ар бир синоним өзүнө таандык боекчосу (мааниси) менен өз катарлашынан айырмаланып турат. Буга жогоруда келтирилген синонимдик катардын ичинен чака – челек – бакыр - көнөк деген бир кылкасына токтолобуз. Булар жалпысынан «суу (дагы башка суюктук) алуучу, ташуучу идиш» деген бир түшүнүктү билдириши менен тутумдашып, катарлашып турат да, төмөнкү белгилери боюнча айырмаланат: чака – металлдан, калайдан, темирден ж.б. катуу заттан жасалганы; челек – жыгачтан жасалганы; көнөк – шириден жасалганы; бакыр – (диалектилерде) каңылтыр (жука темир тунуке) темирден жасалганы. Ошондой эле азыркы учурда пласстмассадан жасалганы (орусча «ведро» деп аталган үй буюмдары да) чака деп аталат.\n" +
                        "Ошентип, көпчүлүк учурда алардын эмнеден жасалганы көңүлгө алынбай, алар бирдей түшүнүктү (азыркы учурда суюктукту, айрыкча суу алуучу, ташуучу, куюучу идишти) туюнтуу үчүн колдонула берет. Кээ бир говорлордо челек, чака деген сөздөр кыргыз адабий тилиндеги чака сөзүнө дал келет жана диалектилик мүнөздөгү синонимдердин берилиши, бир жагынан ушундай жагдай менен да шартталган. Экинчи жагынан синонимдик катар алыстаган сайын анын алгачкы синоним сөзү менен кийинки синонимдик катардагы сөздүн синонимдик касиети жоголот же ыраактап кетет.\n" +
                        "Ал эми денотативдик синоним дегенибиз заттын өзүн туюнткан сөзгө байланыштуу пайда болот. Мисалы, орусча «тазик» деген сөздү кыргыз говорунда тагыра (дагара), лепши (депши, тепши), чылапчын ж.б. аталышы.\n" +
                        "Кыргыз тил илиминде синонимдик уя деген термин колдонулат. Ар бир сөздүн айланасына топтолгон маанилеш сөздөрдүн биримдигине карата айтылат жана бир жагынан толук жана жартылай маанидеги синонимдерге жакын турат. Мисалы, жолдош - курдаш - курбу - курбалдаш - теңтуш - замандаш - дос - сырдаш; жолдош - чоро - нөөкөр - жан жоокер; жолдош - тилектеш - санаалаш." +
                        "\n\n\n(II) СИНОНИМДЕРДИН ПАЙДА БОЛУШУ ЖАНА БАЙЫШЫ\n\n" +
                        "Кыргыз тилиндеги синонимдер төмөндөгүдөй жолдор менен жасалат:\n" +
                        "1. Уңгу түрүндө турган маанилеш төл сөздөрдүн катышынан: бут - аяк, кек - өч, кекеч - сакоо - чүчүк, иш - кызмат - жумуш.\n" +
                        "2. Метатезалык көрүнүштөгү сөздөрдүн маанилеш катышынан: кыс - сык, чыкыр - кычыр. Бул көрүнүш сөз маанисинин кеңейишинин эң байыркы ыгы болуп саналат.\n" +
                        "3. Сөз жасоочу мүчөлөр аркылуу:\n" +
                        "а) бир уңгудагы маанилеш мүчөлөрдүн жалгануусу менен: -лык жана - чылык: жоктук - жокчулук, эсендик - эсенчилик, жолдоштук - жолдошчулук;\n" +
                        "б) -сыз мүчөсүнүн, -бей префиксинин жалгануусу менен: күнөөсүз - бейкүнөө; камсыз - бейкам, капарсыз - бейкапар;\n" +
                        "в) -чы жана -кер мүчөлөрүнүн жалгануусу менен: кызматчы - кызматкер, пактачы - пактакер;\n" +
                        "г) ар башка уңгуларга бирдей мүчөлөрдүн жалгануусу менен.\n" +
                        "-чы: кароолчу - күзөтчү, аңчы - мергенчи, жардамчы - көмөкчү,\n" +
                        "жүргүнчү - жолоочу;\n" +
                        "-чылык: айырмачылык - өзгөчөлүк - бөтөнчөлүк;\n" +
                        "-ыч: кубаныч - сүйүнүч - таяныч - жөлөгүч;\n" +
                        "-лык: кооздук - сулуулук;\n" +
                        "-ла: далдала - калкала;\n" +
                        "-ыш: бурулуш - имерилиш ж.б.\n" +
                        "4. Жергиликтүү диалектилердеги сөздөрдүн маанилик катышынан.\n" +
                        "Мисалы, кыргыз адабий тилинде: жумуртка («яйцо»), уй («корова»), жоолук («платок»), темене («большая шило») – түштүк диалектилерде тукум, сыйыр, оромол, жувалдыз.\n" +
                        "5. Башка тилдерден кабыл алынган сөздөрдүн катышынан: киши (төл сөз) – адам (араб сөзү), көк (төл сөз) – асман (араб сөзү), эс (төл сөз) – акыл (араб сөз), көгүчкөн (төл сөз) – кептер (иран сөзү), токоч (төл сөз) – нан (иран сөзү), ээ (төл сөз) – кожоюн (орус сөзү).\n" +
                        "6. Башка тилдерден кабыл алынган сөздөрдүн өз ара катышынан: шекер (араб сөзү) - кант (араб сөзү), кыш (иран сөзү) – шлакблок (орус сөзү), мугалим (араб сөзү) – педагог (орус сөзү).\n" +
                        "7. Лексикалык бирдик менен фразеологизмдердин айкалышынан: бат - тез - ылдам, дароо - бачым - чапчаң - көз ачып жумганча - бир заматта - алеки заматта - айта - буйта дегиче - каш-кабактын ортосунда.\n" +
                        "8. Лексикалык бирдик менен тергеме (табу), сылык (эвфемизм) сөздөрдүн катышынан: өлдү – курман болду - көз жумду - көзү өттү - дүйнөдөн өттү - дүйнөдөн кайтты – о (же а) дүйнө кетти – келбес сапарга (жолго) аттанды – каза тапты (болду) – жер жазданды – жаны таслим болду – жаны үзүлдү - жүрөгү сокпой калды – жер жазданды ж.б." +
                        "\n\n\nСинонимдердин сөздөрдүн курамына жана түзүлүшүнө карай бөлүнүшү\n\n" +
                        "Уңгу (корк - үрк - чочу, ич - же), туунду же мүчөлүү (тамактан - оокаттан, амандаш - эсендеш - саламдаш), татаал (тыңша - кулак сал, сүйлө - кеп ур - сөз кат) болуп бөлүнөт.\n" +
                        "Таралыш чегине, аймагына (ареалына) карай синонимдер говордук, диалектилик, жалпы элдик – адабий тилдик болуп бөлүнөт.\n" +
                        "Белгилүү бир кичинекей аймакта колдонулган маанилеш сөздөр говордук синонимдер деп аталат. Буга кыргыз тилинин говорундагы айтылган төмөнкү синонимдер мисал болот: элпек (адабий тилде, Лейлек говорунда) – кавлы (Лейлек говорунда), кызык (адабий тилде, Лейлек говорунда) – анайы (Лейлек говорунда), дөңгөч (адабий тилде, Лейлек говорунда) - дөңгөлөк (Лейлек говорунда).\n" +
                        "Говорго салыштырмалуу кеңири, адабий тилге салыштырмалуу тар чөйрөгө тараган маанилеш сөздөр диалектилик синонимдер деп аталат. Буга кыргыз тилинин түштүк диалектилеринде азыркы кездерде колдонулуп жүргөн төмөнкү синонимдер мисал болот. Кыргыз адабий тилинде жана аталган аймактарда колдонулган маанилеш сөздөр: жай – акырын – шашылбай – аста – секин (же аста – секин - соңку асты сызылган синонимдер түштүк диалектилерде, жетим - дарбадар (д∂рб∂д∂р) – кийинки сөз түштүк диалектилерде (ошондой эле бул сөздө кара ниет деген кошумча мааниси бар), жууркан - көрпө (түштүк диалектилер жууркан, төшөк маанисинде), бышык – тың - тетик – чыйрак – мустакам (түштүк диалектилерде). Говордук жана диалектилик синонимдер – тарыхый категория. Алар керегине жараша адабий тилди байытат, дагы бир сөз менен айтканда, адабий тилдин запасы, резерви (фонду, банкы) болуп саналат.\n" +
                        "Ушул жагдайга байланыштуу айтылуучу бир ой, адабий тил өсүп- толукталып бара жаткан көрүнүш болгондуктан, кээде айрым диалектилик көрүнүш менен адабий тилдин толукталып бара жаткан материалдарынын ортосуна чек коюу кыйын болуп калат.\n" +
                        "Жалпыэлгебирдейтарагансинонимдер–жалпы элдик синоним- д е р деп аталат. Мисалы, кадам – арыш - адым, ороо - чулга, ором - түрмөк, ор - чуңкур.\n" +
                        "Адабий тилде говорлор менен диалектилерден же сөздөрдү жаңы мааниде колдонуунун эсебинен пайда болгон, азыркы кыргыз окурманына газета- журнал, үн алгы менен сын алгы жана окум (окуу китептери) менен окума (окуу куралдары) аркылуу кеңири тарап жаткан маанилеш сөздөр да а д а б и й тилдик синонимдер депаталат.Мисалы,ага–аба–аке– байке. Кийинки регионалдык мүнөздөгү аке, байке деген сөздөр, ошондой эле жалпы элде сейрек колдонулуп, Ысык-Көл, Лейлек говорлорунда активдүү айтылган жана элдик оозеки чыгармаларда белгилүү даражада колдонулуп жүргөн аба сөзү азыркы учурда жогорудагы сөздөр менен синонимдик мааниде колдонулууда.\n" +
                        "Оору – дарт – илдет – сыркоо – кесел – ноокас деген синонимдерди ала турган болсок, булардын кесел - ноокас дегендери бирде чектелип колдонулгандыгына карабастан, кийинки мезгилде жогоруда аталган массалык-информациялык каражаттардын жардамы менен адабий тилден орун алууда.\n" +
                        "Келтирилген мисалдарга таянуу менен, адабий тилдин синонимдеринин өзү да тарыхый көрүнүштүн айрым абалын кучагына аларын көрөбүз." +
                        "\n\n\nСинонимдердин сөз түркүмдөрүнө карай бөлүнүшү\n\n" +
                        "Бул багытта кыргыз адабий тилинде дээрлик бардык сөз түркүмдөрү, бөтөнчө зат атоочтук, сын атоочтук, этиштик, тактоочтук синонимдер арбын кезигет. Мисалы, бул-ушул, канча-нече (ат атооч), жакшы-ийги-сонун, жылдыздуу-ажарлуу-сүйкүмдүү-татынакай (сын атооч), сындыр–талкала- бүлдүр, саба-ур-сок-төпөштө (этиш), кубаныч-сүйүнүч-шаттык (зат атооч), баса-айтмакчы (кызматчы сөз).\n" +
                        "Синонимдердин сөз түркүмдөрүнө карай бөлүнүштөрүнө карай токтолгондо дагы бир жагдайды эске алуу зарыл, тактап айтканда, кыргыз тилинде элестүү жана тууранды сөздөр көп. Алар бири экинчисинен бир аз гана семантикалык мааниси боюнча айырмаланат. Ошол себептен алар өзүнчө бир синхрондук катмарды түзүп, сөздөрдүн фонетикалык, орфографиялык жана сөз варианттарына жакын көрүнүштү элестетет. Мисалы, аксай-саксай- үксөй, далдай-делдей, элеңде-тепеңде-чепеңде-жепеңде, мыкчый-тыкчый, мыкчыңда-тыкчыңда ж.б. Бул көрүнүш азыркы учурда кыргыз тил илиминде колго алынып, изилдене элек (эскертүү: Бул багытта профессор С.Кудайбергеновдун «Кыргыз тилиндеги элестүү этиштери» (Фрунзе; Илим, 1981, 81 б.) деген эмгеги менен студент катары да, педагог-окутуучу- окумуштуу катары да таанышуу зарыл).\n" +
                        "\n\n\nСинонимдердин стилдик мааниси жана алардын колдонулушу\n\n" +
                        "Сүйлөгөндө синонимдерди өз ордуна, ыгына ылайык пайдалана билүү – кепти – сүйлөгөн сөздүн көркөмдүгүн арттырат, чечендик бедел жаратат. Ал эми стилистикалык синонимдер белгилүү бир чөйрөдө гана колдонулат. Кыргыз тилинде алар нукура түрүндө сейрек кездешип, көбүнчө экспрессивдик (ойду таамай, так, ошондой эле көркөм сүйлөөгө багытталган) синонимдер менен биригип, жалгашып айтылат. Ошондой болсо да стилистикалык синонимдер нагыз түрдө айтылганы балдар речине таандык болгон жакшы – аяй, жаман – быкый - кых жана тергеп айтылуучу козу - марка, кара - ымырт, аюу - өтөгөн, кенже - марка, бөрү – улума – карышкыр – ит - куш сыяктуу сөздөрдө кездешет.\n" +
                        "Синонимдер эне тилдин стилдик байлыгы болгондуктан, максат аларды өз орду менен пайдалана билүү. Өз кезегинде бул маселе тил маданияты менен тыгыз карым –катышта турат.\n" +
                        "Күндөлүк турмуштагы ар дайыма жыш жана сейрек колдонулуш абалына карай активдүү жана пассивдүү болуп ажырайт. Мисалы, аскер – армия –\n кошун – кол деген синонимдердин биринчилери аскер - армия дегендери активдүү, ал эми кошун - кол дегендери пассивдүү, тарыхый жагдайда пайдаланылат.\n " +
                        "\n\n\nСинонимдерди окутуунун максаты\n\n" +
                        "Синонимдерди окутуу, үйрөтүү иштери студенттердин, окуучулардын түшүнүгүн кеңейтип, өз оюн таамай жана так кыска айтуусуна, сөзүнүн көркөм болушуна, сөз байлыгынын маданияттуу жаралышына шарт түзөт. Синонимдер бир пикирден экинчи пикирдин айырмасын ажыратып же ар бир түшүнүктүн чегин бөлүп, же алардын аз да болсо айырмачылыгын көрсөтүү үчүн эмоционалдуу - көркөм каражат болуп саналып, тил илиминин стилистика бөлүгү менен тыгыз байланышта турат. Өз кезегиндеги эне тилдеги синонимдер азыркы кездеги лексикалык системада аткарган функциясы боюнча ар бир өзүнө тиешелүү орундарга жайгашат. Ошол функциясына жараша: 1) мааниси же системасы боюнча айырмаланган; \n2) экспрессивдүүлүгүнө карай бөтөнчөлөнгөн; \n3) стилистикалык жактан айырмаланган синонимдер болуп үчкө ажырайт. Мааниси же боекчосу- оттенкосу боюнча айырмаланган синонимдерге жогоруда көрсөтүлгөн сигнификативдик (чака-челек-бакыр-көнөк) синонимдер кирет. Ал эми стилистикалык жана экспрессивдик жактан айырмаланган синонимдерге сокур-азиз-көр-олок деген сөдөр кирет, башкача айтканда, тергеп же сылык айтыш үчүн азиз, одоно түрдө кемсинтип сүйлөгөндө көр, орой жана образдуу айтканда сүйлөөчүнүн жеке мамилеси кошо чагылдырылбайт. Ошондуктан ал нейтралдуу (бейтарап) абалда турат.\n" +
                        "Ошентип, кыскартып-корутундулап айтканда, синонимдер көркөм каражат катары окутулат жана изилденет." +
                        "\n\n\nКыргыз тилиндеги синонимдер боюнча изилдөөлөр жана кыргыз тилиндеги синонимдик сөздүктөр\n\n" +
                        "Бул багытта кыргыз тилинде төмөнкүдөй эмгектер жарык көргөн:\n" +
                        "1. Жапаров Ш., Сейдакматов К. Кыргыз тилинин синонимдер сөздүгү – Фрунзе, Илим, 1984, 470 бет (2000 нуска, ошол кездеги баасы 255 тыйын). Бул эмгекте биринчи жолу кыргыз тилинин синонимдери толук, кеңири жана академиялык мүнөздө камтылат. Ар бир синонимдик катарга түшүндүрмө берилип, мисалдар менен шөкөттөлгөн (иллюстрацияланган). Китептин аягында синонимдердин көрсөткүчү (индекси) берилет жана башка керектүү маалыматтар менен жабдылат. Бул сөздүк Кыргызстандан тышкары жерлерге (Кытайга, Германияга) да тарайт. Кытайда – Үрүмчү шаарында синонимдик сөздүк катары кыскача кыскартылган вариант болуп басылып чыгат. Ошондой эле бул китепте 1984-жылга чейинки кыргыз тилинин синонимикасына\n" +
                        "байланыштуу негизги маалыматтар камтылат.");
                break;
            case 4:
                openSecond("\n\n\nОМОНИМДЕР\n\n" +
                        "Омоним гректин homos - “окшош, жакын, бирдей” жана onuma-“ атоо, ат, аталыш” деген создөрүнөн алынган, чечмелеп айтканда, тыбыштык турпаты (түзүлүшү) бирдей, бирок бири - экинчисине мааниси жагынан жакын, кескин айырмаланбаган сөздөрдү (эң кичинекей лексикалык бирдикти) айтабыз. Тыбыштык түзүлүшү бирдей, бирок маанилери ар башка сөздөр омонимдер деп аталат. Бул аныктама мектеп окуучуларынан тартып, атайын омонимдер боюнча изилдөөлөрдө да кеңири колдонулуп жүрөт. Ушундай эле аныктамаларды тектеш тилдерден, ошондой эле орус тилиндеги омонимдерди изилдөөгө, окутууга багытталган китептерден да жолуктурууга болот.\n" +
                        "Чындыгында, окумуштуулар жогорудагы аныктаманын биринчи бөлүгү менен макул болушкан. Ал эми «маанилери ар башка сөздөр» деген аныктама боюнча көп талаш-тартыштар бар. Бирок такталып, жыйынтык чыгарууга мүмкүн болгон корутундулар бар. Биз дал ошолорго токтолобуз.\n" +
                        "\n1. Омонимдер лексикалык мааниси боюнча ар башка, бирок грамматикалык маанилери боюнча андай сапат ээ эмес болот, мындайча айтканда, кийинки белгиси боюнча бүтүндөй бир жалпылыгы бар сөз түркүмүнө таандык сөздөр болот: аба I - (өзүнөн улуу эркек бир тууган); аба II – (атмосфера, аба ырайы)." +
                        "2. Лексикалык маанилеринде байланыш бар экендиги сезилген, бирок грамматикалык маанилери боюнча бири экинчисинен айырмаланып, ар башка сөз түркүмдөрүнө кирген сөздөр болот: ач I - курсагы ач; ач II – эшикти ач; көч I –көч келе жатат; көч – бир жерден экинчи жерге көч.\n" +
                        "Ошентип, грамматикалык маани дегенибиз – сөздүн бул же тигил сөз түркүмүнө тиешелүүлүгүнө, парадигматикалык жана синтагматикалык катыштарына ылайык аныкталуучу жалпыланган маани. Мындай маани жалпы категориялык маани менен жеке грамматикалык маанини өзүнө камтыйт. Ал эми омонимдер болсо жалпы грамматикалык категориялары бирдей сөздөрдөн да, бирдей болбогон сөздөрдөн да түзүлө берет. Мисалы, аңыз I – (жыйналган эгиндин орду); аңыз II – (даңаза сөз); аңыз III – ушак сөз. Мында омонимдердин жалпы грамматикалык категориясы бирдей – үчөө тең заттык түшүнүктү билгизет. Ал эми айт I – (орозо айт); айт II – (сөз айтуу) – мында омонимдердин категориялык маанилери ар башка (бири затты, экинчиси кыймыл-аракетти туюндурду).\n" +
                        "Дагы бир бөлөк аныктамаларда омонимдер мындайча мүнөздөлөт: «Айтылышы жана жазылышы бирдей, бирок маанилери ар башка сөздөр». Бул аныктаманын эң негизги өзгөчөлүгү жана максаты – омонимдердин бирдей жазыла тургандыгын атайы белгилегендигинде турат жана жазуу-сызуунун пайда болушу, өнүгүшү тил каражаттарын оозеки гана эмес, кат жүзүндө да пайдалана билүү мүмкүнчүлүгүнүн зарылдыгын көрсөтөт.\n" +
                        "Дагы бир изилдөөлөр боюнча омонимдерге мындай мүнөздөмө берилет: «Айтылышы боюнча дал келген, формасы жактан бирдей болгон, бирок маанилери боюнча өз ара байланышпаган, б.а., маанилик жалпы элементи болгон сөздөр». Бул аныктаманын максаты менен милдети бир, тактап айтканда, мындай омонимдер менен полисемиянын өз ара айырмасын ачыгыраак белгилөө аракети коюлган. Демек, бирдей форма аркылуу туюндурулган болсо – полисемия деп аталат, эгерде байланыш болбосо – омоним катары каралат. Бул белги (же критерий) боюнча бир тилдин же ар башка тилдердин материалдарынан жасалып (уюшулуп же кабыл алынып), лексикалык маанилери боюнча байланышпаган омонимдерди полисемиядан айырмалоого мүмкүндүк берет. Мисалы: март I – (берешен), март II – (жалган куран же азыркыча үчүнчү март айы); май I – (сары май), май II – (бугу, азыркыча бешинчи айдын аталышы).\n" +
                        "Ошентип, омонимдер жөнүндөгү илимий адабияттардагы пикирлер төмөндөгүчө жыйынтыкталат:\n" +
                        "\n1. Семантикалык жактан гана айырмаланган омонимдер: так I – (такка отуруу), так II – (так түштү); жар I – (сүйгөн жар), жар II – (отунду жар).\n" +
                        "2. Семантикалык да, грамматикалык да айырмачылыгы бар омонимдер: кара I – (жоолугу кара), кара II – (тигини кара); кал I – (оң бетинде калы бар), кал II – (сен ушул жерде кал).\n" +
                        "Дагы башкача айтканда, омоним болуш үчүн төмөнкү белгилер болуш керек:\n" +
                        "\n1. Орфоэпиялык белги (айтылышы бирдей);\n" +
                        "2. Графикалык белги (жазылышы бирдей);" +
                        "3. Семантикалык белги (лексикалык маанилердин кандайдыр бир жалпылыкка ээ болбостугу);\n" +
                        "4. Семантика-грамматикалык белгилер (лексикалык маанилердин арасында кандайдыр бир жалпылык болсо да, алардын ар башка сөз түркүмүнө кириши).\n" +
                        "5. Жогоруда саналып өткөн белгинин кийинки эки пункту тууралуу белгилей турган ой мындай, алгачкы омонимдер семантикалык жактан өз ара тыгыз байланышта болгон. Муну тын I (дыхание, вздох), тын II – (дышать, отдыхать, остановливаться, прекращаться) деген мисалдар менен бекемдөөгө болот. Ал эми лексика-грамматикалык маанилеринин кийинчирээк пайда болушу – сөздүн лексикалык маанисинин мурда пайда болгондугун, анан грамматикалык маани жаралгандыгын жана сөздөрдүн ички туюм (эмоционалдык) маанилеринин боло тургандыгы, ошондой эле жалаң грамматикалык мааниде жашаган сөздөрдүн болушу көңүлгө тутулат.\n" +
                        "Омонимдердин табиятын аныктап, мүнөздүү белгисин көрсөтүүдөгү дагы бир татаал, бөтөнчө олуттуу мааниге ээ болгон маселелердин бири – алардын көп маанилүүлүк (полисемия) менен катышын ажырата билүү. Ал үчүн төмөнкүлөрдү эске алуу зарыл.\n" +
                        "\n1. Байланышкан маанилердин бир сөз түркүмүнө же ар башка сөз түркүмүнө тиешелүү экендиги. Мындайча айтканда, омонимдик маанидеги сөздөр бир сөз түркүмүнүн чегинде турса – анда ал полисемия, ар башка сөз түркүмүнө туура келсе – анда ал омоним, анткени ар башка сөз түркүмүнүн жалпы категориялык маанилери бир сөздүн чегине сыйбайт.\n" +
                        "2. Парадигматикалык жактан ар башка сапатка ээ болсо, анда омоним, эгерде андай көрүнүшкө ээ болбосо – полисемия: -ыш: барыш (жөндөмө), -ыш (иштеш, бирге иштеш).\n" +
                        "3. Алардын синтагматикалык көрүнүшүн да эске алуу керек." +
                        "\n\n\nОмонимдердин пайда болушу жана түрлөрү\n\n" +
                        "Кыргыз тилинде омонимдер төмөнкүчө пайда болот:" +
                        "\n1. Төл сөздөрдөн алардын тыбыштык өзгөрүшүнөн же деформациясынан пайда болгон омонимдер: бек I - (бектин буйругу, титулатуралык термин), бек II - (бек, катуу, чың, чыйрак, киши); ээ I - (сырдык сөз),ээII–эге,кожоюн;атI-(жылкы),атII- (ысым-<ад);аякI–(кесе, идиш), аяк II – (< адак, бут).\n" +
                        "2. Полисемиянын (көп маанилүүлүктүн) өнүгүшүнөн сөздөрдүн айрым маанилеринин өз ара байланышы үзүлүп же биротоло алыстап кетишинен (же конверсия процессинин натыйжасында) пайда болгон омонимдер: көк I - (түс, көк асман, сын атооч), көк II - (чөп, көк чыкты, зат атооч), көк III (көк мүнөз, көк мелтей, зат атооч); кош I - (атты арабага кош, этиш), кош II - (кош колдуу, кош колдоп, кош ооз, сын атооч), кош III - (бирди экиге кош, этиш). Омонимдердин пайда болушундагы бул жол (ык) эң байыркы жана өтө туруктуу белги деп эсептелет.\n" +
                        "3. Төл сөз менен кабыл алынган сөздөрдөн пайда болгон омонимдер: айран I - (сүт азыгы, кыргызча), айран II - (айран калуу, арабча hейран); бал I (кыргызча, аары жыйнаган азык), бал II - (арабча фал: бал ачуу, бал көрүү, бал китеп), бал III - (орусча, бийлеп көңүл ача турган оюн-зоок).\n" +
                        "4. Кабыл алынган сөздөрдөн пайда болгон омонимдер: абал I - (арабча, мурда, илгери), абал II - (арабча ал-жайы, ал-абалы); баян I - (арабча - баяндоо, баяндап берүү), баян II - (орусча, баянда, музыкалык аспапта ойноо).");
                break;
            case 5:
                openSecond("\n\n\nАНТОНИМДЕР\n\n" +
                        "Антоним (гpектин anti – “каршы, тескери/теңирден тетири, onyma – “ат, аталыш, атоо”) – сөздөрдүн маанилеринин мамилелик тетирилиги, поляризациялуулугу менен ажырымдалып, бир сөз түркүмүнө кирет да, жуп- жубу менен керектелет: жыргал-куурал, дос-душман, батыш-чыгыш, ичкери- сырткары, арык-семиз, бай-кедей, өзөн-аска, терең-тайыз, орой-сылык, сулуу- серт ж .б.\n" +
                        "Антонимдер дегенде алардын ортосундагы абсолюттук тескеричилик тууралуу эмес, шарттуулук (карама-каршылык) жалгашып жашарын, колдонууларын ойго тутуу оң болот же алар бирин экинчиси жокко чыгарат деген түшүнүк калыптанбас керек.\n" +
                        "Антонимдер түзүлүш курамына, тыбыштык турпатына карай: түрдүү\n" +
                        "уңгулуу антонимдер (же алар карама–каршы мааниде колдонулган уңгулуу) жана морфологиялык жактан тубаса жана туунду түрүндө учурайт: урматта- кордо, келекеле-сыйла, ызатта-шылдыңда, толук-арык, таттуу-даамсыз, кедейлик-бардык ж.б. Түрк тилдери, анын ичинде кыргыз тили агглютинацияланма тилдерден болгондуктан, мындай антонимдер арбын кезигет, колдонулат жана алардын аң-сезиминдеги алгакы категориялардын фундаменти - денотациясы болуп саналат.\n" +
                        "Антонимдердин антонимдик-маанилик даражасы ар дайыма эле бирдей боло бербейт: эже-сиңди (жаш мерчеми боюнча жалпы элдик түшүнүктүн алкагынан караганда), ысык-суук (жылуулук өлчөмү боюнча жана такталып- ченелген бирдик жок).\n" +
                        "Антонимдерди бардык сөздөрдөн, сөз түркүмдөрүнөн издөө анчалык натыйжа жаратпайт. Айталы, мезгилдик, ал-абалдык, жагдай-шартты, кыймыл- аракетти чагылдырууда кескин-чечкиндүү өлчөм бирдиги, демек, антонимдер, антонимдик бирдиктер пайдаланылбайт: кечээ-бүгүн, аз-көп, жакшы-жаман, акырын-бат, чапчаң-жай, алыс-жакын, ысык-суук ж.б.\n" +
                        "Антонимдердин жасалышында, уюшулушунда иран-тажик тилдеринен кабыл алынган на-, бей- сыяктуу префикстер, интернационалдык термин сыяктанган сөздөрдө (алардын курамында, уюшулушунда): супер, мини өңдөгөн каражаттар да керектелет: Бул иш натуура болду го, менин баамымда (Н.Саади). Бейтааныш кишиге чеки сөз айтууну эп көрбөдүк (А.Жанынбеков). Супермаркеттин жанынан жолуктук (“Кыргыз туусу”). Миникананын күн чыгыш жагында (“Кыргыз туусу”).\n" +
                        "Антонимдер тексттин (айрыкча көркөм тексттин) алкагында учурайт, пайдаланылат. Ошондуктан аларды контексттик антонимдер деп атайбыз, окуу-усулдук эмгектерде да ушундай алкакта керектелет.\n" +
                        "Антонимдер – лексика-семантикалык, лингвистикалык кубулуш, алардын өзөгүндө обьективдүү көрүнүштөрдүн шарттуу чагылышы орун алгандыктан, көбүнчө сын-сапатты, өң-түстү билдирген сөздөрдө арбын учурайт да, дүйнөнүн түзүлүшүнүн маңызы менен чечмеленип, ойду окурманга образдуу стилдик багытта, максатта керекке жаратылат: “Айылга кайтып бара жатып, жол катары бирибиз да ооз ачып сүйлөгөн жокпуз. Данияр үчүн бул көнүмүш иш,- ал ансыз да сөзгө сараң, ошондой болсо да, бүгүнкүсү бизге катуу тийип жатты” (Ч.Айтматов). Келтирилген мисалда антонимдердин контексттик өңүтү: [сөзгө] сараң - [көп сүйлөбөгөн] – тантырак, келжирек сөздөргө антонимдик катыш жаратып турат, б.а., салыштырмалуу контексттик антоним болуп колдонулду. Мындай семантикалык жагдай айрыкча синонимдерде арбын учурайт.\n" +
                        "Антонимдер ойду окурманга образдуу берүүдө стилдик багытта, максатта керекке жаратылат. “Ай Чоро кыска сүйлө, башка сөзгө чаргыба” (Ч.Айтматов). “Көөдөңүндө жаның турганда, турмушту ийиндеп, дамаамат түртүп жүрүп отуруш керек экен” (Ч.Айтматов)." +
                        "\n\n\nСӨЗДӨРДҮН ХРОНОЛОГИЯЛЫК МЕРЧЕМИ БОЮНЧА БӨЛҮНҮШҮ\n\n" +
                        "Сөздөрдүн хронологиялык мерчеми жана колдонулуш активдүүлүгү менен пассивдүүлүгү боюнча неологизмдер жана эскирген сөздөр деген топторго ажырайт.\n" +
                        "Эскирген сөздөр ич ара эки түргө бөлүнөт. Алар: архаизмдер жана тарыхый сөздөр.\n" +
                        "Архаизмдер (гректин archalos - «байыркы, мурдакы, эски» дегенди билдирет), чечмелеп айтканда, ар кандай турмуштук жагдайга: илим- билимдин, экономиканын, маданиятын өсүп-өнүгүшүнө ылайык турмуштук оош-кыйыштыр мурдагы (салттуу колдонулган) сөздөрдүн айрым тобунун колдонулушун солгундатат, натыйжада сөздөрдүн архаизм категориясын жаратат.\n" +
                        "Т а р ы х ы й с ө з д ө р; лексика-фонетикалык, лексика-морфологиялык болуп бөлүнөт. Архаизмдердин бир түрү историзмдер (же тарыхый сөздөр). Алардын жашашы ар кандай факторлорго байланыштуу болот же алардын жашашына экстролингвистикалык да, интерлингвистикалык да себептер таасир этет." +
                        "\n\n\nНЕОЛОГИЗМДЕР\n\n" +
                        "Неологизм (< гректин neos – «жаңы» + logos – «сөз»). Ар кандай жаңы сөз колдонулушунун баштапкы учурунда ошол тилде сүйлөгөн жамаат үчүн экендиги сезилип турган учурда гана неологизм (жаңы сөз) боло алат. Качан гана жамаатка кеңири тарап, автивдүү колдонулганда неологизм болуудан калат. Демек, белгилүү бир мезгил үчүн гана жаңы сөз, анын ал (алар) бул сапатынан алыстап, демейдеги эле көрүнүшкө айланат.\n" +
                        "Бүгүнкү күндөр (2010-жылдын аягында) үчүн глобализация/ааламдашуу, сертификат, маңкурт (маңкуртчулук) жана башкалар.\n" +
                        "\n\n\nКӨРКӨМ ТЕКСТКЕ ЛИНГВИСТИКАЛЫК АНАЛИЗ\n\n" +
                        "Кыргыз тилинин лексикасы өзүнө тиешелүү болгон лингвистикалык өзгөчөлүктөрү, касиеттери менен жашап келе жатат.\n" +
                        "Кыргыз филологиясында көркөм (поэтикалык) текстке лингвистикалык иликтөөгө карата төмөнкү окумуштуулар салым кошушкан жана кошуп да келе жатышат. Ала турган болсок:\n" +
                        "А.Жалилов “Т.Сыдыкбековдун романдарындагы эскирген сөздөрдүн лексика-семантикалык өзгөчөлүктөрү” (1988);\n" +
                        "С.Мусаев “Кеп маданиятынын маселелери” (1993);\n" +
                        "С.Өмүралиева “Азыркы кыргыз тили: Лексикология” (2009);\n" +
                        "Б.Усубалиев “Кыргыз филологиясы жана филологдору” (2007); Т.Маразыков “Кыргыз тилиндеги текстти интеграциялоочу лингвистикалык\n" +
                        "каражаттар” (2005); А.Абдыкеримова “Лингвистикалык поэтика” (2008);\n" +
                        "Т.Сыдыкова “Барпы Алыкуловдун чыгармаларынын тили”(3 томдуу, 2004,2005,2006);\n" +
                        "А.Оморов “Жолон Мамытовдун поэтикалык айрым маселелери” (Сөз маанилери, троптун түрлөрү, фоностилистикалык каражаттар жана ыр түзүлүшү)(2004);\n" +
                        "И.Жороев “Диалектизмдердин лексика-семантикалык өзгөчөлүктөрү” (2009) ж.б.\n" +
                        "Улуттук дух (рух) жүзүнүн ар дайыма жарык болуп келгендиги, дагы деле болсо андай маанай улана бере тургандыгын анын көркөм мурастарынын муундарды тарбиялоодо талыкпай кызмат кылып жаткандыгын туябыз.\n" +
                        "Элдин көркөм мурастарынын өзөгү же көрөңгөлүү кубулжума кыртышы сөзгө мамиле жасоодо экендигин баамдайбыз. Мына ушундай мамилеге контексттеги-текст ичиндеги, өзөгүндөгү ойлор менен чырмалышкан. Алардын өзөктүү (айрыкча кызыгууну жараткан) категориялары: оксюморондор, энантиосемиялар, паронимдер." +
                        "\n\n\nОКСЮМОРОНДОР\n\n" +
                        "Оксюморондор (< гр. оxymoron – чечендик - дөөпөрөстүк; акылдуулук-кейбирлик) оппозициялык (кээде антонимдик) мааниде турган сөздөрдүн (сөз айкаштарынын) лексика-семантикалык жактан уюмдашуусунан, жалгашуусунан улам пайда болгон стилистикалык көркөм сөз каражаты, кубулжума тилдик бирдик, филологиялык контоминация. Мисалы: Күйбөгөн жери күл болуу - эч жери күйбөсө (күйбөй туруп эле) кантип күл пайда болот?! Суудан кургак чыгуу - суу нымдуу (ным жарата турган суюктук) зат болсо, ага салганда андан кантип эле кургак чыгууга болот?! Мында сыртынан формалдуу логикалык карама-каршылык пайда болгону менен ички семантикалык, лингвистикалык уюмдашуу жатат.\n" +
                        "Оксюморондун лингвистикалык табияты кубулжума, татаал келгендиктен, аны ажыратууда, өздүк түзүлүшүн көрсөтүүдө микротекстке (ошондой эле контекстке, подтекстке) кайрылып, сөздөрдүн моносемия жана полисемия сыяктуу өңүттөрүнө токтолуп, семантикалык синкретизм менен коннотациялык универсализмди жетекчиликке алуу, таянуу керек. Оксюморондордо бир эле учурда антонимдин, омонимдин, синонимдин, полисемиянын бирин-экинчиси жокко чыгарбаган өзөктөш семантикалык жалгашма касиети болот.\n" +
                        "Мен сенсиз жашай албай, жашап жүрөм (“Ак бата”). Айрыкча бүркүттүн балапанын алыш оңой-олтоң иш эмес. Ага аракеттенгендер жанын оозуна тиштеп, өлөөр-тирилээрине карабайт. Даана жан кечти деп ошолорду айт (Рыскулов С.).\n" +
                        "Биздин колдо болгон (көркөм адабияттан, утурумдук басма сөздөн, макал- ылакаптардан, учкул сөздөрдөн топтогон) маалыматтарга таянсак, кыргыз тилиндеги оксюморондор өздөрүнүн тутумуна (составына) жана колдонулушуна карай төмөндөгүчө бөлүнөт:" +
                        "\n1. Фразеологиялык мүнөздөгү оксюморондор.\n" +
                        "2. Контексттик мүнөздөгү оксюморондор.\n" +
                        "3. Сүйлөм тибиндеги (же синтаксистик) оксюморондор." +
                        "\n\n\n1. Фразеологиялык мүнөздөгү оксюморондор\n\n" +
                        "Мындай оксюморондордо (маанилик катышына карай) фразеологиялык идея басымдуулук кылат да, оксюморондук кыртыш семантикалык өзөктү кармап жана курчап турат: Мисалы: өлүк жан (жөн эле бир зат; саны - бар,\n" +
                        "сапаты - жок; ага назар салбай койсо да болот). Каргайын десем – жалгыз, каргабайын десем – байкуш. Өлөйүн десем – жан таттуу, өлбөйүн десем – жер катуу. Соңку эки мисал – макалда логикалык контаминация көрүнүшү орун алган." +
                        "\n\n\n2. Контексттик мүнөздөгү оксюморондор\n\n" +
                        "Алардын лингвистикалык турпаты тексттин ичинде аныкталып, оппозициялык биримдиги байкалат: Билип-билбей (көзү жетпей, түшүнүп- түшүнбөй, натыйжасын ажырата албай): Мисалы: Ар бир улут өзү билип- билбей ошого умтулганы умтулган (“КТ”). Эрке тана (өктөм, шар, өтүмдүү, чечкиндүү): бул жигит эрке тана турбайбы!? (“БТ”)\n" +
                        "\n\n\n3. Сүйлөм тибиндеги (же синтаксистик) оксюморондор\n\n" +
                        "Алардын составы экиден көп сөздөн куралат да, лексикалык синонимдер менен аныкталат: Мисалы: бара элек дооруна барган (улгайган, узак жашаган), жакын турган менен алыспыз (кайдыгерлик, чечкинсиздик), эшек такалап жүрөт (бекер, кыларга иш таппаган), көзү чанагынан чыкты, чыгып кетти (коркутуу, эси эки болду), ай десе аркы жок, күн десе көркү жок (сулуу, керемет, жамалдуу), көзгө сайса көрүнгүс (карангы), таз тарангыча, той таркайт (кыбыр, өзүнчө убаралана берген).\n" +
                        "Жогорудагы мисалдарга таянып, оксюморондорду сүйлөм ичиндеги грамматикалык сырткы абалына, конкреттүү шартка жараша сөз айкалышынын чегиндеги, сүйлөмдүн деңгээлинде да кароого болот жана алардын мүнөздүү белгиси акыркы компоненти этиш сөздөн турат: суудан кургак чыгуу, күйбөгөн жери күл болуу, укпаганды угуу.\n" +
                        "Оксюморондордун компонеттеринин жанаша, ыкташа келиши, байланышы боюнча төмөндөгүчө бөлүнөт: \nа) багыныңкы байланыштагы оксюморондор; \nб) тең байланыштагы оксюморондор; \nв) ыкташуу байланышындагы оксюморондор; \nг) башкаруу байланышындагы оксюморондор; \nд) таандык байланышындагы оксюморондор: Укпаганды угузуу; көрбөгөндү көрсөтүү; эскинин жаңысы; пайданын зыяны; бардын жогу; ачтын тогу; көргө көргөзбө; дүлөйгө угузба; жаман жакшы.\n" +
                        "Кыргыз ономастикасында (айрыкча антропонимиясында) да оксюморондор жолугат. Аларды лексикалык же жөнөкөй антропонимдик жана татаал (же эки компоненттен турган, кишинин фамилиясы менен атынан турган) антропонимдик оксюморондор деп бөлөбүз. Лексикалык же жөнөкөй антропонимдик оксюморондор эки (өтө сейрек үч) антропонимдик курамдан биригип, бир кишинин энчилүү аты катары колдонулат: Кедейбай (< кедей - кембагал, колунда жок, жарды +бай - колунда бар, бардар, эр аты), Бешкемпир (< беш+кемпир — аял заты жөнүндө эмес, эр кишинин энчилүү аты), Үчкемпир (<үч+кемпир - эр кишинин энчилүү аты), Уулкыз (<уул+жан — кыз баланын энчилүү ысымы).\n" +
                        "Татаал антропонимдик оксюморондор көбүнчө сатиралык чыгармаларда колдонулат да, каармандын мүнөзүндөгү (кылык жоругундагы сапаттарды) көрүнүштөрдү ашкерелөөчү каражат катары жана ойду күчөтүп, оргуштатып берүү үчүн колдонуалат. Мисалы:" +
                        "1. Бурулбасова Бурулча - институттун кирүү сынагын алып бүтүп, үйүнө кирди... (“Чалкан”).\n" +
                        "2. Жетээр Жетпесович - алтын башы аман турганда, сөгүш деген кеп бекен?! Андан көрө өскөндү өстүрбөй толгото чаап, ордун бат эле тартып алыш керек...(“Чалкан”)." +
                        "Бул мисалдардагы каармандардын жеке керт башындагы сапаттар - эгоисттик турпаттары, коомдук турмуштагы социалдык автопортреттери көрсөтүлдү, чечмелеп айтканда, Бурулча Бурулбасова - сыртынан калыс, принципиалдуу көрүнгөнү менен өзүнүн кызыкчылыгы үчүн бат эле каалаган багытка бурулуп кетет. Экинчи мисалдагы Жетээр Жетпесович - жөндөмсүз бир пенде. Канчалык жогорку кызмат үчүн жан талашпасын, баары бир өйдөлөй албайт. Мындай маани текст аркылуу жана каармандардын энчилүү аттары - антропонимдик оксюморондор аркылуу байкалып турат.\n" +
                        "Күчөтмө оксюморондор. Мындай оксюморондор күчөтмө же жөн эле сын атооч сөздөрдүн айкашуусунан пайда болот. Жаман жакшы, иттей жакшы (өтө мыкты, аябай сонун), иттей жаман (өтө оор, бөтөнчө кыйын), жаман жеңил (оңой, кыйын эмес), жаман (бат) көтөрүлдү (оңой, бат, тез).\n" +
                        "Оксюморондор сүйлөмдүн башында, ортосунда жана аягында колдонула берет. Андай учурларда алардын мааниси, касиети, эмоциалык кызматы макротекст менен тыгыз каралып, алар менен айкалышта чечмеленет, түшүндүрүлөт.\n" +
                        "Оксюморондор -ба (варианттары менен), -да деген формалардын/мүчөлөрдүн, ооба, жок, бар деген сөздөрдүн катышуусу менен жана алардын энантиосемиялык жагдайы аркылуу уюшулат:\n" +
                        "-ба: Күйбөгөн жери күл болуу (абдан уят болуу, катуу кайгыруу). Айтпаганды айтуу (ар кандай ыплас сөздөрдү сүйлөө).\n" +
                        "жок: Мен сизден кол булгалап кетким жок. Үн катпастан карек албай барам узап.\n" +
                        "Бизди бөлгөн тагдыр, бөлө албады жүрөктөрдү, Биздин жолдор узак-узак... (“Кт”).\n" +
                        "Оксюморондор компоненттеринин саны боюнча эки тутумдуу (көздүү сокур, тилдүү дудук, кичинекей алп), үч тутумдуу (тирүү туруп өлүү, көзүңө карап бас), төрт жана андан көп тутумдуу ( таз таранганча той таркайт, ыргыткан ташы өйдө кулады) болуп бөлүнөт.\n" +
                        "Пайда болушунча карай оксюморондор төмөндөгүчө бөлүнөт:" +
                        "а) антонимдик курамдан тургандары (далилсиз далил).\n" +
                        "б) антонимдик идеядагы сөздөрдүн тутумунан тургандары (арбын туруп аз болуу, түгөл туруп кемүү, күндүз күнү-түн болуу)." +
                        "Уюмдашуусу жагынан антонимдер менен оксюморондордун ортосунда бир аз окшоштук жана айырмачылык да бар. Антропонимдер карама-каршы түгөйдөн туруп, бир сөз түркүмүнө таандык болсо, оксюморондорго мындай белги мүнөздүү эмес. Чечмелеп айтканда, оксюморондордун пайда болушуна, жаралып-калыптанып жашап калышына тил менен ойлоонун жана тил менен логиканын өз ара бирдиктүү айкалыш мыйзамдары орун алган. Мисалдарга кайрылалы: 1. Оозуңа карап сүйлө. 2. Көзүңө карап бас. 3. Буту жерге тийбей чуркап бара жатат. 4. Ыргыткан ташы өйдө кулады. Мисалдарды чечмелесек. Биринчи мисалды алалы (оозуңа карап сүйлө) - ооз өзү сүйлөө мүчөбүз (органыбыз) болсо жана аны түз (күзгүнүн жардамысыз) көрүүгө мүмкүн болбойт, практикада аны карап туруп, анан сүйлөөнүн зарылдыгы пайда болбойт. Экинчи мисалда (көзүңө карап бас) - көз өзү түздөн түз көрүү мүчөбүз (органыбыз) болсо, аны кантип көрөбүз, кантип аны карап туруп басабыз? Үчүнчү мисалда (буту жерге тийбей чуркап бара жатат) - бутуң жерге тийгенде чуркайсың (бут басуу мүчөбүз да), басасың, бутуң жерге тийбесе - кантип басасың, алга жылысың, кыймылдайсың? Төртүнчү мисал. Физиканын мыйзамы боюнча ташты (ар кандай оордукту, затты, салмакты) өйдө-асманды карай ыргытсаң, ал ылдый-жерге түшөт (асманга-өйдө көтөрүлүп кетпейт).\n" +
                        "Тарыхый жактан жана колдонулушуна карай оксюморондор байыркы, салттуу жана автордук болуп бөлүнөт.\n" +
                        "Байыркы оксюморондорго: кыргыз жомокторунда (жомоктун башында эпиграф катарында айтылуучу) - ач экен, ток экен, бар экен, жок экен илгерки өткөн заманда ж.б. кирет.\n" +
                        "Салттуу оксюморондорго: жоктон бар кылуу: Болот ага ошондо жоктон бар кылып, окуучуларынын жигерин көтөргөн (“Асаба”), Жаман (иттей) жакшы көрүү ж.б. кирет.\n" +
                        "Автордук оксюморондорго:\n" +
                        "Турмуш мени таштап таман астына, Кабыргамды кайыштыра басты да. Тирүү туруп, көрдүм нагыз тозокту. Үмүт оту өчүп-күйүп үлпүлдөп,\n" +
                        "Даяр эле жан да менден качууга.\n" +
                        "Эгер билсе, баштан өткөн бир билет,\n" +
                        "Тозок күндөр кумга айлантат ташты да. ж.б. кирет\n" +
                        "(“Эт”, Жапаркулов А.).\n" +
                        "Келтирилген ыр саптарындагы мисалдар - оксюморондор автордун поэтикалык дараметин да сездирип, сөзгө мамиле кыла билүүдөгү кудуретин да көрсөтүп, изденүүчүлүк-новаторчулук түйшүктү, оригиналдуулукка болгон аракеттен баян берет. Демек, оксюморондор - көркөм кудуреттүү, такай кубулжума аракеттүү лингвистикалык каражат." +
                        "Оксюморондор - образдуулук үчүн, автордук чыгармачылык менен чынжырланышкан көркөм кубулуш. Айтылган пикирди кубатташ үчүн кыргызга таанымал таланттуу акын Акбар Рыскул[ов]дун “Камыштын дилдирегиндей” аттуу ырын мисалга алалы:" +
                        "\n* * ** *\n" +
                        "Камыштын дилдирегиндей, Каакымдын үлбүрөгүндөй, Кыялда турат бир сезим Төгүлүп барып, төгүлбөй.\n" +
                        "\n* * * **\n" +
                        "Булуттун буурул көгүндөй, Булактын тунук өңүндөй, Кыялда турат бир сүрөт Көрүнүп келип, - көрүнбөй.\n" +
                        "\n* ** **\n" +
                        "Чыгыштын буурул таңындай, Чымчыктын балапанындай, Чырлыйттап келип бир обон Жаңырып турат - жаңырбай.\n" +
                        "\n* ** ** \nАрзыбай туруп аныма\n" +
                        "Ак сүйүү арнабагыла, Алсаңар мейли,- а бирок, Кол менен кармабагыла!" +
                        "\n\n(Акбар Рыскул[ов]. Кудурет.-Б., Бийиктик, 2003, 264-б.). Мында акын жандуу-жансыз жаратылыштын түзүлүшүндө ушунчалык бир назик, бүлбүлдөгөн көрүнүштөр жашап жаткандыгын (ошолордун арасында, ортосунда биз бар экендигибизди) айтып, андай жагдайды (көрүнүштөрдү) сезе билип, ага өтө эле аяр мамиле жасоого үндөйт (чакырат). Бул жерде\n" +
                        "автордук изденүүчүлүк, новатордук сапат орун алган.\n" +
                        "Тилдик өңүттөн караганда, автордун оюнун көркөм тексттин алкагына\n" +
                        "жалгашып турушуна сын атоочтун -дай мүчөсү чырмалыша турат. Дал мына ушундай айкалыш куплеттик (ырдын) лингвистикалык энантиосемиясын жаратты. Мындай көркөмдүктүн пайда болушуна фонетика-фонологиялык жалгашуу да таасир жаратып турат.\n" +
                        "Аталган акындын сөз болгон китебинин ошол эле 264-бетинен “Ошондо” деген дагы бир чыгармасы поэтикалык (куплеттик) оксюморонго мисал болот:\n" +
                        "Бийик сезип, ыйык сезип өзүмдү" +
                        "Тик кароого көзүңдү\n" +
                        "Кантип эрким жетти экен? Капилеттен тосуп чыгып жолуңдү. Кармалоого колуңдү\n" +
                        "Кантип эле батындым?\n" +
                        "Буйдалбастан бүт тыбышын атыңдын, Кантип гана чакырдым?" +
                        "Мен ошондо эссиз, көзсүз экенмин.\n" +
                        "Мен ошондо эстүү, көздүү экенмин." +
                        "Акбар Рыскулов акындын филологиялык изденүүсүн, бул аракет ага\n" +
                        "чыгармаларына жаңыча мамиле жасоого, поэтикалык кыртышта аракеттернүүгө, эл көрбөгөндү көрө билүүгө, туюмундагы уюткуну кең мейкиндикке, өлөңдүү жана өзөндүү жайыкка алып чыгууга чакырык таштайт да, Чыгыш поэзиясындагы салттуулук сапарды урматтоого үндөйт жана дагы бул жерде (чыгармада) акындын уюткулуу психологиялык уйгу-туйгу, поэтикалык толгонуусу жатат, турмуштун өзүнүн, ошондой көп кырдуулугунан жарыя кылууда. Демек, чыгармада д и х о т о м и я л ы к с и н- кретизм жана экспрессема оруналган,поэтикалык парапсихологизм жаралган.\n" +
                        "Оксюморондордун пайда болушунда ырааттуулуктун ажырагысыз биримдиги орун алган. Дал мына ошондуктан аларда логикалык ички шайкештик сакталып, эмоционалдык боёкчо данакерлик кызмат кылат да, образдуулук менен көркөмдүк үчүн милдет өтөйт. Өз кезегинде мындай көрүнүш оксюморондордун компоненттик макросистемасын жаратат да, элдин айлана-чөйрөнү кабылдоо, жаратылыш жөнүндөгү түшүнүк модели-үлгүсү менен байланышат, элдик сөз менен айтканда, жибектей жумшактыкты пайда кылат.\n" +
                        "Ошентип, оксюморондор - маанилик жактан фразеологизмдер менен семантикалык деңгээлдеги шарттуу жана формалдуу байланышкан лексикалык көрүнүш. Анын компоненттери өз ара үстүрттөн гана уюмдашат да, ойду күчөтүп-көркөмдөтүп берүүчү лингвистикалык каражат катары кызмат кылат.\n" +
                        "Сөздүн маанилик катышы боюнча топторуна, бөлүнүшүнө таянып, оксюморондорду (омонимдер, антонимдер, синонимдер сыяктуу эле) өзүнчө лексикалык категория катарында караса болчудай.\n" +
                        "Оксюморондордун уюшулушунда, пайда болушунда антонимдердин катышы анчалык деле зарыл эмес. (Биз талдоого алган мисалдарды караңыз).\n" +
                        "Чыгармалардагы көркөм текст өөдүк-сөөдүк сыяктуу сезилгени менен, алардын маңызында өтө терең (байкалып-байкалбаган) оксюморон, энантиосемия, пароним жайгашкан. XX-XXI кылымдардагы акындар - (биз билгенденден) мурдагылар: Бай Калыгул уулу, Молдо Ныяз, Алыкулов Барпы; азыркылардан: Кожомбердиев Т., Мамытов Ж., Муканов Т., Дүйшөев Ш., Эрматов Э., Акбар Рыскул, Саади Нооман ж.б. Албетте, алардын поэзиясында Чыгыштын салттуу уюткулуу-көрөңгөсү көбүрүп-жабырып турат.\n" +
                        "ЭНАНТИОСЕМИЯЛАР\n" +
                        "Энантиосемия (англисче – enantiosemy - карама-каршы маани) бир эле сөздүн (лексикалык бирдиктин) контекстке жараша оппозициялык (бинардык) мааниде колдонулушу. Энантиосемияда семантикалык маани горизонталдык (синонимдик) да, вертикалдык (антонимдик жана омонимдик) да деңгээлдеги катышта туруп, карама-каршылык кырдаалда биригип, синкретизм абалында" +
                        "керектенилет да, мындай көрүнүш негизинен бир эле сөздө жана сөз айкашынын (фразеологизмдин) чегенде ишке ашат. Мисалдар:\n" +
                        "Мээнет I - жыргал, жакшылык: Адамды эмгек гана бактыга жеткирерин, мээнетке жараша атак-даңк келээрин жакшы билет (“СК.”).\n" +
                        "Мээнет II - кыйналгандык, кыйындык: Ошондон көрө үйүбүз менен биригип, бир короо кой алсак, мүмкүн, мээнетибиз текке кетпей, көзгө көрүнөт, - деп, аталык кеңешин салган (“СК”). Жайлы жайлата, кышты- кыштата кылган эмгегине мээнет акыбети кайтып, дасторкон данга толуп турган маалы (“КТ”).\n" +
                        "Энантиосемия кубулушу маанилик структурасы жана семантикалык катышы, мүнөзү, пайда болушу, ошондой эле функционалдык табияты боюнча ар кыл, көп жактуу көрүнүшкө кирет да, негизинен төмөндөгүдөй лексикалык жолдор аркылуу пайда болгон: 1) сөз маанилеринин өнүгүшү (жылышы); заттарды, нерселерди салыштыруу-теңдештирүү аркылуу.\n" +
                        "Саратан I: кышкы саратан - кыш мезгилинин эң суук кези.\n" +
                        "Саратан II: жайкы саратан - жай мезгилинин өтө ысык кези.\n" +
                        "Чилде I: кышкы чилде - кыш мезгилинин абдан суук учуру.\n" +
                        "Чилде II: жайкы чилде - жай мезгилинин эң ысык учуру. Энантиосемияларда омоним менен антонимдин - омоантонимдин\n" +
                        "ширелишкен касиети орун алган. “Сөз маанилеринин өз ара антонимдик катышы алардын биринчи учурдагы өзөктүк маанилеринин негизинде пайда болгон жаңы, кошумча маанилердин өнүгүшүнөн жана алардын элдик мүнөздө калыптанышынан келип чыккан” (Сапарбаев А. Кыргыз тилинин лексикологиясы жана фразеологиясы.-Б.: “Кыргызстан-Сорос” фонду, 1997.- 143-б.). Демек, сөздүн семантикалык структурасында алгачкы же биринчи (уютку) маани өзөктүк (денотаттык) маани, ал эми ага карама-каршы келген маани - кийинки, туунду же жаңы маани болуп саналат. Мисалдар:\n" +
                        "Байы I - көбөйүү, мол болуу: Жай өтүп, күз да жетип, канат жайып, эмгекке дагы абалар калды байып (Ж. Турусбеков).\n" +
                        "Байы II - азаюу, тартылуу, кемүү: Берекелүү, ширелүү жүгөрүдөн сүт келет, байып кеткен жегиче (А.Токомбаев). “Жандуу эненин кулунтайнынын чычаңын жыттап мээрленип турчу эле. Эми кээде жинине тийгенде ыйык жалдан оорута тиштеп алчу болду. Жини кичирейди, сүтү байыды. Кула кулун эми чөп оттошко көндү” (Ч.Айтматов, 2009, 2-том, 229-б., “Гүлсарат”).\n" +
                        "Биздин пикирибизче, энантиосемиянын ар бир түгөйү сөздүктөрдөн өзүнчө макала түрүндө орун алууга, сөздүк статусуна ээ болууга тийиш. Мындай абалды “Кыргыз тилинин түшүндүрмө сөздүгүнөн” (1969, жайра, саратан ж.б. сөздөргө берилген түшүндүрмөлөрдөн) байкоого болот.\n");
                break;
            case 6:
                openSecond("\n\n\nЭТИМОЛОГИЯ\n\n" +
                        "Этимология – эне тилдеги сөздөрдүн, морфемалардын пайда болушун, тарыхын (келип чыгышын), тегин изилдейт, ошондой эле ал эне тилдеги сөздөрдүн башка тилдердеги сөздөр менен чыгышы жагынан болгон катышын да иликтейт.\n\n" +
                        "Сөзгө, морфемага (мүчөгө) теги жагынан талдоо жүргүзүү иши өтө татаал жана көп кырдуу проблема, анткени бул же тигил сөздүн, морфеманын пайда болушун, калыптанышын түшүндүрүү, иликтөө үчүн тилдин, элдин тарыхына, бүгүнкү абалына, маданий-экономикалык факторлорго кайрылууга туура келет.\n" +
                        "Өз кезегинде тилдин тарыхы, элдин тарыхы дегендин өзү – узак мезгилди кучагына камтып, өтө татаал жана улам акырындык менен өнүгүп, калыптанып турган система, тилдин универсалдык мыйзамдары менен байланышкан процесс.\n" +
                        "Бул же тигил сөзгө, морфемага этимологиялык изилдөө жүргүзүү үчүн ошол материалы тандалып жаткан тилдин (айталы, кыргыз тилинин) тарыхын, фонетика-морфологиялык (фонологиялык) структурасын, системасын жана алардын эволюциялык мыйзамын билүү зарыл. Демек, бул же тигил сөзгө, морфемага этимологиялык илик жүргүзүү үчүн чоң лингвистикалык даярдык жана көп жактуу илимий база болуу керек, ошондой эле окумуштууну лингвистикалык фантазия (кыялдануу) коштоп турушу абзел.\n" +
                        "Этимологиянын эки түрү бар: элдик (же жалган) этимология жана илимий этимология.\n" +
                        "Элдик (же жалган) этимология деп тилдин ички закондоруна, лексика- семантикалык реалдуу абалга таянбастан туруп, тыбыштык (сырткы) форманын негизинде божомолдоолорго, ар кандай уламыштарга, санжыраларга же интуицияга негизделип түшүндүрүүгө жасалган аракетти айтабыз. Мындайча этимологиялык илик жүргүзүү көпчүлүк учурда чындыкка туура келбегендиктен, ал жалган этимология деп айтылат. Мисалы,\n" +
                        "Жети - Өгүз, Ош (Өш),\n" +
                        "Ысык-Көл, Эне- Сай (Ээн-Сай),\n" +
                        "Кыргыз, Камчатка, Тору-Айгыр, Кочкор.\n" +
                        "Апиче (апа - эже).\n" +
                        "Оңгор (бут кийимди оңгор), салышт.: Жунгар, Хунгар, Лянгяр. Жогорудагы\n" +
                        "мисалдарды жөнөкөй тил менен түшүндүрүү.\n" +
                        "Илимий этимология салыштырма-тарыхый маалыматтарга, илимий\n" +
                        "негизге, байланышы айкын фактыларга таянып жүргүзүлөт.\n" +
                        "Сөзгө илимий этимология жүргүзүү үчүн биринчи кезекте ага\n" +
                        "фонетикалык (тыбыштык), лексикалык (семантикалык), грамматикалык талдоо жүргүзүлөт. Анан салыштырма-тарыхый метод колдонулат. Мындай маалыматтар бир тилдин ички даректери, тектеш жана тектеш эмес (бирок тарыхый-маданий жактан байланышы, катышы бар) тилдердин фактылары менен салыштырылат. Мисалга, Бөбөк – бөжөк – бөлтүрүк – бөкчөйүү – бөк (түшүү);\n" +
                        "Бөлмө - бөлчөк – бөл – бөтөн – бөлө - бөлөк. Бул мисалдардагы –бө - элементине көңүл бөлсөк, андагы –бө - бөлүк, чакан (олчойгон эмес) деген мааниде керектелип жатат.\n" +
                        "Быйыл ← бул жыл ← бул + йыл;\n" +
                        "Бүгүн ← бул күн ← бу +күн →бүгүн;\n" +
                        "Кыс+сык – метатеза компоненттүү этимология;\n" +
                        "Тегерек – төгөрөк – тоголок – томолок;\n" +
                        "Орусча ряд → кыргызча ирет;\n" +
                        "Кум шекер ← шекер ↔ сахар → Сахара чөлү. Окурман өзү ой жүгүртүп,\n" +
                        "Арабия өлкөсүндөгү ушундай аталыштагы чөл менен байланыштыра кароого багыттайбыз жана Иллич-Свточтын, К.Сейдакматовдун «Кыргыз тилинин кыскача этимологиялык сөздүгүн» (1988), И.Абдувалиевдин «Этимология жана лексикография» (2007), Б.Ө.Орузбаеванын “Кыргыз тилинин этимологиялык сөздугүнө материалдар”(2010) деген эмгектерди кароого сунуштайбыз.\n" +
                        "Этимологиялык изилдөө ишиндеги эң орчундуу аракеттердин бири сөздүн уңгусун (этимонун) таап, анын азыркы кездеги колдонулуп жүргөн сөздөр менен байланышын аныктоо маселеси. Бул багытта төмөндөгү мисалдарга токтолобуз: эгиз – эки, көз - көр (көңдөй), уйку – укта – уйкаш – уюл – уютку – уюш (тур) – уюм – ук; ысык – ытык – ыдык – ызык – ыйык (Ысык-Көл, Ысык- Ата, Кыргыз-Ата), Сүлүктү ← Сүлүк + ты.\n" +
                        "Илимий этимологияга бир нече жөнөкөй чечмеленген мисалдар:\n" +
                        "Көгүчкөн ← (көктү карай учкан куш) ← көк+уч+кан, мында эки үндүүнүн ортосунда [к] тыбышы [г] тыбышына өттү; үндөштүк мыйзамынын негизинде [ө] тыбышынын таасиринде [у] тыбышы [ү] тыбышына өттү. Натыйжада көгүч болду, андан кийин кан элементиндеги [а] тыбышы – сөздүн мурдагы башындагы [ө, ү] көгүч тыбыштарынын таасиринде [ө] гө өттү да, эриндүү, ичке үндүүлөрдүн таасиринде: көгүчкөн болду. Бул жерде бир нече фонетика – морфологиялык мыйзам аракети болду.\n" +
                        "Ыштан ← ич+тон: бул жерде [т] тыбышынын таасири менен [ч] тыбышы [ш] тыбышына өттү. Тон деген сөздөгү [о] тыбышы [а] тыбышына өттү да, ошол өткөн [а] тыбышы ич деген сөздөгү [и] тыбышын [ы] тыбышына өткөрдү. Натыйжада – үндүү жана үнсүз тыбыштардын комбинаторлордук (кошулма-жалгашма) мыйзамдарынын алкагында ыштан деген жаңы сөз пайда болду.\n" +
                        "Белес ←деген сөз: бел (ашуу) + аш (ашуу) деген синоним сөздөрдүн, географиялык-координант түшүнүктөрдүн негизги алкагында жаралды.\n" +
                        "Этимологияга дагы мисалдар:\n" +
                        "Байбиче//апче//эже//эпчи//бичик//бычмачы (аял заты тууралуу сөз болуп жатат).\n" +
                        "Аба//Обо//авиа (айлананы курчап турган аба агымы – массасы жөнүндө сөз болуп жатат).\n" +
                        "Кулач//кол ач (колуңду ач; элдик эски ченем).\n" +
                        "Орус тили менен кыргыз тилинен салыштырмалуу мисалдар:\n" +
                        "Кыргызча сеп – орусча сеять.\n" +
                        "Кыргызча мурун (мурду) – орусча морд.\n" +
                        "Шумер деген сөздүн этимологиясы түпкү теги абдан кызыктуу, тактап\n" +
                        "айтканда, шу→(байыркы түрк тилдеринде: суу+мер (мурен), монгол тилдеринде: - суу, чечмелеп айтканда: суу (түркчө)+мурен (монголчо) «суу». Мындай семантикалык редупликалык (Н2О+ Н2О) лексиканын (айрыкча ономастикалык алкакта) дүйнөлүк лингвистикада, ономастикада арбын учурайт. «Манас» эпосунда Шумер тоо деген ороним кездешет. Талдоого алынган мисалга үндөш.\n" +
                        "Бир тилдеги (айрым мааниси же формасы) учурда кызыгууну жараткан сөздөрдүн пайда болушуна көңүл бурулуп жазылган эмгек. Ал мазмуну жагынан тарыхый-салыштырма сөздүккө жакын болуп, студенттин лингвистикалык билимин тереңденишине жана чың болушун шарттайт. Бул эмгек филологиялык сөздүктөрдүн ичинен өтө татаалы, бирок абдан баалуу болуп саналат. Буга К.Сейдакматовдун «Кыргыз тилинин кыскача этимологиялык сөздүгү» (Фрунзе, «Илим»1988,335 б.) мисал болот.");
                break;
            case 7:
                openSecond("\n\n\nФРАЗЕОЛОГИЯ\n\n" +
                        "Фразеология гректин < phraseos- “айтылыш” + logos – “окуу, илим” деген сөздөрүнөн алынган, б.а., нускалуу сөздөр, алардын курамы, мааниси, колдонулушу тууралуу лексикология илиминин бир тармагы.\n" +
                        "Фразеологизмдер эркин сөз айкашынан төмөнкү белгилери менен айырмаланат:\n" +
                        "n\n1. Курамы боюнча 2 (эки) же андан ашык сөздөрдөн турат;\n" +
                        "2. Курамындагы сөздөрдүн орун-тартиби, синтаксистик байланышы\n" +
                        "жагынан дээрлик туруктуу болот;\n" +
                        "3. Курамындагы бардык сөздөр (ал сөздөрдүн семантикалык суммасы) өтмө мааниде колдонулуп, ойдун көркөм (образдуу) болушун шарттайт.\n" +
                        "4. Жеке сөз сыяктуу бир гана денотатты туюнтуп, сүйлөмдө анын бир мүчөсүнүн милдетин аткарат.\n" +
                        "5. Синтаксистик объектиси эмес, толук маанилүү сөз түрүндө лексикологиялык категория катары каралат.\n" +
                        "Алгач негизинен илимий жана алфавиттик принципте жамаат түзгөн “Кыргыз тилинин фразеологиялык сөздүгү” Б., 1980, 18,5 (он сегиз бүтүн ондон беш) басма табак көлөмүндө 2000 (эки миң) нускада “Илим” басмасынан жарык көргөн.\n" +
                        "Ж. Осмонова, К. Коңкобаев, Ш. Жапаровдор түзүшкөн “Кыргыз тилинин фразеологиялык сөздүгү” (Б.,2001,519 бет- 65 (алтамыш беш) басма табак көлөмүндө 1000 (бир миң) нускада Кыргыз-түрк “Манас” университетинде басылып чыккан. Ага 7980 (жети миң тогуз жүз сексен) фразеологизм камтылган. Аталган эмгек Кыргыз ССР Илимдер академиясынын, Кыргыз Республикасынын Улуттук илимдер академиясынын азыркы Ч.Айтматов атындагы Тил жана адабият институтунун “Лексикология жана лекикография” секторунда/бөлүмүндө даярдалган. Китеп академиялык фразеологиялык сөздүк деп аталат да, ушул багыттагы эмгектердин жаралышына, фразеолог-илимий кадрлардын калыптанышына чоң роль ойнойт.\n");
                break;
            case 8:
                openSecond("\n\n\nТЕРМИНОЛОГИЯ\n\n" +
                        "Илим-билимдин, өндүрүштүн, турмуштун бул же тигил тармагында так (такталган) түшүнүктү туюндуруу, билдирүү үчүн керектелген сөз (же татаал сөздөр) термин деп аталат. Ал латынча < terminus – “чек, ажыратып-аныктоо” деген сөзүнөн алынган.\n" +
                        "Академик Б.Ө.Орузбаеванын (“Кыргыз терминологиясы”, 1983, 3-б.) аныктамасы боюнча: “Термин – илимдеги түшүнүктөрдүн паспорту. Тигил же бул түшүнүк бир сөз менен канчалык так, кыска берилип, тигил же бул сөздүн жардамы менен өзүнүн атоосун тапса, аны түшүндүрүүгө да, экинчи түшүнүктөн айырмалоого да жеңилдик туулат. Термин бул касиети илим үчүн, анын эрежелерин, закондорун, аныктамаларын бири-биринен айырмалап атоодо өтө зарыл. Ошентип, \n\n1) терминология – терминдер жөнүндөгү илим, тил илиминин бир бөлүгү; \n2) лексиканын терминдерди камтыган бөлүгү”.\n" +
                        "Термин – түшүнүктөрдүн ситемасы, жыйындысы, атайын алынган сөз.\n" +
                        "Термин да, сөз да бул же тигил нерсенин (заттын), түшүнүктүн атын атайт, бирок термин полисемиялуулукка, эмоциялуулукка, ички уйгу- туйгулукка ээ болбойт.\n" +
                        "Сөз маанилери катып калган сенек көрүнүш эмес, алардын өнүгүп- өзгөрүшү денотаттын (же заттын) табиятына байланыштуу эволюциялык абалда болот, ушундан улам сөздүк номинация өзгөрө бербестен, сөздүн маанисинде жылыш жаралат. Демек, илимий-техникалык, маданий, саясий ж.б. өзгөрүүлөр лексикага таасир этип, сөздүк корду байытат да, семантикалык системаны кыймылга келтирет. Ошондон улам терминологиялык лексика да өзгөрүүлөргө дуушарланат. Өз кезегинде бул жылыш лексиканын лексикологиялык, семасиологиялык, терминологиялык изилдөөлөрдүн багыттарына түрткү болот.\n" +
                        "Терминдер өтө сейрек илимий тармактар (багыттар) аралык көрүнүшкө да ээ болот: (муун – биологияда, тил илиминде; морфология – лингвистикада, медицинада; стиль – тил илиминде, өнөр жайда ж.б.).\n" +
                        "Терминдерди изилдеп (жаралуу жолдорун, семантикалык-функциясын аныктап) алардын системалуу болушуна өбөлгө түзгөн – терминология.\n" +
                        "Терминдерден бир аз айырмаланып жана ошол эле учурда жалгашып турган көрүнүш – кесиптик лексика (же элдик терминдер). Ал (алар) кесипчиликке карата да элдик кесип-өнөр менен байланыштагы лексикалык катмар. Мисалга, жибекчиликке, кызылчачылыкка, тамекичиликке, зергер/устачылыкка, ат жабдыктарына байланыштуу сөздөрдү алсак болот.");
        break;
            case 9:
                openSecond("\n\n\nОНОМАСТИКА\n\n" +
                        "Ономастика – энчилүү аттардын (аталыштардын) пайда болушу, калыптанышы, жашап жатышы – аткарган кызматы (функциясы) менен байланышкан лекикологиялык да, лексикографиялык да тармак. Илимпоздордун бир тобу ономастиканы өзүнчө бөлүп атайын карашса, башкалары лексикология менен лексикографиянын ажырагыс бир бөлүгү катары карашат (изилдешет). Бардык учурда тең анын маанилүүлүгү сакталат.\n" +
                        "Ономастика илимине дүйнөдө Чыгыш окумуштуулары алгачкылардан болуп жана философиялык, психологиялык өңүттөн кызыгышкан. Өз кезегинде мындай жагдай азыркы ономастиканын түптөлүшүнө түрткү болгон, кошумчалап айтканда, ΧΧ кылымдын 30-жылдары; 1930-жылы Биринчи Эл аралык о н о м а с т и к а л ы к конгресс Франция мамлекетинде окумуштуу А. Дозанын демилгеси менен өтөт. 1949-жылы Белгияда Эл аралык онамастикалык комитет уюшулат. 1950-жылы ЮНЕСКОнун алдында “Онома”(Onoma) деген журнал уюшулат. Ошол мезгилде СССРде – коомдук илимдер боюнча “Ономастика”: (Указатель литературы – 1976-1980) – М.,1984, 226 б.) деген библиографиялык-информациялык эмгек жарык көрөт.");
       break;
            case 10:
                openLeksigrophyActivity("petr","\n\n\nЛексикография жөнүндө жалпы сөз\n\n" +
                        "Лексикография тил илиминин сөздүк тууралуу, сөздүк түзүү аракетинин теориялык жана практикалык жумуштары жөнүндөгү бөлүгү.\n" +
                        "Ал гректин lexikon -“сөздүк”, grapha - “жазамын” деген сөзүнөн алынган, чечмелеп айтканда, сөздүк түзүү илиминин теориялык жана практикалык маселелерин изилдеймин, үйрөнөмүн дегенди билдирет.\n" +
                        "Сөздөрдүн кандайдыр бир ирети (тартиби) боюнча белгилүү принциптин (принциптердин) негизинде жайгаштырылышын сөздүк деп атайбыз.\n" +
                        "Сөздүк – бул сөздөрдүн жыйындысы жана басылып чыккан эмгек. Ал бир элдин (же бир нече элдин) кандайдыр бир багыттагы же максатты көздөгөн\n" +
                        "сөздөрүнүн атайын топтому.\n" +
                        "Сөздүк – билим берүүдө, окутуу ишине чоң көмөк көрсөтүүчү жана өбөлгө\n" +
                        "түзүүчү окуу куралы. Маданияты өнүккөн жана өнүгүп бара жаткан элдерде, мамлекеттерде ал ар кандай форматта, формада, көлөмдө тынымсыз чыгып турат. Демек, мындай аракет турмуштук зарылдык менен муктаждык.\n" +
                        "Сөздүк – ушул мезгилде, бардык маданияты, илим-билими, экономикасы өнүккөн өлкөлөрдө эң таңсык жана өтө окумдуу басма буюму (товары) болуп саналат. Жалпы дүйнө маданиятын, ошондой эле бир (же жеке) элдин цивилизацияга, улам жаңы деңгээлге, баскычтарга көтөрүлүшүнө жагымдуу таасир этип турат.\n" +
                        "Сөздүк түзүү аракети, тил илиминде да, билимде да өтө жооптуу түйшүктөрдөн болуп саналат жана мындай аракет биринчиден, илимий ойлордун, бир эле мезгилде теориялык адабияттарга таянуу менен, экинчиден, конкреттүү мисалдардын негизинде бекемдөө.\n" +
                        "Кыргыз тили илиминде сөздүк түзүү иши 1928-жылы башталып, андан бери ар кандай түмөн-түйшүктүү жолду басып өткөн, өтүп да жатат. Үстүбүздөгү учурда да (эгемендүүлүк жылдары да) сөздүк түзүү иши турмуштук зарылдык менен муктаждыкты канааттандыруу үчүн жашап жаткандыгы маалым.\n" +
                        "XIX-XX кылымдарда сөздүк түзүү, анын принциптерин, жол-жоболорун иштен чыгууда, ишке ашырууда: алфавиттик-семантикалык (мунун өзөгүндө логикалык ырааттуулук сакталуу менен) тартип ишке ашырыла баштап, ал турмушта (илимде) акырындап орун ала баштады. Сөздүк түзүү ишинде (ошол эмгек жазылган же басылып чыккан) доордун талабы, илимдеги жетишкендик эске алынып түзүлүп жатат. Бардык доордо (биздин замандан бери) сөздүк түзүү ишинде семантикалык принцип таяныч катары каралып, ага кошумча социалдык жагдайдын үнү (саясаттын эпкини) эске алынуу менен түзүлүп келе жатат. Буга атактуу, дүйнөлүк түрколог, лексиколог дагы, лексикограф дагы Махмуд Кашкаринин “Девани лугат-ит түрк сөздөрүнүн жыйнагы”(XI) деген эмгеги мисал болот. Түрк тилдеринде бардык доордо (азыркы XX-XXI кылымдарда деле) туруктуу сөздүк фонду болгон. Ал сөз жасоодо уютку (булагы же кор борбору) болуп кызмат өтөйт, өтөп да жатат. Мындай көрүнүштү түрк тилдери боюнча түшүндүрмөлүү сөздүктөрдөн кезиктиребиз.\n" +
                        "Түрк (анын ичинде кыргыз) тилине тиешелүү лексикографиялык эмгектер тууралуу тарыхый обзор түрүндө маалыматтар И.Абдувалиевдин “Этимология жана лексикография” (2007, 43-113-б.) деген эмгегинде берилген.\n" +
                        "Кыргыз лексикасы – кыргыз элинин көптөгөн кылымдардан бери улам толукталып – байып, коомдук милдет аткарып келе жаткан түбөлүктүү кенчи, улуттун улуу жана ыйык байлыгы.\n" +
                        "Лексика бир тилдин сөздүк курамынын жалпы жыйындысы болгондуктан, ал тилдин курулуш материалынын кызматын аткарып, сөздүн пайда болушун жана жашашын шарттайт да, анын өнүгүш жолу менен калыптанышын чагылдырат. Ошону менен бирге сөз зат жөнүндө түшүнүк берүү кызматын да өтөйт. Сөздүн мына ушундай өзүнчөлүгү менен кошо табияты дүйнөнү таанып – билүүдө, пикир алмашууда айрыкча роль ойнойт жана адамзаттын пикир алышуусундагы негизги каражат болуп саналат. Өз кезегинде мындай жагдай дагы ар кандай лингвистикалык факторлор менен да түшүндүрүлөт.\n" +
                        "Сөз аркылуу ой берилет, туюнтулат. Сөз үйрөнүү – пикир алышуунун өбөлгөсү.\n" +
                        "Мына ошондуктан элдин тилиндеги лексикалык кенчти практикада колдоно билүү жана жалпы эле калктын сөз байлыгын кагаз бетине түшүрүп, унификациялап, аралыкка жана алыстыкка бере билүү үчүн, ошондой эле элдин маданий, илимий муктаждыгын канааттандыруу максатында лексикографиялык иштер жүргүзүлөт, сөздүктөр түзүлөт. Ал үчүн эне тилдеги сөздөрдү жыйноо, жыйналган сөздөрдү системага салуу (иреттештирүү) жана аларды сөздүк (лексикон) түрүндө басып чыгаруу аракети иштиктүү колго алынуу милдети келип чыгат.\n" +
                        "Тилдин өз алдынча мааниге ээ болгон эң кичине бирдиги – сөз, ал эми сөз маанисин ажыратуучу эң кичине бөлүкчө - фонема деп аталат.\n" +
                        "Тилдин бул эки деңгээли, анын башка деңгээлдериндей эле, ар түрдүү аспектиде талдалат, изилденет. Сөз кантип түзүлдү, кандай өзгөрөт, кантип жашап жатат, сөздүн турмушу (лингвистикалык табияты) кандай айкалышат, кандай маани берет деген өңдүү суроолорду чечмелөө үчүн тилдин лексикасын изилдөө керек.\n" +
                        "Ал эми изилдөө ишинде, ошондой эле базар мамилесинин күн тартибинде сөздүк жаратуу иши бөтөнчө актуалдуу аракеттерден болуп саналууда да, замананын агымдуу талабына шайкеш келбеген, өлкөнүн илимий талабын канааттандыра албаган жагдай өкүм сүрүүдө.\n" +
                        "Сөздүк түзүү иши – түйшүктүн түйшүгү, поэтикалык тил менен айтканда, аң-сезимдүү түрдө эле бейиштен тозокко түшүп берүү. Мындай эрдикке өз элинин чыныгы уулу, кулуну гана жарайт.\n" +
                        "Ар кандай сөздүк түзүү аракети адистин (лексикографтын) сөз жыйноо, жыйнаган сөздү бул же тигил принцип (жол-жобо) боюнча иреттештирүүдөн башталат, чечмелеп айтканда, сөздүк түзүү аракети сөз жыйноодон башталып, жыйналган материалды (сөздү) эң алгач кандайдыр бир системага, принципке, принциптерге ылайык ырааттуулукка келтирүү менен сөздүк түзүүнүн тибине, түрүнө жараша ишке ашырууга жараша максаттуу багытталат. Мындай аракет кыргыз тил илиминде академик В.В.Радловдун “Опыт словаря тюркский наречий” деген төрт томдук 8 (сегиз) китептен турган фундаменталдуу эмгегинен башталат. Анда түрк тилдеринин лексикасы менен бирге кыргыз тилинин дагы бир миңдей сөзү камтылган. Бул сөздөр толукталып-такталып улам кийинки сөздүктөргө уютку/көрөңгө болуп берген.\n" +
                        "Кыргыз лексикографиясына, окуу процессине жана тарыхый лексикография (бөтөнчө сөздүк түзүү) ишине карата төмөндөгү илимпоздор пикир айтышкан:\n" +
                        "А. Жалилов “Азыркы кыргыз тили” (1996);\n" +
                        "А. Сапарбаев “Кыргыз тилинин лексикологиясы жана фразеологиясы” (1997);\n" +
                        "\nИ. Абдувалиев “Этимология жана лексикография” (2007);\n" +
                        "С. Өмүралиева “Азыркы кыргыз тили: Лексикология” (2009).\n " +
                        "\n\n\nСөздүк түзүүнүн тарыхы жана анын принциптери\n\n" +
                        "Кыргыз тилинде алгачкы сөздүктөр XX кылымдын 30-жылдары пайда боло баштайт. Алар көлөмү жагынан анчалык чоң эмес, түзүлүшү жөнөкөй, принциптери көп деле так иштелбеген. Ошого жараша материалы да аз жана жупунураак болуп, илимдин айрым гана тармактарына арналган.\n" +
                        "Улам илим-билимдин, экономиканын, маданияттын өнүгүп-өркүндөлүшүнө байланыштуу сөздүк түзүү аракети кеңейген, тарамдалып-такталып сөздүк түзүү принциптери илимий багытта такталат.\n" +
                        "Бүгүнкү күндө кыргыз лексикографиясында сөздүк түзүүдө илимий аппарат; сөзгө (терминге) шилтеме жасоо, терминдин доминантын аныктоо; варианттарына туташтыруу; омонимдерди, синонимдерди берүү, кыскартууларды пайдалануу, дагы ушул сыяктуу көмөкчү каражаттар дээрлик жолго салынган, колго алынган. Буга айрыкча “Кыргыз энциклопедиясы” (мурдагы “Кыргыз Совет Энциклопедиясын” – КСЭнин (1976-1980-жылдары 6 томдон турган) аттуу эмгектин жарык көрүшү даана мисал боло алат.\n" +
                        "Ушул кезде (1990-2010-жылдардын аралыгында) кыргыз тилиндеги (ошондой эле кыргызча-орусча, орусча-кыргызча) энциклопедиялык- тармактык, ономастикалык сөздүктөр дүйнөлүк илимий стандарттар менен принциптерге жакын, кээде ага ылайык жарык көрүп жатат.\n" +
                        "Кыргыз тилинде К.К.Юдахиндин “Кыргызча-орусча сөздүгү” (1940, 1965), Х.Карасаевдин “Кыргыз тилинин орфографиялык сөздүгү” (1966, 1983, 2009), Ж.Мукамбаевдин “Кыргыз тилинин диалектологиялык сөздүгү” (1972, 1976, 2009), Ш.Жапаров менен К.Сейдакматовдун “Кыргыз тилинин синонимдер сөздүгү” (1984) кийинки кыргызча, кош тилдүү, терминологиялык, тармактык сөздүктөрдүн түзүлүшүнө, жаралышына өбөлгө түзөт.\n" +
                        "1976-1980-жылдары кыргыздын улуттук универсалдуу 6 (алты) томдуу “Кыргыз Совет Энциклопедиясы” (КСЭ) жарык көргөн. Бул эмгек өзгөчө урматтоо, сыймыктануу менен сөз кыла турган залкар-фундаменталдуу, оригиналдуу эмгек, улуттук улуу байлык. Ошондуктан ал ар дайыма өзүнчө жана өзгөчө сөз кылууга арзыйт.\n" +
                        "Сөздүк – 1. Сөздөрдүн жыйнагы, топтому; 2. Маалымат берүүчү китеп, эмгек; 3.Лексикографиялык илимий чыгарма; 4. Сөздөрдүн негизинен алфавит тартибине келтирип, мааниси (же формасы) чечмеленет, мисалдар менен жабдылган, пайдаланууга ылайыкталган китеп же китеп кылып чыгарууга даярдалган кол жазма (чыгарма).\n" +
                        "\n\n\nСӨЗДҮКТӨРДҮН ТИПОЛОГИЯЛЫК ЖАКТАН БӨЛҮНҮШҮ\n\n" +
                        "Сөздүктөр бүгүнкү күндүн деңгээлинде камтыган материалына, алардын шөкөттөлүшүнө, ошону менен катар маалыматтарына, берген аныктамаларга жана талабы менен мүнөзүнө, алдына койгон илимий-практикалык максаттарына, милдеттерине жана канчалык даражада бүгүнкү күндөгү илимдеги жаңылыктарды чагылдыра алгандыгы, бул багыттагы салттуулукту сактоо менен сөздүк түзүү ишиндеги илимий-теориялык жетишкендиктерди пайдаланып, турмушка жакын, турушуна ылайык реализациялай билишине карай төмөндөгүдөй типтерге бөлүнөт:" +
                        "\nI. Энциклопедиялык сөздүктөр (же энциклопедиялар)." +
                        "\nΙΙ. Филологиялык (же лингвистикалык) сөздүктөр." +
                        "\nIII. Ономастикалык сөздүктөр." +
                        "\nIV. Терминологиялык-тармактык сөздүктөр." +
                        "\nV. Аймактык (чөлкөм таануу багытындагы) сөздүктөр.\n" +
                        "\n\n\nI. ЭНЦИКЛОПЕДИЯЛЫК СӨЗДҮКТӨР (ЖЕ ЭНЦИКЛОПЕДИЯЛАР)\n\n" +
                        "Энциклопедиялык сөздүктөр (же энциклопедиялар) илим – билимдин, маданияттын, экономиканын өсүшүнө, техникалык прогресстин натыйжасында жаралган жана цивилизациянын уламдан-улам жаңы баскычка, тепкичке, ошондой эле жаңы сапатка жана касиетке ээ болушуна кызмат кылат.\n" +
                        "Энциклопедиялык сөздүктөр (же энциклопедиялар) сөздү эмес, нерсени, кубулушту, көрүнүштү, түшүнүктү, денотатты, алардын 3 (үч) илтик негизги касиетин, аларга негиз болгон терминди чечмелеп түшүндүрөт, мүнөздөмө берет, иллюстративдик маалыматтар, чиймелер, сүрөттөр кеңири керектелет.\n" +
                        "Кыргыз тилинде энциклопедиялык сөздүктөр 1976-жылдан бери чыгып келе жатат. Кыргызча энциклопедиялык сөздүктөрдүн үлгүсүнө «Кыргыз Совет Энциклопедиясы» (1976-1980, 6 томдук) мисал боло алат.\n" +
                        "Ушул кезде “Кыргызстан улуттук энциклопедиясы” (2008) деген ат менен анын 8 (сегиз) томдуу жаңысы даярдалып, анын 2 тому жарык көрдү. Бул фундаменталдуу чыгарма болжолдуу түрдө 2015-жылы толук жарык көрүшү керек.\n" +
                        "Энциклопедиялык сөздүктөр максаттуу багытына, басылыш көлөмүнө карай төмөндөгүчө бөлүнөт:\n" +
                        "\n1. Көп томдуу улуттук универсалдуу сөздүк.\n" +
                        "2. Терминологиялык багыттары боюнча түшүндүрмө сөздүктөр.\n" +
                        "Энциклопедиялык сөздүктөр схема, карта, сүрөттөр, шилтемелер,\n" +
                        "кыскартуулар ж.б. шөкөттөр менен коштолот да, ойдун окурманга жеткиликтүү болушу үчүн көмөктөшөт, коштолот.\n" +
                        "Энциклопедия түзүү ишинде жана ага карата колдонуучу иштиктүү талаптардын бири сөздүк түзүү, белги (көлөм) маселеси, чечмелеп айтканда, даярдалып жаткан эмгекке бериле турган сөздөр-терминдер, аларга канчалык көлөм чегериле тургандыгы көңүлдүн борборунда болот. Албетте, энциклопедиялык эмгекти (эмгектерди) жаратууда адистер-энциклопедисттер (билими, түшүнүгү терең адамдардын) ролу маанилүү болот.\n" +
                        "“КСЭ”-“Кыргыз Совет Энциклопедиясы” улуттун улуттук сыймыктуу жүзү, илимий күзгүсү, мезгилдин руханий дөөлөтү, түбөлүктүү кенчи. Бул эмгек – улуттук-универсалдуу энциклопедия деп аталат. Бул аталыш (ат) менен бүгүнкү кыргыз илимий интеллегенция макул.\n" +
                        "Дүйнө элдеринде улуттук энциклопедиясы бар элдер маданияттуу калктардын катарында каралат жана энциклопедиялык эмгектердин ар дайыма толукталып (ошол эле учурда жаңыланып) турушуна кам көрөт. Улуттун маданий сыймыгы болуп саналат.\n" +
                        "\n\n\nII. ФИЛОЛОГИЯЛЫК СӨЗДҮКТӨР\n\n" +
                        "Дүйнөлүк лингвистикалык багытта (ошондой эле кыргыз лингвистикасында да) филологиялык сөздүктөр эң алгач жаралып, такталып-толукталып, турмуштук зарылдык менен муктаждыкты канааттандырууга багытталып, илим-билимдин өсүшүнө өбөлгө түзүп, улам кийинки жаралган, жарала турган сөздүктөргө система катары кызмат кылат жана дагы мындай типтеги сөздүктөрдүн өздөрү да илимий жактан изилденип, теориялык жактан анализге алынып, сөздүк түзүү практикасына багыт берип турган, жол көрсөтүп да турат.\n" +
                        "Мындай типтеги сөздүктөрдүн дээрлик баары улуттук узак жана улуу менталитет менен байланышып, өзөндүү патриотизм алкагында жайгашкан.\n" +
                        "Дүйнөлүк лингвистикалык маданиятта, сөздүк түзүү-жазуу ишинде филологиялык сөздүктөр эң алгачкы жана көп түрдүү, ар кыл тармактуу болгон. Ал мындай милдетти азыркы доордо да активдүү аткарууда.\n" +
                        "Филологиялык сөздүктөр максаты менен милдеттерине камтыган материалына, багытталган окурманына (аудиториясына) карай:" +
                        "\n1. “Манас” эпосунун сөздүгү (сөздүктөрү).\n" +
                        "2. Адабияттык сөздүктөр.\n" +
                        "3. Лингвистикалык сөздүктөр.\n" +
                        "4. Паремиологиялык сөздүктөр (учкул/накыл сөздөрдүн сөздүктөрү).\n" +
                        "5. Салыштырмалуу сөздүктөр.\n" +
                        "6. Автордук сөздүк(төр), көркөм чыгарманын тилинин сөздүгү (сөздүктөрү) - деп бөлүнөт." +
                        "\n\n\n1. “МАНАС” ЭПОСУНУН СӨЗДҮГҮ (СӨЗДҮКТӨРҮ)\n\n" +
                        "Ушул кезде “Манас” эпосунуну 1000 жылдыгына карата “Манас” эпосунун 2 томдуу энциклопедиялык сөздүгү жарык көрдү. Азыр ал элге кызмат кылууда." +
                        "Кыргыздын мекенчил-патриот уулдарынын бири – профессор Ташполот Садыковдун жетекчилиги жана тикелей өзүнүн катышуусунда улуу манасчыларыбыз: Сагынбай Орозбак уулу, Саякбай Карала уулу жана кытайлык дагы бир залкар, жазма манасчыбыз Жүсүп Мамайдын нускоолорунун негизинде “Манас” эпосунун чоң көрсөткүч сөздүгүнүн “Кыргызча-түркчө, кыргызча-англисче, кыргызча-орусча, кыргызча-кытайча, кыргызча-немисче, кыргызча-фарсыча” сөздүгү / маалыматтар базасы (1500 бет көлөмүндөгү) аттуу эмгек жарык көрөр алдында турат. Булардын ичинен 2011-жылы “Манас: Кыргызча-түркчө чоң көрсөткүч сөздүк” Türk Dil KurumYayınları колдоосу менен жарык көргөн. Жалпы көлөмү 1647 бет.\n" +
                        "\n\n\n2. АДАБИЯТТЫК СӨЗДҮКТӨР\n\n" +
                        "Кыргыз адабиятын изилдөөдө, сөздүк өңүтүндө К.Асаналиев, Р.З.Кыдырбаева, Ж.Шериев, А.Муратов сыяктуу жана башка илимпоздорубуз эмгектенишкен, аракеттенишип жатышат. Алсак: Р.З.Кыдырбаева менен К. Асаналиевдин Кыргыз адабий тилинин терминдер сөздүгү (- Б.: БГУ, 2004.- 571 б.); Ж. Шериев менен А. Муратовдун Кыргыз адабияты: Терминдердин түшүндүрмө сөздүгү (Мектеп окуучулары үчүн.- 2-басылышы.- Б.: Мамлекеттик тил жана энциклопедия борбору, 2003.- 200 б.)." +
                        "\n\n\n3. ЛИНГВИСТИКАЛЫК СӨЗДҮКТӨР\n\n" +
                        "Лингвистикалык сөздүктөр камтылган материалына, түзүүнүн принцибине жана алдына койгон максаты менен милдеттерине, ошондой эле басылып чыккан эмгектерге карай төмөндөгүдөй топторго бөлүнөт:" +
                        "\nКотормолуу сөздүктөр. \nОрфографиялык сөздүктөр. \nТүшүндүрмө[лүү] сөздүктөр. \nСинонимдик сөздүктөр." +
                        "Омонимдик сөздүктөр.\n" +
                        "Антонимдик сөздүктөр.\n" +
                        "Грамматикалык сөздүктөр. \nЭтимологиялык сөздүктөр. \nДиалектологиялык (диалектик) сөздүктөр. \nФразеологиялык сөздүктөр. \nӨздөштөрүлгөн сөздөрдүн сөздүктөрү. \nМорфологиялык сөздүктөр.\n" +
                        "Тарыхый сөздүктөр.\n" +
                        "Неологизм (жаңы) сөздөрдүн сөздүгү. \nОрфоэпиялык сөздүктөр.\n" +
                        "Жыштык сөздүктөр.\n" +
                        "Кери сөздүктөр." +
                        "\n\n\nКОТОРМОЛУУ СӨЗДҮКТӨР\n\n" +
                        "Бүгүнкү күндө (2010, ΧΙΙ) кыргыз тили илиминде котормо сөздүктөрдүн төмөнкүдөй түрлөрү түзүлгөн, басылып чыккан:\n" +
                        "\n\n\nОрусча-кыргызча сөздүктөр\n\n" +
                        "Орусча-кыргызча сөздүктөрдүн башталышы 1938-жылы түзүлүп, Казан шаарында жарык көрөт. Аны Х.Карасаев менен И.А.Батмановдор түзүшкөн. Мындай багытта К.К.Юдахин “Орусча-кыргызча сөздүк” (1944, 1957), Ж.Шүкүров, Ю.Янсаншин, Б.Орузбаева жана башкалар эмгектенишет.\n" +
                        "Кыргызча-орусча сөздүктөр (К,К.Юдахин, 1940, 1965).\n" +
                        "\nКыргызча-орусча-немецче / немецче-орусча-кыргызча сөздүктөр\n" +
                        "Сүйүнбаева Г., Жолдошбеков А., Шамбаев С. Кыргызча-орусча-немецче сөздүк (Фрунзе: Мектеп, 1977.- 257 бет).\n" +
                        "Плутицкий А. М., Рахманов А. Немецче-орусча-кыргызча сөздүк (Фрунзе: Мектеп, 1974.- 367 бет).\n" +
                        "Кауфман С.А., Сүйүнбаева Г.Д. Немецче-кыргызча сөздүк (Фрунзе:" +
                        "Мектеп, 1973.- 344 б.).\n" +
                        "Умаров К., Токсонова С. Немецче-орусча-кыргызча сөздүкчө: Мектеп окуучулары үчүн (3000 нускада). (Фрунзе: Мектеп, 1981.- 73 б.)." +
                        "\n\nКыргызча-орусча-англисче сөздүк\n" +
                        "Жусаев Ж., Шамбаев С. Кыргызча-орусча-англисче сөздүк (Фрунзе: Мектеп, 1978.- 231 б. 4000 нускада).\n" +
                        "\n\nАнглисче-кыргызча сөздүк\n" +
                        "Турсуналиев Т. Англисче-кыргызча сөздүк: Мектеп окуучулары, мугалимдер, аспиранттар, илимий кызматкерлер үчүн (Фрунзе: Мектеп, 1980.- 383 б.)." +
                        "\n\nЛатынча-орусча-кыргызча сөздүк\n" +
                        "Турсуналиев Т. Латино-русско-киргизский словарь: (Кыргыз мед. инст. студенттери үчүн) (1985, 89 бет).\n" +
                        "\n\n\nОРФОГРАФИЯЛЫК СӨЗДҮКТӨР\n\n" +
                        "“Орфографиялык сөздүк” бир элдин адабий тилиндеги сөздөрдү туура жазуу (иреттөө жана унификациялоо) максатын көздөйт да, жазма маданият менен байланышкан.\n" +
                        "Кыргыз тилинин алгачкы орфография сөздүгү 1938-жылы жарык көргөн.\n" +
                        "\n1942-жылы белгилүү филолог Багданова Мадина Искендеровна түзгөн кыргыз тилинин орфографиялык сөздүгү жарык көргөн.\n" +
                        "\n1956-жылы Х.Карасаев менен Ю.Яншансиндин “Кыргыз тилинин орфографиялык” сөздүгү басылып чыгат. Бул эмгек 1953-жылы кабыл алынган орфографиялык эрежебизге ылайык түзүлгөн.\n" +
                        "\n1966-жылы профессор Х.Карасаевдин “Орфографиялык сөздүгү” 60000 (алтымыш миң) сөздү камтыйт да, 1953-жылы жарыяланган эрежеге ылайыкталат.\n" +
                        "\n2009-жылы (640 б.) Х.Карасаевдин 80 000 сөздү камтыган – толукталып, кайрадан басылган “Кыргыз тилинин орфографиялык сөздүгү” жарык көрдү. Ал “Кыргыз тилинин жазуу эрежелеринин” (соңку редакциянын) (базасында – 2009, 32 б.) басылып чыкты.\n" +
                        "Каратай Сартбаев менен Садык Үсөналиевдин чакан “Орфографиялык сөздүкчөсү” бир нече жолу жарык көргөн жана мектеп окуучуларына арналган." +
                        "\n\n\nТҮШҮНДҮРМӨ СӨЗДҮКТӨР\n\n" +
                        "Эне (улуттук) тилдеги сөздөрдү синхрондуу жана диахрондук багытта лексика-семантикалык, стилистикалык өңүттө филологиялык-лингвистикалык талапка ылайык даярдалган эмгектер түшүндүрмө сөздүктөр деп аталат.\n" +
                        "Кыргыз тили илиминин мындай эмгектин алгачкысы 1969-жылы КРнын УИАсынын Тил жана адабияты институтунда жааматтын катышуусу менен анын бир томдугу түзүлгөн.\n" +
                        "Кыргыз тили илиминде лингвист кадрлардын түптөлө башташына жана илим-билимдин турмуштук зарылдыгына (жана калктын аң-сезиминин өсүш талабына) ылайык “Кыргыз тилинин түшүндүрмө сөздүгүнүн” кезектеги басылышы күн тартибине коюлат. Натыйжада мындай эмгектин 2 томдугун басып чыгаруу аракети жаралат-пландаштырылат. Бирок жамаат түзгөн эмгектин 1-тому (А-күрө) 1984-жылы жарык көрөт да, токтолуп турат.\n" +
                        "Кыргыз тилинин сөздүгү: (50 миңден ашык сөз жана сөз айкашы).- Б.: AVRASVA PRESS, 2010.- 1460 Б. КР УИАнын корр. – мүчөсү А.Акматалиевдин жалпы редакциялыгы – жетекчилиги менен жарык көргөн.\n" +
                        "Аталган эмгекке карата “Кыргыз туусу” газетасында (2010, 9-февралда) атайын жана чакан пикирди келтиребиз:\n" +
                        "\n\n\nУЛУТТУК УЛУУЛУККА УМТУЛУУ\n\n" +
                        "Сөздүк түзүү - түйшүктүн түйшүгү, тозоктун тозогу. Мындай пикирди өз башынан өткөргөн, алектенген залкар лексикографтар айтышкан.\n" +
                        "2010-жылдын башында (январында) кыргыз элинин илимий жана руханий турмушунда өзгөчө олуттуу, маданий окуя болду. «Кыргыз тилинин сөздүгү» (Бишкек: Avrasva рress, 2010, 1460 бет) деген улуттук сыймыктана турган эмгек жарык көрдү.\n" +
                        "Бул «Сөздүктүн» 3-5-беттериндеги маалыматтарга, анын мазмунундагы материалына караганда жана дүйнөлүк сөздүк түзүү практикасына таянсак, бул эмгек лексикографиялык номинация боюнча «Кыргыз тилинин түшүндүрмө сөздүгү» деп аталса, маңызына жакын болмок. Сөз жүрүп жаткан эмгек кыргыз тилиндеги бул багыттагы мурдагы жарык көргөн эмгектердин логикалык жалгашмасы, чыгармачылыктагы уландысы болуп саналат.\n" +
                        "Сөз жүрүп жаткан эмгектин башында: «50 миңден ашык сөз жана сөз айкашы камтылды» деп айтылган. Ал эми ушул эмгектин 1096-бетинде «сөз айкалышы эки же бир нече сөздүн грамматикалык жактан байланышкан тизмеги» деп берилген. Башка билдирүү жок. Демек, аталган маалымат: 1) грамматикалык категория (лексикалык категория эмес); 2) туруктуу сөз айкашы эмес – фразеологизм жөнүндө сөз болгон жок. Фразеологизмдерди берүүдө тактык байкалбайт.\n" +
                        "Илимий, ошондой эле көркөм адабияттарга шилтеме жасоодо жана пайдаланууда библиографиялык стандарт сакталат, пайдаланат. Сөз жүрүп жаткан чыгармада 1957-1958-беттеринде андай талаптын изи байкалбайт. Бул жерде автордук укук жана этика маселеси толук сакталбаган, эсепке алынбаган.\n" +
                        "Ушул 2010-жылдын бийиктигинен жана дүйнөлүк лексикографтын талабынан назар салганда, сөздүк түзүү ишинде варианттуулукту кыскартуу, ал аркылуу аз эмгек жумшап, мыкты натыйжага жетишүү аракетине көп көңүл бурулат жана шилтеме жасоо ыкмасына басым жасалат. Мындай көрүнүшкө бул сөздүктө аз көңүл бурулган.\n" +
                        "Эмгектин башындагы «Тил - элдин автопортрети» деген түшүндүрмөсү солгун, начарыраак жазалып калгансыйт.\n" +
                        "Этиштин мүчөлөрүн, формаларын берүүдө изденүүчүлүк аракети сезилбейт. Мисалы, чоолжуу ч о о л ж у этишинин кыймыл атоочу (1333-б.).\n" +
                        "Казанда болсо, чөмүчкө илинет. Ушул күнгө чейинки залкар лексикограф инсандарыбыз: К.К.Юдахин, Б.М.Юнусалиев, Х.К. Карасаев, Ж.Шүкүров, Б.Орузбаева, Ж.Мукамбаев, Д.Исаев, Ж.Осмонова, К.Сейдакматов, А.Осмонкулов, К.Конкобаев жана башкалар кыргыз лексикографиясынын фундаментин түзүп беришкен. Алардын асыл эмгектерине ыраазычылык менен мамиле кылып, шүгүрчүлүктө, каниет менен мамиле кылышыбыз керек. Сөз болгон эмгекте ошондой мамиле жасалган.\n" +
                        "\nАталган «Сөздүк» колдонууда-пайдаланууда практикалык жактан – бир аз кыйындык жаратып турат.\n" +
                        "\n\n\nСИНОНИМДИК СӨЗДҮКТӨР\n\n" +
                        "Бир тилдеги маанилеш сөздөрдүн топтому синонимдик сөздүк деп аталып, андагы мындай сөздөрдүн семантикалык, стилистикалык категорияларына көңүл бурулуп, мисалдар менен коштолот. Буга Ш.Жапаровдун алгачкы “Азыркы кыргыз тилиндеги синонимдер” (Фрунзе, 1971) деген эмгеги мисал болот." +
                        "Ш.Жапаров менен К.Сейдакматовдун “Кыргыз тилинин синонимдер сөздүгү” (Фрунзе, “Илим”, 1984, 470 б.) 2000 нуска менен басылып чыккан. Анда биринчи жолу илимий мүнөздө, азыркы кыргыз адабий тилиндеги синонимдер толук жана кеңири-академиялык мүнөздө басылып чыгат: ар бир синонимдик катарга түшүндүрмө берилип, мисалдар менен шөкөттөлүп, китептин аягына тиркеме түрүндө синонимдердин көрсөткүчү (индекси) берилип, дагы башка маалыматтар (шилтемелер) менен жабдылат.\n" +
                        "Бул “Сөздүк” Кыргызстандан тышкары өлкөлөргө (Кытайга, Германияга, Өзбекстанга, Ташкентке) тарайт. Кытайда – Үрүнчү шаарында аталган эмгек синонимдик сөздүк катары кыскача варианты басылып чыгат. Ошондой эле бул китепте 1984-жылга чейинки кыргыз тилинин синонимикасына жана ушул багыттагы түркологияга байланыштуу илимий маалыматтар да камтылат.\n" +
                        "Сартбаев К., Үсөналиев С. Кыргыз тилинин синонимдер сөздүгү: Орто мектептин 4-10-класстары үчүн (Фрунзе: Мектеп, 1973.- 44 б.) бир нече жолу басылып чыгат." +
                        "\n\n\nОМОНИМДИК СӨЗДҮКТӨР\n\n" +
                        "Кыргыз тилинин омонимдер сөздүгү“ (Фрунзе: Илим, 1986. 324 б. Ш.Жапаров, Д.Исаев, К.Конкобаев, Ж.Осмоновдор түзүшкөн) жарык көргөн. Анда эки миңден ашык омоним сөз камтылган. Кыргыз тили илиминдеги (лексикографиясындагы) биринчи жолу мындай иштиктүү аракет ийгиликтүү жасалган жана сөздүк түзүү ишиндеги кыргыз илимпоздорунун лексикографиялык жетишкендиги катары карашат. Мындай чыгарма кайрадан толукталып-такталып басылып чыга элек жана андай эмгектин башка варианты да жок." +
                        "\n\n\nАНТОНИМДИК СӨЗДҮКТӨР\n\n" +
                        "“Антонимдик сөздүк” ойдун жеткиликтүүгүн камсыз кылып, пикирдин таасирдүү болушуна шарт түзөт да, стилистикалык кызмат кылат, чечендикке жол ачат.\n" +
                        "Мындай “Кыргыз тилинин антонимдер сөздүгү” (Фрунзе: Илим, 1988, 238 б., Ш.Жапаров, Д.Исаев, К.Конкобаев, Ж.Осмоновдор түзүшкөн) кыргыз тили лексикографиясына илимий негизде, атайын сөздүк түзүүнүн жол-жоболоруна ылайык такшаган адистердин катышуусунда түзүлүп, жарык көргөн, практикалык муктаждыкты канаттандырууга – илимий кызматкерлерге, котормочуларга, студенттерге, окуучуларга багытталган эмгек.\n" +
                        "“Сөздүктүн” аягында антонимдик катыштыгы сөздөрдүн индекси берилген.\n" +
                        "“Орусча-кыргызсча жана кыргызсча-орусча антонимдердин сөздүгү” (Фрунзе, 1986, түзүүчүлөр: Ж.Муратрлиева, Н.П. Колесников, С.В. Шербаков) мектеп окуучуларына жана кыргыз-орус (орус-кыргыз) тилдерин үйрөнүүгө, котормочуларга багытталган." +
                        "\n\n\nГРАММАТИКАЛЫК СӨЗДҮКТӨР\n\n" +
                        "Орузбаева Б.Ө., Закирова В. Грамматикалык терминдердин кыргызча- орусча сөздүгү (Фрунзе: Мектеп, 1981, 104 бет): Орто мектептин окуучулары менен окутуучуларына арналып түзүлгөн жеткиликтүү, түшүнүктүү сөздүк. Орузбаева Б.Ө. Русско-киргизский словарь лингвистических терминов: (Лингвистикалык терминдердин орусча-кыргызча сөздүгү). (Фрунзе: Илим, 1972, 425 бет). Биринчи жолу кыргыз филолог-студенттерине, окутуучуларга багытталган илимий, бирок түшүнүктүү жазылган фундаменталдуу жана\n" +
                        "салттуу принциптерди бедел туткан эмгек.\n" +
                        "Орузбева Б.Ө., Сагынбаева Б. Лингвистикалык терминдердин кыргызча-\n" +
                        "түркчө, түркчө-кыргызча сөздүгү (Бишкек, 2004, 100 бет).\n" +
                        "Дыйканов К., Жаманкулова М. Кыргыз тилинин грамматикалык\n" +
                        "терминдеринин сөздүгү (Фрунзе: Илим, 1962, 36 бет)." +
                        "\n\n\nЭТИМОЛОГИЯЛЫК СӨЗДҮКТӨР\n\n" +
                        "Этимологиялык сөздүк түзүү өзгөчө татаал жана бөлөкчө бир катаал, түйшүктүү жумуш. Мындай эмгекти жаратууга бардык эле мен илимпозмун дегендин оюна да, колунан да келе бербейт, даремати да жете бербейт.\n" +
                        "1988-жылы К.Сейдакматовдун “Кыргыз тилинин кыскача этимологиялык сөздүгү” жарык көргөн. Анда 974 (тогуз жүз жетимиш төрт) сөзгө, болгондо да - төл сөздөрдү, анын ичинен лексиканын байыркы катмарына, бөтөнчө түрк лексикасынын коруна, ага тиешелүү болгон уютку сөздөргө көңүл бурган. Ал айрыкча кызыгууну жаратат да, автордун теориялык билиминин терең экендигин айгинелейт. Сөз болгон китеп - оригиналдуу, изденүүчүлүктө жаралган барандуу чыгарма." +
                        "\n\n\nДИАЛЕКТОЛОГИЯЛЫК СӨЗДҮКТӨР\n\n" +
                        "1972-жылы залкар диалектолог, лексиколог, лексикограф жана бейнелүү этнограф Жээнбай Мукамбаевдин 20 жылдай дүйнө кезип, сөздүк жыйноо дербишчилигинен жаралган оригиналдуу, элден алып, кайра элдин өзүнө тартууланган кенчи. “Кыргыз тилинин диалектологиялык сөздүгү” (Фрунзе: “Илим”, 1972). Ар кандай обьективдүү жана субьективдүү себептерден улам ушул эмгек 1976-жылы кайрадан басылып чыгат.\n" +
                        "2009-жылы аталган эмгектин толукталган варианты жарык көрөт, чечмелеп айтканда: Мукамбаев Ж. Кыргыз тилинин диалектологиялык сөздүгү: (Сөздүктө 32 миңге жакын сөз камтылган).- Б.: КРнын УИАсы Ч.Айтматов атындагы Тил жана адабият институту, Гирнс америка университети, Түрк изилдөө жана таанытуу борбору, 2009.- 1379 бет. Бул эмгекти басмага даярдаган жана жалпы редакциясын жасаган таанымал филолог-профессор Кадыралы Коңкобаев.\n" +
                        "\n\n\nФРАЗЕОЛОГИЯЛЫК СӨЗДҮКТӨР\n\n" +
                        "Жамаат түзгөн “Кыргыз тилинин фразеологиялык сөздүгү” (Фрунзе: Илим, 1980, 18.5 басма табак көлөмүндө) жарык көрөт.\n" +
                        "2001-жылы Ж.Осмонова, К.Конкобаев, Ш.Жапаровдор түзүшкөн “Кыргыз тилинин фразеологиялык сөздүгү” (Бишкек, 2001, 519 б.), 1000 нускада, 65 басма табак көлөмүндө жарык көргөн. “Сөздүктө” 7980 (жети миң тогуз жүз сексен) фразеологиялык бирдик камтылган. Бул улуттук улуу дагы, көркөм дагы" +
                        "мурас болуп саналат. Аталган чыгарманы такшалган лексикограф адистер түзүшкөн. Бул эмгекке карата жылуу-илимий пикирлер арбын жолугат. Элге үзгүлтүксүз кызмат кылууда. Бул “Сөздүктү” жаратууда сөздүктүн фразеологизмдик доминант (өзөк же жөлөк вариантына) калган түрлөрү шилтеме жасоо жолу менен ишке ашырылгандыктан, пайдаланууга абдан ыңгайлуу шарт жараткан. Фразеологизмдердин ар бир курама боюнча жайгаштырылып, ошончо жерге берилип, ич ара туташтырылган, алфавит тартиби (ички алфавит – же микро ырааттуулугу) эске алынган. Эмгекте кыскача “Кириш” сөзү жана “Сөздүктүн курулушу, пайдалуу жолдору” чечмеленген. Кыскасы, сөз болгон эмгек дүйнөлүк лексикографиялык талапка, стандартка ылайык түзүлгөн.\n" +
                        "Профессор Х. Карасаевдин “Накыл сөздөр” деген (2 китептен турган) эмгеги мазмуну жагынан фразеологиялык сөздүктөргө да, “Өздөштүрүлгөн сөздөргө” да жакын турат. Н.Л. Хмельницкая менен А. Биялиевдин “Орусча-кыргызсча фразеологиялык сөздүгү” (1977) бул багыттагы котормолуу сөздүктөрдүн тобуна кошулат. 1,5 (бир жарым миңге) жакын фразеологиялык бирдикти ичине камтылган Г.Ж. Жамшитованын “Кыргызча-орусча, орусча-кыргызсча тематикалык фразеологиялык сөздүгү” (2000, 236 б.) окуу процессине ылайыкталып-жакындатылып түзүлгөн.\n" +
                        "Осмонкулов А., Акунова А.Р. “Өнөр алды - кыргыз-тил”: (ЖОЖдун студенттери үчүн түзүлгөн фразеологиялык минимумдун түшүндүрмө сөздүгү. 1-китеп).- Б., 2007.- 160 б.\n" +
                        "Ушул кезде (2010, ΧΙΙ) кыргыз тилинин фразеологиясы боюнча (ошондой эле кыргыз-орус тилдери боюнча да) бизде – Кыргызстанда такшалган жана таанымал адистер (кудайга шүгүр) жетиштүү эле санда, бар болгону аларды пайдалануу керек?!? Лексикографиялык баш аламандык жана кризис башталган жокпу?!?\n" +
                        "\n\n\nӨЗДӨШТҮРҮЛГӨН СӨЗДӨРДҮН СӨЗДҮКТӨРҮ\n\n" +
                        "Бул багыттагы сөздүктөрдүн жазылышына жана жарык көрүшүнө профессор Х.К. Карасаевдин эмгегине урматтоо менен мамиле кылууга милдеттүүбүз: “Накыл сөздөр” (1986), “Камус наама” (1996: араб, иран, кытай, монгол, орус тилдеринен оошуп келген жана) көөнөргөн сөздөрдүн тек жайын, этимологиясын түшүндүрүүгө, сөзгө тарыхый талдоо жүргүзүүдө кызматы чексиз.\n" +
                        "\n\n\nМОРФЕМАЛЫК СӨЗДҮКТӨР\n\n" +
                        "Ж. Мукамбаев менен А. Осмонкуловдун “Кыргыз тилинин морфемалык сөздүгү” (Фрунзе: “Мектеп”, 1978.- 380 б.). Мында сөздөрдүн курамына (уңгу, негиз, мүчө - мүчөлөргө) ажыратууга багытталып, морфологиялык талдоого көңүл бурулган. Демек, окуу процессине – теориялык алган билимди бышыктоого, тереңдетүүгө, чыңдоого жардам берет. Азырынча бул эмгек жападан жалгыз “Сөздүк” болуп саналат.");

                break;
        }
    }
}
